{
  "items": [
    {
      "_archived": false,
      "wp-published-date": "2013-05-06T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p>Readers and subscribers.. Two vital components of any successful blog.But where do you find them, and how do you bring them back time and again?By providing engaging and relevant content. You research their needs, understand their struggles, and give your community exactly what they're looking for.Where do you get started? With these 7 simple tactics to create blog content that spreads like wildfire.</p><h1 id=\"\">Simple Tactics to Create Blog Content That Spreads Like Wildfire</h1><h2 id=\"\"><strong id=\"\">  1.  Pick Your Niche </strong></h2><blockquote id=\"\">“Stop Writing about Everything. So many brands create content and try to cover everything, instead of focusing on the core niche that they can position themselves as an expert around. No one cares about your special recipe... Find your niche, and then go even more niche.– Joe Pulizzi, founder Content Marketing Institute</blockquote><p>Shareable content has a purpose. There is passion and authenticity behind it, a vision that is driven by overarching goals. Goals that were laid out when you started your blog.Before you begin to write your post, determine whether or not it is aligned with your desired goals. Will it produce the results you are hoping to achieve? Outlining the major points of your post and then fleshing each one out will keep you focused and on track.If a blog post feels forced, dump it and move on. If you can't connect to your content, you can be sure that no one else will.</p><h2 id=\"\"><strong id=\"\">  2.  Choose Your Words Wisely</strong></h2><blockquote id=\"\">“Writing without revising is the literary equivalent of waltzing gaily out of the house in your underwear.”― Patricia Fuller</blockquote><p>Clean up your post and eliminate all of your unnecessary or \"weakening\" words and/or phrases. (Adjectives and adverbs are typically the first ones to cut!)Remember that keyword density (the percentage of keywords used based on the number of words in your post) is a very important part of organic SEO. Optimizing your blog posts is one part of the writing process and a big step toward <strong id=\"\">increasing traffic to your website or blog.</strong></p><h2 id=\"\"><strong id=\"\">  3. Post Great Content, Consistently</strong></h2><blockquote id=\"\">“Content is king.” – Bill Gates</blockquote><p>There is no getting around this one.  Content is still king. Posting great content consistently is the key to creating shareable content.However, many writers find the obstacle to creating consistent content is perfection-itis. The need to make every word, every image, every call to action absolutely perfect. While we would all love each of our posts to win a Pulitzer, it is equally important to realize that sometimes <em id=\"\">good is good enough</em>.  Write your post, edit it and move on.By consistently posting, <strong id=\"\">increased traffic</strong> will begin to happen as readers refer and search engines find you.  With a little effort, your blog can and will change your business.</p><h2 id=\"\"><strong id=\"\">  4. Write Catchy Blog Titles</strong></h2><blockquote id=\"\">“The difference between the right word and the almost right word is the difference between lightning and a lightning bug.” Mark Twain</blockquote><p>The right title can create a viral sensation. It can cause your blog to be shared or fall into the sweet space of oblivion.Work to write short, effective headlines for blog posts. Start with your main keyword and then work it into your title and post.  The challenge is to make it feel natural. Always envision your consumer and speak to them directly. What would catch their attention?Your post titles should:</p><ul id=\"\"> \t<li id=\"\">Stimulate the curiosity of your readers and</li> \t<li id=\"\">Summon their emotions – whether it’s anger, frustration, happiness or excitement</li></ul><h2 id=\"\"><strong id=\"\">  5. Check the Readability of Your Post</strong></h2><blockquote id=\"\">“Don’t use words too big for the subject. Don’t say “infinitely” when you mean “very;” otherwise you’ll have no word left when you want to talk about something really infinite.” C.S. Lewis</blockquote><p>Reading your post out loud allows you to feel what your reader will feel as they read through it.  It also allows you to sense where you can edit or eliminate unnecessary verbiage.I always read my articles out loud (to my family's utter frustration) to hear each sentence's flow and make certain it isn't too wordy or choppy.There’s no shame in editing as you read through.  Practice makes perfect!</p><h2 id=\"\"><strong id=\"\">  6. Apply the Rule of One </strong></h2><blockquote id=\"\">“Good copy can't be written with tongue in cheek, written just for a living. You've got to believe in the product.” – David Oglivy</blockquote><p>Apply one of these rules to each of your posts:</p><ul id=\"\"> \t<li id=\"\">Offer a solution for your readers</li> \t<li id=\"\">Offer an answer that your competition isn’t</li> \t<li id=\"\">Show “how-to” do something</li> \t<li id=\"\">Encourage your readers through facts to make a decision</li> \t<li id=\"\">Entertain your readers through a relatable story</li> \t<li id=\"\">Inspire your readers through “feel-good” stories</li> \t<li id=\"\">Make your readers laugh, cry or think</li> \t<li id=\"\">Let your readers get to know you and understand that you really can make a difference in their life or situation</li></ul><p>Now ask yourself:  How does this article make the lives of my readers better or easier?</p><h2 id=\"\"><strong id=\"\">  7. Inspire Your Readers</strong></h2><blockquote id=\"\">“Amateurs sit and wait for inspiration, the rest of us just get up and go to work.” Stephen King</blockquote><p>Want to inspire your readers and create deeper connections? Intersperse fun, relatable stories with educational and informative articles while making it entertaining and engaging.You don’t need to do a hard sell to get people to buy from you.  You need authentic, relevant information that offers insight into who you are and <em id=\"\">why they need to take action with you today</em>.</p><h4 id=\"\">How are you creating blog content that spreads like wildfire? I would love to hear what works for you in the comments below!</h4>",
      "yoast-seo-meta-description": "Want to write a great blog post? Here's how! Discover simple tactics to create blog content that spreads like wildfire.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2013/05/7-Simple-Tactics-to-Create-Blog-Content-That-Spreads-Like-Wildfire.jpg|https://rebekahradice.com/wp-content/uploads/2011/08/increase-blog-traffic.jpg|https://rebekahradice.com/wp-content/uploads/2012/08/creating-content-that-spreads-like-wildfire.jpg|https://rebekahradice.com/wp-content/uploads/2013/05/create-content-that-spreads-like-wildfire.jpg|https://rebekahradice.com/wp-content/uploads/2013/05/create-blog-content-that-spreads.png",
      "name": "7 Simple Tactics to Create Blog Content That Spreads Like Wildfire",
      "wp-excerpt": "Once you have established your blog with consistent and relevant content, increasing your blog traffic is an important next step.  In order to generate buzz and gain traction, you will need to boost your blog’s online visibility.   It’s essential that you have a social media strategy as well as a consistent posting schedule and plan.\n\nTo achieve this, a crucial element to increased blog traffic is your content.",
      "yoast-reading-time": "4",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "7 Simple Tactics to Create Blog Content That Spreads Like Wildfire",
      "wp-image-alt-text": "7 Simple Tactics to Create Blog Content That Spreads Like Wildfire|increased blog traffic with engaging content|creating content that spreads like wildfire|create content that spreads like wildfire|7 Simple Tactics to Create Blog Content That Spreads Like Wildfire",
      "slug": "create-blog-content-that-spreads-like-wildfire",
      "updated-on": "2023-04-01T12:22:33.019Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:33.019Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282209f47c9570f73e0360"
    },
    {
      "_archived": false,
      "wp-published-date": "2013-04-03T00:00:00.000Z",
      "_draft": false,
      "wp-yoast-seo-title": null,
      "wp-content": "<p>Creating your first video is an exciting step. It can also be nerve-wracking.Whether you're using YouTube, Instagram, or TikTok, getting in front of the camera can feel scary.But what if using video to market your business could be fun and easy?</p><h5 id=\"\">Below are tips to help you create a video marketing strategy! Learn how to:</h5><ul id=\"\"> \t<li id=\"\">Write effective scripts</li> \t<li id=\"\">Capture the attention of your viewers</li> \t<li id=\"\">Post video on social media</li> \t<li id=\"\">Identify what camera, lighting and additional equipment you'll need to get started</li> \t<li id=\"\">Create high-quality videos for social media, your website, blog, and more!</li></ul><h1 id=\"\">Video Marketing Strategies: How to Use Video to Market Your Business</h1><h2 id=\"\"><strong id=\"\">Why Use Video Marketing in Your Business</strong></h2><p>Video marketing offers endless content to your website and blog and gives your visitors the opportunity to see the guy or gal behind that great content.  Use it for everything from educational to hyper-local videos.With the popularity of YouTube (We watch over <a href=\"http://expandedramblings.com/index.php/youtube-statistics/\" target=\"_blank\" id=\"\">6 billion hours on YouTube</a> per month!!) adding video to your online presence can be a game changer for your business.With over <a href=\"http://taggering-statistics-that-show-why-you-need-to-get-ready-for-periscope#.VoRA_5MrK34\" target=\"_blank\" id=\"\">2 million daily active users</a>, Periscope's meteoric growth is nothing to scoff at.Statistics show that 90% of people state that video was a driving force behind their online purchase. (Internet Retailer Study) Those are telling stats.Most people have to take the first step and that's scary.Whether it is fear of the camera or a fear of the unknown, stepping out there can be the hardest part. But now is the time to put on those big girl (or boy) pants and make it happen.But before you go diving in, let’s get you prepped with the first <strong id=\"\">3 steps to your video success</strong>.</p><h2 id=\"\">3-Step Process to Create High-Quality Videos</h2><h3 id=\"\"><strong id=\"\"> </strong> 1.  Choose Your Topic</h3><p>Your first stop is video topic ideation. Here you'll research, identify, and then create the topics that matter most to your audience.This process is a simple research approach that gets me headed in the right direction. You will use a few tools to find trending, relevant, and topical video content to create.</p><ul id=\"\"> \t<li id=\"\">YouTube</li> \t<li id=\"\"><a href=\"https://app.buzzsumo.com/\" target=\"_blank\" id=\"\">BuzzSumo</a></li> \t<li id=\"\"><a href=\"https://neilpatel.com/ubersuggest/\" target=\"_blank\" id=\"\">Ubersuggest</a></li></ul><p>Here's how:<strong id=\"\"> 1. Go to YouTube</strong> and search for your top 5 competitors. Scroll through their most recent videos. What type of video content are they creating? What's received the most views and engagement?</p><ul id=\"\"> \t<li id=\"\">What’s their video style? Are they high-energy, laid back, extremely professional?</li> \t<li id=\"\">What's their video length? Are they long form, short form, quick and to the point or lengthy (20 minutes vs. 2)</li></ul><p><strong id=\"\">2. Go to BuzzSumo</strong> and search by your competitors domain. The tool will list their content based on total engagement. You're</p><ul id=\"\"> \t<li id=\"\">Take note of the topics Your next step to video topic creation is answering the questions below.</li></ul><p><strong id=\"\"> </strong></p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/6428220827157380b0995f6c_using-video-to-market-your-business1-700x351.png\" alt=\"using-video-to-market-your-business1\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p><strong id=\"\">   3. Go to Ubersuggest</strong>This free keyword tool will help you uncover search volume, CPC, and competition for every keyword.Since I started using this tool several years ago, Neil Patel has made many helpful updates.First, add your keyword. But don't go broad or generic.For example, if I were running a blog about cycling, I'd stay away from a search on \"best bikes\" and instead get specific around your topic.I'd use the long tail keyword search \"best bikes for\" to get a long list of possible keywords.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/64282208271573402b995f6e_create-engaging-videos-for-social-media3-700x396.png\" alt=\"create-engaging-videos-for-social-media3\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p>Second, look to the note on ranking. How hard will it be to rank for this particular keyword?Before you create any video, you must answer an empathic, \"YES\" to each of these questions.</p><h5 id=\"\">Is your topic relevant to your audience?</h5><p>Is it interesting information, and does it provide a solution or answer to their needs?Look to your local news, industry headlines, and tools like <a href=\"https://www.semrush.com/sem2/?ref=8847019530&refer_source=&utm_source=berush&utm_medium=promo&utm_campaign=link\" target=\"_blank\" id=\"\">SEMrush</a> for keyword research on high demand topics.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/64282208271573e15d995f6d_using-video-to-market-your-business-1-700x349.png\" alt=\"using-video-to-market-your-business\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h5 id=\"\">Does your topic offer value to your viewers?</h5><p>You'll lose viewers as quickly as you capture their attention if your video:</p><ol id=\"\"> \t<li id=\"\">Rambles aimlessly</li> \t<li id=\"\">Has no key takeaway</li> \t<li id=\"\">Doesn't offer a solution</li> \t<li id=\"\">Isn't interesting or engaging</li> \t<li id=\"\">Lacks emotional appeal</li> \t<li id=\"\">Parrots what others are already saying</li> \t<li id=\"\">Doesn't include a call to action</li></ol><p>As you begin to research topics, always look at it from the perspective of your video viewer.What value does it offer and what will they be able to do better, have more of, increase in their business after watching?If you can't give solid answers to those questions, ditch the idea or topic.</p><h5 id=\"\">Does your content have an emotional appeal?</h5><p>Can you share a funny, poignant or inspiring story? Tapping into emotions isn’t necessary. However, it does help your viewers connect with you, your business and your message.</p><h3 id=\"\">  2. Create Your Script</h3><ul id=\"\"> \t<li id=\"\">Outline your key points – What is the number one goal of your video?</li> \t<li id=\"\">Include information that will connect with your audience.  For example, a personal story that relates to your topic.</li> \t<li id=\"\">Offer something that adds value to their life, solves a problem, gives them hope or shows them how to do something.</li> \t<li id=\"\">Create a very clear call to action.  What do you want them to do (opt in to your newsletter) or where what would you like them to check out (your new website).</li> \t<li id=\"\">Now practice, practice, practice!  I choose to do this in front of a mirror but you can also try it out on a loved one (This would be a supportive loved one that offers constructive, not destructive criticism!)</li> \t<li id=\"\"><a href=\"http://www.online-stopwatch.com/full-screen-stopwatch/\" id=\"\">Time your content</a> to ensure you move through your video quickly. (The average viewer won’t watch a video longer than 2 minutes)</li> \t<li id=\"\">Create note cards and position them near your camera or use an <a href=\"http://www.cueprompter.com/\" id=\"\">online teleprompter</a> to highlight your key points.</li></ul><h3 id=\"\">  3. Choose the Right Equipment</h3><p><strong id=\"\">Video Equipment</strong>Have you purchased a video camera? For me, I'm typically either on my Macbook Pro or my iPhone 6s Plus. Both provide an exceptional experience in both sound and visual quality.But if you're looking for something a little different, here's some great advice from <a href=\"http://www.omnicoreagency.com/best-vlogging-camera-2015/\" target=\"_blank\" id=\"\">Omni Core Agency</a>. (see their camera recommendations by clicking the link)</p><ul id=\"\"> \t<li id=\"\">DSLRs offer the best versatility when it comes to capturing both photos and video. If you use a lot of multimedia or want to blend photography and vlogging, choose a camera that can do both well.</li> \t<li id=\"\">Action cams are the best fit for bloggers who want to do vlogging on the move, whether it’s capturing their adventures or putting viewers in a first person point of view.</li> \t<li id=\"\">Cameras that require interchangeable lenses are not for the faint of heart. If you’re a beginner, stick to something simple and affordable before investing in expensive equipment that you might not need or use.</li> \t<li id=\"\">Figure out your needs first. Depending on the type of shooting you’ll be doing, you may need tripods, a camera with low-light recording capabilities, or enhanced audio. Sit down and really plan out how you want to use video to enhance your blog and then find a camera that can match your needs.</li></ul><p><strong id=\"\">Tripod</strong></p><ul id=\"\"> \t<li id=\"\">I love the flexibility of the <a href=\"http://joby.com/offer-k/?gclid=CMe58Jj48qECFRkcawodaydSnw&gclid=CNWFgICKtKoCFSN5gwod9Dou_A\" id=\"\">Gorillapod</a>!</li> \t<li id=\"\">I also use this <a href=\"http://www.amazon.com/Pre-Christmas-Premium-Selfie-Tripod-Android/dp/B00ZQV26PU/ref=sr_1_11?s=wireless&ie=UTF8&qid=1451508854&sr=1-11&keywords=iphone+6s+tripod\" target=\"_blank\" id=\"\">tripod/selfie stick</a> for events when I need to move around or capture unique camera angles.</li></ul><p><strong id=\"\">Lighting </strong>While natural lighting is always the best way to go, there are alternatives.  Below is listed from least to most expensive.</p><ul id=\"\"> \t<li id=\"\"><a href=\"http://www.amazon.com/s/?ie=UTF8&keywords=clamp+on+lights&tag=googhydr-20&index=aps&hvadid=3996546145&ref=pd_sl_rsiuzo73m_b\" id=\"\">Clamp Lights</a></li> \t<li id=\"\"><a href=\"http://joby.com/gorillatorch\" id=\"\">Gorilla Torch</a></li> \t<li id=\"\"><a href=\"http://www.ls-photostudio.com/shop/index.php/studio-set/popular-kits.html\" id=\"\">Box Lights</a> (kits)</li></ul><p>Just remember, when it comes to video and creating your online persona, Be Yourself!Creating your brand is about building credibility and trust between you and your audience. When <strong id=\"\"><em id=\"\">who you are</em></strong> is <strong id=\"\">accurately depicted in your videos</strong>, people will respond.Plus, being YOU on video is so much easier than acting!So get out there and start your <strong id=\"\">video blogging</strong> journey!</p>",
      "yoast-seo-meta-description": "Want to use video to market your business? You can! Learn how to captivate your audience with video marketing strategies that wow!",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2013/04/using-video-to-market-your-business.jpg|https://rebekahradice.com/wp-content/uploads/2011/08/video-marketing.jpg|https://rebekahradice.com/wp-content/uploads/2011/08/using-video-to-market-your-business.jpg|https://rebekahradice.com/wp-content/uploads/2013/04/use-video-marketing.jpg|https://rebekahradice.com/wp-content/uploads/2013/04/online-video-marekting-for-business.jpg|https://rebekahradice.com/wp-content/uploads/2013/04/3-Steps-to-Using-Video-to-Market-Your-Business.jpg|https://rebekahradice.com/wp-content/uploads/2013/04/using-video-to-market-your-business-1.png|https://rebekahradice.com/wp-content/uploads/2013/04/using-video-to-market-your-business1.png|https://rebekahradice.com/wp-content/uploads/2013/04/create-engaging-videos-for-social-media3.png",
      "name": "3 Steps to Using Video to Market Your Business",
      "wp-excerpt": "Creating your first video is an exciting step. In my four part series Steps to Video Success, you will learn how to write effective scripts, how to capture the attention (and information) of your viewers, where to post, how to post and what camera, lighting and additional equipment you will need to get started.",
      "yoast-reading-time": "7",
      "wp-category": "Social Media",
      "wp-image-alt-text": "using-video-to-market-your-business|video marketing|using video to market your business||3 Steps to Use Video to Market Your Business|3 Steps to Using Video to Market Your Business|using-video-to-market-your-business|using-video-to-market-your-business1|create-engaging-videos-for-social-media3",
      "slug": "using-video-to-market-your-business",
      "updated-on": "2023-04-01T12:22:32.987Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:32.987Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "6428220827157336c5995f6f"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-08-01T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p>In an industry beaten down by declining market conditions, hostile sellers and constant guideline changes, defining your WHY may be easier said than done.Still, I guarantee that you had one when you first got started.Tapping back into that is the key to your continued success.Your first step is determining why you do what you do every day and what you envision that dream job to look like.</p><h3 id=\"\">Find a quiet place and ask yourself a few questions:</h3><ul id=\"\"> \t<li id=\"\">Why did you first become self-employed? Time, money, freedom?  Is that still your reason and if not, does this align with your overall goals?</li> \t<li id=\"\">What did you enjoy most about your new job at the beginning of your career?</li> \t<li id=\"\">What could you talk about for days on end?  Do you still feel the same?</li></ul><p>We all need motivation to keep moving forward.Your WHY gives you the power to push through the tough times and the motivation to dig deep when nothing seems to be going your way.Your second step is to create a plan of action and stick to it.  No excuses!</p><h2 id=\"\">Organize, Plan &amp; Track Your Goals</h2><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822086a10ec0e3a56d963_set-your-business-goals.jpeg\" alt=\"set your business goals\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p>According to recent <a href=\"http://www.sba.gov/advocacy/7495/8430\" target=\"_blank\" id=\"\">statistics</a> published by the Small Business Administration, two out of the Top 10 Reasons Business’ Fail are a lack of planning and poorly defined goals.Running your business without a plan or goal is like hopping in the car for a 2000 mile trip without a map, GPS or sense of direction.Seems crazy, yet thousands of us step into self-employed life every day without a roadmap. As the saying goes,</p><blockquote id=\"\">“He who fails to plan, plans to fail.”</blockquote><p>Here are a few FREE online goal setting tools to get you started.</p><h3 id=\"\"><a href=\"http://www.43things.com/\" target=\"_blank\" id=\"\">43things</a></h3><p>This fun and free online goal setting tool not only allows you to set your own goals, but track and follow recommendations from fellow members.</p><h3 id=\"\"><a href=\"http://www.joesgoals.com/\" target=\"_blank\" id=\"\">Joe’s Goals</a></h3><p>This is an easy to use but effective online tool that is great for tracking your everyday goals.  For instance, how many leads have you followed up with or how many blogs you have written this week.Similar to Active Rain, it’s built on a points system.  You add and subtract points for the tasks you check off your list and subtract for the ones you fail to do.Great motivation in my opinion to get those tasks done!</p><h3 id=\"\"><a href=\"http://www.makeuseof.com/tag/lifetango-goal-sharing/\" target=\"_blank\" id=\"\">LifeTango</a></h3><p>I love the helpful wizard that comes with this tool that stimulates your brain with questions like: “What's one work project/venture you'd like to complete?”After answering a series of questions similar to this one, LifeTango will recommend goals based on your answers.Then you simply choose from those and track your progress.  You can also share with friends to keep you focused!So what are you waiting for?  Turn your Passion into Profit by defining your WHY and turning that list of someday to-do’s into tomorrow’s success stories!</p>",
      "yoast-seo-meta-description": "We all need motivation to keep moving forward. Your WHY gives you the power to push through the tough times. Create a plan of action today!",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/08/turn-passion-into-profit-define-your-why.jpg|https://rebekahradice.com/wp-content/uploads/2011/08/set-your-business-goals.jpg",
      "name": "Turn Passion Into Profit | Define Your WHY",
      "wp-excerpt": "In an industry beaten down by declining market conditions, hostile sellers and constant guideline changes, finding your WHY may be easier said than done.  Still, I guarantee that you had one when you first got started.  Tapping back into that is the key to your continued success.\n\nYour first step is determining why you do what you do every day and what you envision that dream job to look like.",
      "yoast-reading-time": "3",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Turn Passion Into Profit | Define Your WHY",
      "wp-image-alt-text": "turn passion into profit define your why|set your business goals",
      "slug": "turn-passion-into-profit-define-your-why",
      "updated-on": "2023-04-01T12:22:32.885Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:32.885Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822086a10ecb2f756d964"
    },
    {
      "_archived": false,
      "wp-published-date": "2012-10-01T00:00:00.000Z",
      "_draft": false,
      "wp-excerpt": null,
      "wp-content": "<p>Social media has infiltrated every aspect of our lives.Social media impacts how you live, communicate and share information, from the products you buy to the connections you make.So, how can you manage the social media noise and distraction without gaining a few new gray hairs?The solution is a sustainable <a href=\"https://rebekahradice.com/social-media-marketing-strategy/\" target=\"_blank\" id=\"\">social media strategy</a>.Below are 5 time-saving strategies for social media success!</p><h1 id=\"\">5 Time Saving Strategies for Social Media Success</h1><h2 id=\"\">  1. Create Your Social Strategy</h2><p>If you haven't created your <a href=\"https://rebekahradice.com/creating-winning-social-media-strategy/\" target=\"_blank\" id=\"\">social media strategy</a>, there is no time like the present.A social media marketing campaign can only flourish with careful and thoughtful planning. This means that striking out into the social realm with nothing more than a hit or miss strategy is taking the quick road to failure.Visualize where social media marketing fits into your marketing plan. Then determine which social channels will support your approach.This should not be an overwhelming process. Take baby steps by adding a few posts here and a couple of tweets there.There's no need to dive in and tackle everything all at once. Your plan should be easy to stick to create like the one below.Keep it simple and ensure that each task moves you closer to your goals.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822080da44933edf20bd1_social-media-strategy-template.jpeg\" alt=\"social media strategy template sample\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h2 id=\"\">  2. Know Your Audience</h2><p>From the Internet to <a href=\"https://rebekahradice.com/easy-ways-social-media-can-build-your-business/\" target=\"_blank\" id=\"\">social media</a>, consumers are actively seeking answers to their most pressing questions. Understanding their needs and <em id=\"\">offering insight in an authentic manner</em> will build trust in your online relationships.First you must define who you are trying to reach. What is their:</p><ul id=\"\"> \t<li id=\"\">Age</li> \t<li id=\"\">Location</li> \t<li id=\"\">Vocation</li> \t<li id=\"\">Marital status</li> \t<li id=\"\">Family size</li> \t<li id=\"\">Buying habits</li></ul><p>No matter your industry, one size does not fit all. Make sure you know what drives their decisions.Once you are armed with this information, share answers to frequently asked questions and guidance during their purchase process.</p><h2 id=\"\"> <strong id=\"\">  </strong>3. Use Automation Tools</h2><p>Automation can be a huge time saver. However, be mindful of what you automate.You never want to push so much out that you take the \"social\" out of social media marketing.There are a multitude of tools that will allow you to schedule updates to help you focus on building relationships rather than wasting time on low-payoff activities.From apps to widgets, automation tools can expand your presence while allowing you to stay engaged and involved in your burgeoning community.</p><h3 id=\"\"><strong id=\"\">A few automation options:</strong></h3><ul id=\"\"> \t<li id=\"\"><a href=\"http://sproutsocial.com\" target=\"_blank\" id=\"\">Sprout Social</a></li> \t<li id=\"\"><a href=\"http://www.hootsuite.com/\" id=\"\">Hootsuite</a></li> \t<li id=\"\"><a href=\"http://www.tweetdeck.com/\" id=\"\">Tweetdeck</a></li> \t<li id=\"\"><a href=\"http://socialoomph.com/\" id=\"\">Social Oomph</a></li> \t<li id=\"\"><a href=\"http://www.postplanner.com\" id=\"\">Post Planner</a></li> \t<li id=\"\"><a href=\"https://socialfave.net/app/\" id=\"\">Social Fave</a></li></ul><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822080da4494deef20bcf_social-fave.png\" alt=\"social-fave\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h2 id=\"\">4. Outsource Tasks (not the Conversation)</h2><p>Outsourcing certain elements of social media can be very effective if done right. A <a href=\"https://rebekahradice.com/grow-your-business/\" target=\"_blank\" id=\"\">virtual assistant</a> can arrange daily automation and create structure around your social media efforts.They can also monitor your analytics and stay on top of any important brand buzz that must be immediately addressed.Take your time when outsourcing and interview just as you would any other employee. There needs to be a connection and an obvious benefit to both your business and your bottom line.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822080da449d87df20bd0_hire-a-social-media-professional.jpeg\" alt=\"hire a social media professional\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h2 id=\"\">  5. Shut It Down</h2><p>While social media may be 24/7, no one can or should keep up at that pace. Give yourself time to shut it down and reboot.There is no reason to post, tweet, or respond at all hours of the day.  It will only serve to distract you from money making activities and keep you from enjoying other important aspects of your life.There are better and more effective ways to monitor social media and at some point, <em id=\"\">you need a life outside social media</em>.With proper planning, implementation and perseverance your social media efforts can and will pay off.</p><h4 id=\"\"><em id=\"\">I'd love to hear from you! What's your social media time saving tip?</em></h4>",
      "yoast-seo-meta-description": "Want to save time on social media? Here's how to plan & create without the headache! 5 time saving strategies for social media success.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2012/10/time-saving-social-media-strategies.png|https://rebekahradice.com/wp-content/uploads/2011/07/choose-blogging-platform.gif|https://rebekahradice.com/wp-content/uploads/2011/07/social-media-time-saving-strategy.jpg|https://rebekahradice.com/wp-content/uploads/2012/10/social-media-time-saving-strategies.jpg|https://rebekahradice.com/wp-content/uploads/2012/10/hire-a-social-media-professional.jpg|https://rebekahradice.com/wp-content/uploads/2012/10/social-media-management.jpg|https://rebekahradice.com/wp-content/uploads/2012/10/time-saving-strategies-for-social-media.png|https://rebekahradice.com/wp-content/uploads/2012/10/social-fave.png",
      "name": "5 Time Saving Strategies for Social Media Success",
      "yoast-reading-time": "4",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "5 Time Saving Strategies for Social Media Success",
      "wp-image-alt-text": "time-saving-social-media-strategies|choose blogging platform|social media time saving strategy|social media time saving strategies|hire a social media professional|social-media-management|5 Time Saving Strategies for Social Media Success|social-fave",
      "slug": "5-time-saving-strategies-for-social-media-success",
      "updated-on": "2023-04-01T12:22:32.715Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:32.715Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822080da4498891f20bd2"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-08-23T00:00:00.000Z",
      "_draft": false,
      "wp-image-alt-text": null,
      "wp-content": "<p>As a blogger, I'm sure you've written some great blog content.  The problem is, you can't expect your readers to remember or new readers to miraculously find those <a href=\"https://rebekahradice.com/how-to-revive-old-blog-posts-and-increase-reader-buzz/\" target=\"_blank\" id=\"\">old blog posts</a>.In past articles I've talked a lot about <a href=\"http://activerain.com/blogsview/2428235/6-time-saving-strategies-for-social-media-success\" id=\"\">creating a distribution plan</a> or a way to spread your message across the web.  This wonderful little plugin will assist in doing just that!  Granted, if you blog with WordPress there are many plugins that offer similar capabilities, but this one is one of my favorites.</p><h4 id=\"\">Here's how it works:</h4><p><a href=\"http://wordpress.org/extend/plugins/tweet-old-post/\" target=\"_blank\" id=\"\">Tweet Old Post</a> will take your old blog posts and automatically rotate through them, posting directly to Twitter based on the frequency level you set. There are a lot of benefits to this plugin but the real beauty is in its effectiveness to draw attention and traffic back to old posts that might have been forgotten.This FREE plugin is simple to use and will only take a matter of minutes to setup and install.</p><h4 id=\"\">Tweet Old Post Details &amp; Set Up:</h4><figure class=\"w-richtext-figure-type-video w-richtext-align-center\" style=\"padding-bottom:33.75%\" data-rt-type=\"video\" data-rt-align=\"center\" data-rt-max-width=\"\" data-rt-max-height=\"33.75%\" data-rt-dimensions=\"0:0\" data-page-url=\"\"><div><iframe src=\"https://www.youtube.com/embed/404ZjFejdKw\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></div></figure><p><a href=\"http://wordpress.org/extend/plugins/tweet-old-post/\" target=\"_blank\" id=\"\">Download Tweet Old Post</a>**One word of WARNING!  If you haven't upgraded to the latest version of Wordpress, do it before you add this plugin.  Otherwise, you will run into issues and be required to updated your settings for a second time.Additional Wordpress 'Share'  Plugins:<a href=\"http://wordpress.org/extend/plugins/jw-share-this/\" id=\"\">ShareThis</a>  -- Puts all the social media share icons where you need them on your blog<a href=\"http://wordpress.org/extend/plugins/smp-twitter-module-oauth/\" id=\"\">Social Media Pack - Twitter Module</a> -- Sends a Tweet when you post something new<a href=\"http://wordpress.org/extend/plugins/leenkme/\" id=\"\">Leenk.me</a>  -- Auto Tweet new blog posts<a href=\"http://wordpress.org/extend/plugins/full-circle/\" id=\"\">Full Circle</a> -- Automatically notify your social networks about new blog posts.</p>",
      "yoast-seo-meta-description": "Tweet Old Post will take your old blog posts and automatically rotate through them, posting directly to Twitter based on the frequency level you set.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/08/top-tips.png",
      "name": "Tech Tip Tuesday | Create Blog Post Buzz!",
      "wp-excerpt": "Tweet Old Post will take your old blog posts and automatically rotate through them, posting directly to Twitter based on the frequency level you set. There are a lot of benefits to this plugin but the real beauty is in its effectiveness to draw attention and traffic back to old posts that might have been forgotten. \n\nThis FREE plugin is simple to use and will only take a matter of minutes to setup and install.",
      "yoast-reading-time": "2",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Tech Tip Tuesday | Create Blog Post Buzz!",
      "slug": "tech-tip-tuesday-create-blog-post-buzz",
      "updated-on": "2023-04-01T12:22:32.611Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:32.611Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822085c4c4ce73a40fc42"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-07-27T00:00:00.000Z",
      "_draft": false,
      "wp-image-alt-text": null,
      "wp-content": "<p>We’ve all had an experience similar to this one:We work with a buyer through the trials and tribulations of a typical purchase transaction, speaking with them daily (sometimes hourly) as they anticipate the big day.Closing day finally arrives and you show up with a beautifully wrapped gift and a card thanking your client for their business.  You eagerly request the referral of their friends, family and colleagues with a promise to care for them just as you have cared for your buyer throughout their purchase.   As you walk out, you congratulate them and promise to stay in touch.And then?  Nothing. No phone calls, no pop bys, no birthday cards, no NADA!  They just simply fall off your radar as you move on to the next transaction.  You had all the best intentions; you just didn’t have a system to stay in touch.Why You Need a SystemYour system is the difference between relational and transactional marketing.  Wouldn’t you like to get off the perpetual roller coaster of building and rebuilding your business?   Taking steps to form a system that maintains and expands upon past relationships can offer a lifetime of rewards.Believe it or not, creating an email marketing campaign and systematizing your follow-up can be simple and painless.  Start small and increase as you go.  Below are a few suggestions to get you started!Create a campaign that includes 7 After Closing Emails:1 Week – This email will lay the groundwork for your future relationship.  Set the expectation on how often they will hear from you and assure them that you will be staying in touch.  Remind them of your contact information and ask again (you should have already done this during the process) that they LIKE your Facebook page, Follow you on Twitter and Subscribe to Your Blog for the most up to date industry news.2 Weeks – Once the dust has settled and your clients are comfy in their new home, send a survey with a few short questions about their experience.  <a href=\"http://surveymonkey.com/\" id=\"\">Survey Monkey</a> is a FREE and easy solution to systematize this step.  Pick 5 questions that will take your client a maximum of 5 minutes to answer.  Make sure one of those is whether they currently have someone to refer and what their contact information is.1 Month – This part of the campaign is actually a call and not an email.  It gives you the opportunity to reach back out to your client with a specific purpose.  (The hope is that if you do receive voicemail, they will have a reason to call you back)Ask your client if they have received their mortgage payment coupon from their lender.  If they have not, this is a perfect opportunity to contact the loan officer and ask that they get back in touch with the client.  It’s all about exceeding their expectations!2 Months – Send a Blockbuster Video Night Gift Card that includes cost for a rental, popcorn and drinks or you could put your own video night gift basket together and drop it off.  This <a href=\"http://www.jackiesbaskets.com/gift-basket/blockbuster-night-movie-gift-pail.html\" id=\"\">movie night basket </a> might be more than you want to spend but it will give you some great ideas!  The idea is to help your client put their feet up and enjoy a quiet evening in their new home.4 Months – Remind your clients about the importance of maintaining good credit.  Many times clients will shrug off paying bills on time once they’ve closed on a home and no longer have loan approval hanging over their head.  Here are a few bullet points to include:</p><ul id=\"\"> \t<li id=\"\">Pay your bills on time – This is extremely important when it comes to your mortgage payment. Just as circumstances such as bankruptcy or foreclosure have a major impact on your credit, your payment history plays a significant role in your FICO score.</li> \t<li id=\"\">Don't max out available credit on credit card accounts.  Your credit score could be affected based on what the credit bureaus believe is the appearance that you are having trouble managing your finances.</li> \t<li id=\"\">Don't apply for too much credit in a short amount of time. Multiple requests for your credit history (not including requests by you to check your file) can affect your score.</li> \t<li id=\"\">Periodically check your credit history for errors.  If you would like a free copy of your credit report, please visit <a href=\"http://www.annualcreditreport.com/\" id=\"\">www.annualcreditreport.com</a> and call me with any questions.</li></ul><p>7 Months – Give your client an easy and inexpensive way to upgrade their home.  Landscaping is one of the best home investments they can make. Mail or drop off a small tree or shrub and explain that well-placed trees or shrubs add curb appeal and could increase resale value. Also suggest that they plan ahead and play around with some of the gardening software that's out there so they have an idea what they yard will look like before they get started.  Check out <a href=\"http://www.bhg.com/gardening/design/nature-lovers/welcome-to-plan-a-garden/\" id=\"\">Better Homes &amp; Gardens Plan a Garden Free &amp; Easy Garden Planner</a>.12 Months – Send a copy of their HUD-1 along with an explanation of why they will need this come tax time.  Then stress the importance of an annual review.  Schedule a time with both you and the lender to review their financial situation.  This is an excellent opportunity to cross sell CPA’s, Insurance Agents and other referral partners within your network.Here is an <a href=\"http://www.box.net/shared/4q397yurkl589q3fupx5\" id=\"\">annual review checklist</a> to get you started.Keep in mind, the timeline on each email is only a suggestion.  Adjust the dates according to what feels comfortable for you.  You can also use all the emails or just a few and incorporate them into your existing marketing post-closing drip campaign.Always remember:  Add value first, ask for referrals second.  Providing your clients with useful, relevant information will keep you top of mind and their go-to professional when the opportunity to refer comes along.</p>",
      "yoast-seo-meta-description": "Do you have an email marketing campaign system to follow up and stay in touch with past clients? Past clients are a goldmine to future referrals.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/07/email-marketing.png",
      "name": "Do You Love Them and Leave Them",
      "wp-excerpt": "We’ve all had an experience similar to this one: \n\nWe work with a buyer through the trials and tribulations of a typical purchase transaction, speaking with them daily (sometimes hourly) as they anticipate the big day.  Closing day finally arrives and you show up with a beautifully wrapped gift and a card thanking your client for their business.  You eagerly request the referral of their friends, family and colleagues with a promise to care for them just as you have cared for your buyer throughout their purchase.   As you walk out, you congratulate them and promise to stay in touch.  And then?  Nothing. No phone calls, no pop bys, no birthday cards, no NADA!",
      "yoast-reading-time": "5",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Do You Love Them and Leave Them",
      "slug": "do-you-love-them-and-leave-them",
      "updated-on": "2023-04-01T12:22:32.333Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:32.333Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282208f48759bb4caea012"
    },
    {
      "_archived": false,
      "wp-published-date": "2012-09-24T00:00:00.000Z",
      "_draft": false,
      "wp-excerpt": null,
      "wp-content": "<p>Facebook marketing has the potential to radically transform your business.It can connect you to prospective clients at little to no cost and generate exposure like no other marketing medium.But making the wrong move can hurt your brand's credibility and trustworthiness.Whether you're considering Facebook marketing for your business or simply interested in expanding your current page, these are the Facebook marketing mistakes you need to avoid.</p><h1 id=\"\">6 Facebook Marketing Mistakes Killing Your Page</h1><h2 id=\"\">1. Not Responding to Comments</h2><p>Similar to blogging, <a href=\"https://rebekahradice.com/your-social-media-starter-kit/\" target=\"_blank\" id=\"\">social media</a> platforms are a community. To grow and build a branded presence, you must stay involved.Many Facebook admins make the major mistake of letting comments, likes, and shares go unacknowledged.No one appreciates their well-thought-out comment falling on deaf ears. A simple click of the 'LIKE' button on their comment can go a long way in building trust and encouraging future interaction. Let your fans know that you are paying attention and not there to simply broadcast a message.</p><h2 id=\"\">2. Not Using an Effective Cover Photo</h2><p>The Facebook cover photo is an opportunity to immediately grab a potential fan's attention. Think of it as the cover of your magazine. It should speak directly to your fan's needs and wants while quickly relaying why they should LIKE your page.Create an appealing cover that allows your fans to immediately connect with the look, feel, and mission of your brand.An excellent example of a Facebook cover photo is the  GoodPop All-Natural Frozen Pops page. Who wouldn't want to eat one of these delicious-looking all-natural Popsicles?</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/64282207bb87cbc3bd24ae1f_goodpop.jpeg\" alt=\"goodpop\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h2 id=\"\">3. Taking Your Anger Out on the Page</h2><p>Lose your temper or patience once with a fan or blast someone on your wall, and even the most revered page won’t be able to save your image.  Your fans have come to expect a certain tone and style of communication from you.If you allow one offensive comment to move you to anger, the repercussions of your misguided response can be devastating.This isn’t to say that you can’t express frustration or unhappiness about something affecting your business or industry. However, this type of status update should only be used to help your fans better understand how and why it affects them. It should never feel like venting.Your ranting might appeal to some, but not for long.  Think about those people that frequently explode or spend their days whining about how unfair life is.  How does it make you feel?Always be mindful of your tone and voice. Ensure that you keep it true to the image created by your brand and page.  One wrong move could result in a significant loss of trust and, eventually, fans.</p><h2 id=\"\">4. Bad-Mouthing Your Competition</h2><p>It’s one thing to share your success stories with your fans; it’s another to rub it in the face of your competition.  For example, let’s say you bring home the Top Producer award within your company.It’s exciting news to share with your fans and something they will undoubtedly enjoy celebrating along with you.  Where you cross the line is to degrade your competition.No one likes a braggart. Reducing someone else in the eyes of others only to raise yourself up leaves you looking shallow and self-absorbed.  Not exactly the image anyone wants to portray.</p><h2 id=\"\">5. Not Taking the Time to Build Relationships</h2><p>Having a page and forgetting to “work the room” is a huge mistake made by many Facebook Fan Page Admins.  If you schedule your daily post and then move on to the rest of your day, you are missing an enormous opportunity to build awareness and reciprocity.Once you post, take the time to make the rounds and like and comment on other Facebook pages with content relevant to your fan base. This creates strategic relationships and heightens awareness of your brand and page. However, you must be very careful with this strategy. The point is not to spam or promote but rather to add insightful and meaningful dialogue to the conversation.The saying, \"You can catch more flies with honey than with vinegar,\" definitely applies here.</p><h2 id=\"\">6. Not Monitoring Your Facebook Insights</h2><p>A big mistake many marketers make is not consistently monitoring analytics and analyzing the effectiveness of their message.Facebook insights provide a detailed analysis of each post, including reach, number of engaged users, and the virality of your post. Important information is needed when creating a strategy behind your daily posts.Taking the time to understand what your fans are looking for and when your best time to post might be can save you time and money.The bottom line is this: Building a presence on Facebook will not mysteriously happen if you haven’t committed to “showing up” in a positive way daily. Begin today by taking a proactive stance in branding your business by offering relevant content that is consistent with your mission and message.</p><h5 id=\"\"><em id=\"\">What are the biggest mistakes you see businesses make on Facebook?</em></h5>",
      "yoast-seo-meta-description": "Want to improve your Facebook marketing results? You can! Here are the top Facebook marketing mistakes that are killing your page and credibility.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2012/09/6-Facebook-Mistakes-Killing-Your-Page.png|https://rebekahradice.com/wp-content/uploads/2011/07/facebook-mistakes.jpg|https://rebekahradice.com/wp-content/uploads/2011/07/Facebook-Insights.png|https://rebekahradice.com/wp-content/uploads/2012/09/goodpop.jpg",
      "name": "6 Facebook Mistakes Killing Your Page",
      "yoast-reading-time": "4",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "6 Facebook Marketing Mistakes Killing Your Page",
      "wp-image-alt-text": "6 Facebook Mistakes Killing Your Page|facebook mistakes|Facebook Insights|goodpop",
      "slug": "6-facebook-mistakes-killing-your-page",
      "updated-on": "2023-04-01T12:22:32.054Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:32.054Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282208bb87cb3bf624ae20"
    },
    {
      "_archived": false,
      "wp-published-date": "2014-08-18T00:00:00.000Z",
      "_draft": false,
      "wp-excerpt": null,
      "yoast-reading-time": null,
      "wp-yoast-seo-title": null,
      "wp-content": "<p>Are you trying to <a href=\"https://rebekahradice.com/writing-best-blog-post/\" target=\"_blank\" id=\"\">build your blog</a>?Does it feel like an uphill battle?When you consider <strong id=\"\">how to best market your business</strong>, there aren’t many options better than blogging.But, yet there's no doubt about it. Building a successful business blog can be a challenge.While a blog provides an inexpensive way to share your expertise, diving in without a plan is a recipe for disaster.From the most basic mistakes to those that hurt your site, avoiding common pitfalls is critical.In this article I share some of the mistakes you might be making and how to fix them.Ready to expand your reach, drive more traffic and <a href=\"https://rebekahradice.com/profitable-blog-strategy/\" target=\"_blank\" id=\"\">improve your blog results</a>? Let's get started!</p><h1 id=\"\">Blog Mistakes You Should STOP</h1><h2 id=\"\">  1. Not Setting Goals</h2><p>If I asked you what your blog purpose is, could you tell me? Could you sum up in a few words what your overall goals are?Too often, defined goals are overlooked. Bloggers become scattered, lacking vision and a purpose.Did you dive into blogging without a plan? If so, don't worry. It happens to the best of us.The good news is this. Setting goals and clearly <strong id=\"\">defining your purpose</strong> can happen today.Want to better understand who you are as a blogger?</p><h5 id=\"\"><strong id=\"\">Ask yourself a few questions:  </strong></h5><ul id=\"\">\t<li id=\"\">Why do you write?</li>\t<li id=\"\">What purpose does it serve?</li>\t<li id=\"\">How will your blog support your overall marketing goals?</li>\t<li id=\"\">How does a blog integrate into your offline marketing efforts?</li>\t<li id=\"\">What type of writer are you?  Are you funny, quick-witted and social or are you serious, to the point and eager to educate?</li>\t<li id=\"\">How will you use your blog to better connect with your target audience?</li></ul><p>If you don't identify why you're blogging, success will always feel out of reach. Take time to spell out what blogging affords your business.It’s a noisy online world. Simply creating a blog and pushing out content won't get you noticed.If you're already knee-deep into blogging, this is a perfect time to take a step back. Analyze, brainstorm and reinvigorate your blogging with a strategic plan.Lisa Stauber of <a href=\"http://www.blogelevated.com/setting-blog-goals/\" target=\"_blank\" id=\"\">Blog Elevated</a> has a simple way to help you get started:</p><blockquote id=\"\">\"Having short and long-term goals is key for your blogging success.  Break down your yearly goals into monthly and quarterly goals.  As you are planning your calendar and schedule for the year, include these smaller attainable goals.  Yearly goals are the big picture, quarterly goals are measures through the year to achieve the yearly goals, and monthly goals are breakdowns of the quarterly goals.\"</blockquote><h2 id=\"\">  2. Not Blogging Consistently</h2><p>Blogging inconsistently hurts you in multiple ways. Not only does it make it difficult for your audience to find you, but also the search engines.Think about it. When was the last time you revisited a blog that wasn't recently updated? Probably never.Likewise, why would anyone return to your blog if you post sporadically? Create a schedule and a blog post calendar to keep you focused and on track.Use a <a href=\"https://rebekahradice.com/create-and-manage-an-editorial-calendar/\" target=\"_blank\" id=\"\">content calendar</a> like the one below from <a href=\"http://offers.hubspot.com/blog-editorial-calendar\" target=\"_blank\" id=\"\">HubSpot</a>. If you've already been blogging for a while, dive into your <a href=\"http://google.com/analytics\" target=\"_blank\" id=\"\">Google Analytics</a> to identify your top posts. What topics can you expand upon or update?Also look for the top keywords and phrases your audience is using to find you. That's valuable insight you don't want to overlook.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/64282207f47c95372d3e02d5_blog-content-calendar.jpeg\" alt=\"blog content calendar\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h2 id=\"\">  3. Not Writing for Your Audience</h2><p>Take a look at your latest blog posts. Is your blog about you or your audience? Are you solving potential client problems or simply pontificating?While it’s important to infuse your thoughts and expertise into your writing, make sure you use that knowledge to help, not shout at potential clients.</p><h5 id=\"\">Fill in the blanks below</h5><p>1. My target audience is __________. (Hint: Be specific. \"Everybody\" is not your market).<strong id=\"\">For example:</strong></p><ul id=\"\">\t<li id=\"\">Past clients</li>\t<li id=\"\">Potential customers</li>\t<li id=\"\">Industry experts</li>\t<li id=\"\">Existing social media connections</li></ul><p>2. My audience top characteristics and traits are ___________.3.When my target market lands on my blog, the content they're looking for is __________.</p><h2 id=\"\">  4. Promoting Rather than Writing</h2><p>I understand that your blog purpose is to draw potential clients in, but bashing them over the head with boring stats and constant promotional ads is not the way to <strong id=\"\">build relationships</strong>.Your blog audience wants you to woo them. They want to get to know you and understand how you can solve their problems.</p><h5 id=\"\">Share your value, but do it in a conversational way.</h5><p>Sure they need facts and figures, but they also want to hear and see the human side of who you are.Don’t be afraid to put more of you, and less of a spammy marketer, into each of your blog posts.</p><h2 id=\"\"><strong id=\"\">  </strong>5. Expecting Your Readers to Find You</h2><p>Your blog is a vital piece of your overall marketing plan.  Don’t forget to promote it in all of your marketing and advertising efforts.Consumers and readers won't just miraculously appear at your blog doorstep. Integrate your blog into your online and offline marketing.Add it to your postcards, email signature, newsletter and other promotional items.Share your latest blog post across all of your social networks. I'm a huge fan of using visuals to captivate your audience while branding your business.I create separate images for all social networks to match the requirements for each. For example, if you're using images on Twitter, ensure that you're creating them correctly. Peg Fitzpatrick, social media strategist at <a href=\"http://blog.canva.com/tweet-images-more-impact-twitter/#Vk0a2tpKP6iTUcsO.99\" target=\"_blank\" id=\"\">Canva</a> offers this advice,</p><blockquote id=\"\">\"The best size to use for Twitter graphics and images is 1024 pixels by 512 pixels. We’ve created some designs that already populated in your design types on Canva. <a href=\"http://www.pinterest.com/canva/design-inspiration-twitter-posts/\" target=\"_blank\" id=\"\">See them here on our Pinterest board</a>. You can quickly create a series of tweet graphics in Canva and save them in your designs until you’re ready to use them. Or remix them when you want to change things up.</blockquote><blockquote id=\"\">Hooray! <a href=\"https://twitter.com/hashtag/Twitter?src=hash\" id=\"\">#Twitter</a> post designs are here! Read about them &gt;&gt; <a href=\"http://t.co/55GLzujcp5\" id=\"\">http://t.co/55GLzujcp5</a> <a href=\"http://t.co/SlJYFekeUQ\" id=\"\">pic.twitter.com/SlJYFekeUQ</a>— Canva (@canva) <a href=\"https://twitter.com/canva/statuses/500038978532540416\" id=\"\">August 14, 2014</a></blockquote><h2 id=\"\">  6. Not Installing (or reviewing) Google Analytics</h2><p>I’m often asked by bloggers why you would want to review or even track blog statistics.In my opinion?Not tracking your statistics is like driving at night without your headlights on.  You may get to your destination, but the ride won’t be pretty.<a href=\"http://google.com/analytics\" target=\"_blank\" id=\"\">Google Analytics </a>allows you to track your success and adjust your message along the way.</p><h2 id=\"\">  7. Forgetting How Powerful Your Blog Title Is</h2><p>When I first started blogging I was more focused on fun, snappy titles than people or search engine friendly titles.While you need a nice mixture of both, forgetting the power of your blog title is a huge mistake.  Don’t spend hours crafting that perfect post without adding an attention grabbing, descriptive, SEO friendly headline.One of my favorite tools is <a href=\"http://www.aminstitute.com/cgi-bin/headline.cgi\" target=\"_blank\" id=\"\">Advanced Marketing Institute's Headline Analyzer</a>. Submit your blog title and see how it ranks based on their Emotional Marketing Value analysis.I love this tool and appreciate the guidance it offers. From intellectual, to emotional and even spiritual, this analyzer will tell you how appealing your title is.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822060da449a524f20ba4_test-blog-post-headline.jpeg\" alt=\"test blog post headline\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h2 id=\"\">  8. Not Checking Your Work</h2><p>There’s nothing worse than reading an article full of misspellings and poorly written sentences.Take your time to spell check and review your article before you post.  If you struggle with grammar, then pass off the review to a colleague or Virtual Assistant.An editor will help point out punctuation, spelling and grammatical errors before that post ends up live for all the world to see.And if you're eager to improve your writing skills, hop over to <a href=\"http://www.hemingwayapp.com/\" target=\"_blank\" id=\"\">Hemingway</a>. Hemingway does for your writing what the Headline Analyzer does for your title.Make your content easier to read with their easy to use editor. Copy and paste your post and then look to your score for guidance. Update the misspellings, grammatical errors or complexities in a matter of moments.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/64282207f47c95c21e3e02d4_hemingway.jpeg\" alt=\"hemingway\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h3 id=\"\">Final Thoughts</h3><p>Your blog is a powerful tool. Invest your time in learning the craft.Strive to become a better writer, marketer and conversationalist.Spend time getting to know your readers and learn what makes them tick.I guarantee it will pay off for years to come!What blogging mistakes have you made?</p>",
      "yoast-seo-meta-description": "Are you trying to build your blog? Does it feel like an uphill battle? Avoid the top blog mistakes most bloggers make.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/07/blog-mistakes1.jpg|https://rebekahradice.com/wp-content/uploads/2011/07/blog-mistakes.jpg|https://rebekahradice.com/wp-content/uploads/2011/07/blog-content-calendar.jpg|https://rebekahradice.com/wp-content/uploads/2011/07/hemingway.jpg",
      "name": "Blog Mistakes You Should Stop Making Immediately",
      "wp-category": "Social Media",
      "wp-image-alt-text": "blog mistakes|blog mistakes you are making|blog content calendar|hemingway",
      "slug": "blog-mistakes",
      "updated-on": "2023-04-01T12:22:31.840Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:31.840Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282207f47c956f863e02d6"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-07-13T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/6428220726a4722818a4ee7d_Rebeca-017-edited.jpeg\" alt=\"Rebekah Radice Colorado Springs\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p>As I've approached my fortieth birthday, I've pondered what this milestone means to me. Hitting the <strong id=\"\"><em id=\"\">two-score mark</em></strong> is a biggie and something I wasn't eager to rush into.Psychologists say we face <strong id=\"\">two life changing events </strong>that chart the course of our lives. The first juncture is adolescence, that time when <strong id=\"\">hormones run wild and life enchants and evades us, </strong>all at the same time.The<strong id=\"\"> second</strong> is a moment I've dreaded ~ that singular life changing moment:</p><h3 id=\"\"><strong id=\"\">Turning 40</strong></h3><p>The odd part is: <strong id=\"\"><em id=\"\">I do feel different</em></strong>. I didn't expect that. It's as if I've made some great leap and crossed over into another chapter of my life. I can't see how a number changes your life, but it does.Just as we crossed the <strong id=\"\"><em id=\"\">18 year milestone</em></strong>, the right to vote, and the ability to drive a car, so goes 40 in the diary of our lives.I recall a moment when I was 17 and met the girlfriend of an older and respected friend. I remember thinking how beautiful and sophisticated this girl was. At the time, I believed she had it all together. Then my friend whispered, “Don't you know? She's 37!”I was stunned and <strong id=\"\"><em id=\"\">immediately thought how old she was</em></strong>. Ahh - to be 37 again.How is it that life continues to be our journey? It is the “soul” discovery that we're meant to take from the moment we're born.<strong id=\"\">As I reflected on today, I recognized that:</strong></p><ul id=\"\">I'm not the same person I was 10 years ago and that's OK! \t<li id=\"\">I don't need what I did 10 years ago and that's even better!</li> \t<li id=\"\">I do need what I thought I didn't 10 years ago and for that I'm grateful!</li> \t<li id=\"\">I am a changed woman because of the grace of others and WOW what an amazing feeling that is!</li></ul><h2 id=\"\"><strong id=\"\">The Beginning and the End</strong></h2><p>I believed that 40 was the end of my life, and instead find that it is just the beginning. I carry with me the belief that what I am is only a fraction of what I can be, and that what I was is only a portion of who I will be.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/6428220726a47277d9a4ee7c_DSC02003-300x225.jpeg\" alt=\"Rebekah Radice and Dad\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p>I received this thought today, a gift, as it were, from my father. This Satchel Page quote felt like it was the <strong id=\"\"><em id=\"\">beginning and end</em></strong> to where I am and where I want to be:</p><h4 id=\"\"><strong id=\"\"><em id=\"\">\"How old would you be if you didn't know how old you were?\"</em></strong></h4><h4 id=\"\"><strong id=\"\"><em id=\"\"> You would be 40! Enjoy the day and the journey! </em></strong></h4>",
      "yoast-seo-meta-description": "Turning 40 hasn't been easy for me but it has been eye opening. What I've learned on my journey to 40.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/07/Rebeca-017-edited.jpg|https://rebekahradice.com/wp-content/uploads/2011/07/DSC02003.jpg",
      "name": "Forty, Fabulous and Ready for the Journey!",
      "wp-excerpt": "As I've approached my fortieth birthday, I've pondered what this milestone means to me. Hitting the two-score mark is a biggie and something I wasn't eager to rush into.\n\nPsychologists say we face two life changing events that chart the course of our lives. The first juncture is adolescence, that time when hormones run wild and life enchants and evades us, all at the same time.",
      "yoast-reading-time": "3",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Forty, Fabulous and Ready for the Journey!",
      "wp-image-alt-text": "Rebekah Radice Social Media Marketing Management Tips Tools|Rebekah Radice Colorado Springs",
      "slug": "forty-fabulous-and-ready-for-the-journey",
      "updated-on": "2023-04-01T12:22:31.776Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:31.776Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "6428220726a4721424a4ee7e"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-07-15T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/6428220769d01cf7f4092d0a_Goal-Setting-Success.jpeg\" alt=\"Goal Setting Success\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p>It’s no secret that <strong id=\"\">setting goals</strong> and putting them down on paper increases your likelihood of success dramatically.  In fact, a famous study from 1953 surveyed Yale's graduating seniors to determine how many of them had specific, <strong id=\"\">written goals</strong> for their future.  At graduation time, only 3% of the class had written down their goals.   Twenty years later, researchers polled the same members of that class and found that the 3% who had <strong id=\"\">written down their goals</strong> had amassed more financial wealth than the other 97% combined!Those are staggering statistics and the interestingly enough, the secret to surviving in today’s market is no different than it was 58 years ago.</p><ul id=\"\"> \t<li id=\"\">Visualize Your Goals</li> \t<li id=\"\">Write Down Your Goals</li> \t<li id=\"\">Follow Through On Your Goals</li></ul><p>Sounds simple right?  Then why are so few of us flying without a net?  We <strong id=\"\">need a plan</strong> in order to succeed and the only way to get there is to spend a little time diving into what we want to achieve and how we propose getting there.</p><h2 id=\"\"><strong id=\"\">Steps to Setting Strategic Goals</strong></h2><h3 id=\"\"><strong id=\"\">1. Visualize Your Goals</strong></h3><p><strong id=\"\">Discuss your goals</strong> with a coach or mentor and be specific.  Talking about your dreams and desires with another person turns intangible thought processes into concrete proof.Be very specific in what it is you want to achieve and then <strong id=\"\">make claim to it</strong>.  Verbalizing what you want offers <strong id=\"\">clarity of purpose</strong>.  There is no way to truly appreciate what it is you’re working towards without being able to see it, feel it, touch it and make it yours.</p><h3 id=\"\"><strong id=\"\">2. Write It Down</strong></h3><p>Something magical happens when you actually take pen to paper and write out your goals.  When we write out our goals, we’re committing to them on a subconscious level.  We’re also giving ourselves a mind map to carry out those goals.  Once we have it on paper, it’s no longer a figment of our imagination.  We now have a bullseye and steps to hit it!</p><h3 id=\"\"><strong id=\"\">3. Create an Action Plan</strong></h3><p>Envision how and what you will need to do in order to achieve your goal.  As new actions come to mind, add them to this written list.  This list is your road map to the finish line.  It is imperative that you take the time to work through each step and action that you will need to take to achieve your end result.</p><h3 id=\"\"><strong id=\"\">4. Schedule a Deadline</strong></h3><p>Give yourself a deadline on when you will reach each goal and be specific.  I find that looking at your goals from a linear viewpoint gives you the ability to monitor and track your progress through milestones.  Milestones are a great way to keep you energized and motivated to follow through.  It’s also important to celebrate your success along the way.  It can be as simple as grabbing your favorite scoop of ice cream at Baskin-Robbins as long as you take the time to congratulate yourself.</p><h3 id=\"\"><strong id=\"\">5. Throw in a BHAG (Big Hairy Audacious Goal)</strong></h3><p>Don’t be afraid to raise the bar with one<strong id=\"\"> BIG goal</strong>.  Setting the bar too low can end up leaving you underwhelmed by your results.  Setting larger, somewhat scary goals gives you the ability to <a href=\"http://activerain.com/blogsview/2401394/flying-high-soaring-above-your-fears\" target=\"_blank\" id=\"\"><strong id=\"\">spread your wings and soar</strong></a> above your competition.<strong id=\"\"><em id=\"\">Keep in mind</em></strong>, you must prepare for adversity and be willing to <strong id=\"\">adjust your goals</strong> as needed.  There’s no goal worth achieving that doesn’t come with its own challenges.  There will be days you feel like throwing in the towel so plan on that and have a mentor, coach or partner ready to pick you up and get you back in the ring swinging.<strong id=\"\">Goals are powerful</strong> and have the ability to propel us to places beyond our wildest dreams.  However, success doesn’t come overnight.  Consistently working towards them is the key.Commit to starting fresh today with this <a href=\"http://www.box.net/shared/yl9jcm339do1xm4cxnyf\" target=\"_blank\" id=\"\"><strong id=\"\">step by step action plan</strong></a> and take the <strong id=\"\"><em id=\"\">unperceivable to the unbelievable</em></strong>!</p>",
      "yoast-seo-meta-description": "Struggling to come up with a plan? Here's 5 Steps to setting goals that will explode your business and income.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/07/Goal-Setting-Success.jpg|https://rebekahradice.com/wp-content/uploads/2011/07/setting-goals.jpg",
      "name": "Warning: Setting Goals Could Explode Your Business",
      "wp-excerpt": "It’s no secret that setting goals and putting them down on paper increases your likelihood of success dramatically.  In fact, a famous study from 1953 surveyed Yale's graduating seniors to determine how many of them had specific, written goals for their future.  At graduation time, only 3% of the class had written down their goals.   Twenty years later, researchers polled the same members of that class and found that the 3% who had written down their goals had amassed more financial wealth than the other 97% combined!",
      "yoast-reading-time": "4",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Warning: Setting Goals Could Explode Your Business",
      "wp-image-alt-text": "Goal Setting Success|goal setting success",
      "slug": "warning-setting-goals-could-explode-your-business",
      "updated-on": "2023-04-01T12:22:31.766Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:31.766Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "6428220769d01c95f7092d0b"
    },
    {
      "_archived": false,
      "wp-published-date": "2012-04-02T00:00:00.000Z",
      "_draft": false,
      "wp-excerpt": null,
      "wp-content": "<figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/6428220759739792c1926e99_write-great-blog-post-titles.jpeg\" alt=\"write great blog post titles\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p>Blog post titles are powerful.An insanely compelling blog title can make the difference between a highly read post and one that dies an untimely death.That perfect blog post title can maximize your exposure and increase your reach. It has the ability to make your reader take notice and cause them to take immediate action.</p><h2 id=\"\">Why a Compelling Title Matters</h2><p>Think of your post title as the welcome sign at the front door of your business.  Do you want an attention grabbing sign that beckons readers in or one that offers a dull glimpse inside a lifeless blog? I can’t imagine the jury is out on this one.The challenge for most bloggers is to create tantalizing and persuasive blog titles while making them search engine friendly.Optimization and creativity don't typically go hand-in-hand. Combining those two elements can be tricky and downright frustrating at times.So how can you kick your titles up a notch?  Begin with a clear understanding of your goals.</p><h2 id=\"\">Blog Titles Should Have 4 Goals:</h2><ol id=\"\"> \t<li id=\"\">Arouse curiosity and create excitement - With the evolution of social media, your content will likely be shared by friends, followers and fans.  Creating buzz through a captivating title can be a powerful way to spread the word about your blog without any keyword optimization.</li> \t<li id=\"\">Provide an honest description of your content - Give any reader the ability to grasp the content of your post by simply scanning through your titles.  There's nothing more frustrating then a blog post title that makes a claim the content does not follow through on.</li> \t<li id=\"\">Give a compelling reason to take immediate action - Give your reader (and potential subscriber) a solid reason to click through to your post.  Keep in mind: a compelling title needs meat to back it up. If you offer a strong case up front, make certain that your content supports your assertion.</li></ol><p>The first three goals are the why, what and how of your article. Number four is the where that puts your blog on the map.</p><h2 id=\"\">Your 4th Goal | Why Keywords Matter</h2><p>While content is still King, keywords are the reigning Queen of your blog.Keywords are the words or phrases that people type into search engines when looking for information on a specific topic.  In essence, keywords can make or break your search engine optimization and ultimately kill a consumers ability to find your website or blog.Let’s take a look at an example:  If you write a post on \"<a href=\"https://rebekahradice.com/the-newbies-guide-to-facebook-marketing/\" target=\"_blank\" id=\"\">Facebook Marketing for Beginners</a>,\" the consumer might actually type in “how to market with Facebook” or “get started with Facebook marketing.”This is why it is important that you use words or phrases in your post that:</p><ul id=\"\"> \t<li id=\"\">Your potential client would actually type into a search engine</li> \t<li id=\"\">Would not be used by every blog on the web (<a href=\"http://www.andyjenkinsblog.com/2011/12/09/short-tail-vs-long-tail-keywords-which-gives-you-more-bang-for-your-buck/\" target=\"_blank\" id=\"\">short tail vs long tail keywords</a>)</li> \t<li id=\"\">Would also be used throughout your post without feeling forced</li></ul><p>If you can create a blog post title that grabs readers attention and is search engine optimized, you have hit a home-run! Just make sure that your keywords are relevant and flow organically within your post.  This is crucial for two reasons:</p><ol id=\"\"> \t<li id=\"\">Keywords reflect your niche and allow readers (and search engines) insight into what your focus or specialty is all about.</li> \t<li id=\"\">The more specific your keywords are to your blog or websites overall content, the better your search engine rankings will be.  Do not try to force words or phrases in to your content without it feeling natural.</li></ol><p>Start your research with these free keyword research tools:</p><ul id=\"\"> \t<li id=\"\"><a href=\"https://adwords.google.com/select/KeywordToolExternal\" target=\"_blank\" id=\"\">Google Keyword Tool</a></li> \t<li id=\"\"><a href=\"http://www.google.com/insights/search/\" target=\"_blank\" id=\"\">Google Insights</a></li> \t<li id=\"\"><a href=\"http://www.google.com/trends\" target=\"_blank\" id=\"\">Google Trends</a></li> \t<li id=\"\"><a href=\"https://freekeywords.wordtracker.com/\" id=\"\">Wordtracker</a></li></ul><h4 id=\"\">Important Next Steps</h4><p>Go back through your most recent posts.  Is there one that could use a little punch? Keep it short, but thought provoking.  Let your creativity flow, but also do your <a href=\"https://adwords.google.com/o/Targeting/Explorer?__u=1000000000&__c=1000000000&ideaRequestType=KEYWORD_IDEAS#search.none\" id=\"\">research</a>.  Determine what people are searching for in your particular topic or niche.</p>",
      "yoast-seo-meta-description": "Do your blog posts lack a punch? Here's 4 tips to write an insanely compelling blog post title that drives leads and sales!",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/07/write-great-blog-post-titles.jpg",
      "name": "Why an Insanely Compelling Blog Post Title Matters",
      "yoast-reading-time": "4",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Why an Insanely Compelling Blog Post Title Matters",
      "wp-image-alt-text": "write great blog post titles",
      "slug": "why-an-insanely-compelling-blog-post-title-matters",
      "updated-on": "2023-04-01T12:22:31.123Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:31.123Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822075973976abe926e9a"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-07-11T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p>Have you ever written the perfect article only to find you are stumped when it comes to creating your <strong id=\"\">catchy keyword friendly blog title</strong>?You’re not alone.We all have those days when writing a pithy, <strong id=\"\">emotionally responsive blog title</strong> feels just outside our reach.In my article, <a href=\"http://activerain.com/blogsview/2385581/how-to-write-a-catchy-blog-post-title-that-pops\" id=\"\"><strong id=\"\">How to Write a Catchy Blog Post Title that POPS</strong></a><strong id=\"\"> </strong>I talked about the fine line we walk as bloggers trying to generate an eye popping, finger clicking, <strong id=\"\">Googlejuice lovin’blog title, </strong>all while maintaining a human aspect.Finding the balance between <strong id=\"\">sexy and direct </strong>can throw any blogger into convulsions.But what if there were a way to <strong id=\"\">create a perfect blog title</strong> without agonizing over it?</p><h1 id=\"\">20 Sure-Fire Blog Titles That Get Results</h1><h2 id=\"\">What's a Blog Swipe File?</h2><p>On those days when you need a little motivation, keeping a <strong id=\"\">swipe file</strong> will go a long way towards creating that <strong id=\"\">perfectblog post title</strong>.Not familiar with a <strong id=\"\">swipe file</strong>?  Here's how it works:As you visit and read through other blogs look for popular posts that generated buzz.  Write down the title in your <strong id=\"\">swipe file</strong> to play around with at a later date.   The key is to<strong id=\"\"> create a list of blog titles </strong>that you can refer back to on those days you suffer from \"<strong id=\"\">blog title</strong>\" writers block.</p><h3 id=\"\">Focus on titles that contain a few of these features:</h3><ul id=\"\"> \t<li id=\"\">They maintain the KISS method of writing titles.  They're not too wordy but get the point across.</li> \t<li id=\"\">They inject emotion and cause the reader to relate immediately to the post.</li> \t<li id=\"\">They add the all important keyword \"FREE.\"</li> \t<li id=\"\">They are controversial and not afraid to stir the pot.</li> \t<li id=\"\">They ask an open-ended question, like \"What Would You Do with a Million Dollars??\"</li> \t<li id=\"\">They communicate a benefit your reader can't live without.</li></ul><h4 id=\"\">Below are <strong id=\"\">20 Sure-Fire Blog Title's that Get Results </strong>and should get your creative juices flowing!</h4><ol id=\"\"> \t<li id=\"\">Why every homebuyer should _________</li> \t<li id=\"\">Proven Steps to _________</li> \t<li id=\"\">Secrets that will _________</li> \t<li id=\"\">The wrong __________ and all your efforts will be in vain.</li> \t<li id=\"\">________ Reveals a Shortcut to _________</li> \t<li id=\"\">A Radically New Way to Beat _________ Without _________</li> \t<li id=\"\">All the Tricks to Overcome _________</li> \t<li id=\"\">How to ________ all the ________ You Ever Wanted</li> \t<li id=\"\">How to ________ your own ________ successfully!</li> \t<li id=\"\">15-minutes to find your__________</li> \t<li id=\"\">If you thought __________ was bad, wait until you see _________.</li> \t<li id=\"\">6 Surprising Secrets about _________.</li> \t<li id=\"\">10 Reasons Why __________ is more Trusted than _________.</li> \t<li id=\"\">12 Common _________ Mistakes.</li> \t<li id=\"\">Learn how to ________ in 5 Easy Steps.</li> \t<li id=\"\">How to Stop _________ and Start _________.</li> \t<li id=\"\">The Biggest Mistake you Can Make _________.</li> \t<li id=\"\">The Desperate _________ Strategy.</li> \t<li id=\"\">A Powerful Hidden Secret That Will Help You ________.</li> \t<li id=\"\">New Ways to _________ Now!</li></ol><p><strong id=\"\">Important Note: Yourkeywords</strong> (descriptive words about your post content) should be inserted into the titles above wherever appropriate.</p><h3 id=\"\">Have any <strong id=\"\"><em id=\"\">catchy blog title secrets</em></strong> of your own?  I would love to hear them!</h3>",
      "yoast-seo-meta-description": "Want to write great blog post titles that get your readers to take action? Here's 20 sure-fire ideas that will drive big results!",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/07/create-the-perfect-blog-title.jpg",
      "name": "20 Sure-Fire Blog Titles that Get Results",
      "wp-excerpt": "Have you ever written the perfect article only to find you are stumped when it comes to creating your catchy keyword friendly blog title?  You’re not alone.  We all have those days when writing a pithy, emotionally responsive blog title feels just outside our reach.\n\nIn my article, How to Write a Catchy Blog Post Title that POPS I talked about the fine line we walk as bloggers trying to generate an eye popping, finger clicking, Google juice lovin’ blog title all while maintaining a human aspect.  Finding the balance between sexy and direct can throw any blogger into convulsions.",
      "yoast-reading-time": "3",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "20 Sure-Fire Blog Post Titles that Get Results",
      "wp-image-alt-text": "create the perfect blog title",
      "slug": "20-sure-fire-blog-titles-that-get-results",
      "updated-on": "2023-04-01T12:22:30.968Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:30.968Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822066c28f46c9de40862"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-07-07T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p>Ralph Waldo Emerson said, <em id=\"\">“It is one of the most beautiful compensations of life that no man can sincerely try to help another without helping himself.”</em>Helping someone grow their business while helping you at the same time can be like Christmas in July.  You have a present to give at a time when people are least expecting it.The <strong id=\"\">Law of Reciprocity</strong> works based on this theory; that what goes around comes around. So how can you put this into action within your business?A simple way to <strong id=\"\">build an abundant business</strong> for both you and those around you is to cross refer.  <strong id=\"\"><em id=\"\">Cross refer</em></strong> simply means that you are asking how you can aid in the growth of someone else’s business.  By understanding what type of referrals they would like to receive, you open the door to <strong id=\"\">cross referral</strong> karma.</p><h2 id=\"\"><strong id=\"\">How Does Cross Referral Karma Work?</strong></h2><p>The trick to <strong id=\"\">cross referral karma</strong> is not so much in the doing as it is in the asking.  To identify who your <strong id=\"\">referral partner’s</strong> potential client is, you need to ask a lot of questions and then just listen.  Get to know their business.  Understand what makes them tick and what it is they need from you.<strong id=\"\"> </strong>By learning the ins and outs of one another’s business, you open the gateway to <strong id=\"\"><em id=\"\">exponential growth within your business</em></strong>.Once you understand their business, your next step is to let your <strong id=\"\">cross-referring partner</strong> know that you will do your best to send referrals their way!  It’s that simple!The <strong id=\"\">law of reciprocity</strong> spells it out this way - When you do something for someone else, they feel a compelling urge to reciprocate.  Now isn’t that a beautiful thing?!</p><h2 id=\"\"><strong id=\"\">Create Your Own Referral Club</strong></h2><p>It shouldn’t be a far stretch to assume that you are talking to multiple people at any given moment that could refer potential buyers and sellers to you.  (If you’re not, that’s a subject for another time!)  Every one of these people could be your next <strong id=\"\">referral karma partner!  </strong></p><h3 id=\"\"><strong id=\"\">Who Are They?</strong></h3><ul id=\"\"> \t<li id=\"\">Appraiser</li> \t<li id=\"\">Inspector</li> \t<li id=\"\">Past Client</li> \t<li id=\"\">Handyman</li> \t<li id=\"\">Landscaper</li> \t<li id=\"\">Electrician</li> \t<li id=\"\">Painter</li></ul><p>Now go through your database; <strong id=\"\">choose 3 people per day</strong> to schedule a meeting with.  Prepare a simple script explaining your goal.</p><h4 id=\"\"><strong id=\"\">For example:</strong></h4><p>“Hi Dave, I’m looking to expand my business and felt that we might be a benefit to each other. I would like to ask for 30-45 minutes of your time where I can get to know your business and see if there’s a way that I can refer clients that are in need of your services..Would you be available this week?  I have time on (1st time and date option) or (2nd time and date option).  Do either of those times work for you?”The idea behind this <strong id=\"\">referral strategy</strong> is creating a mutually beneficial team of <strong id=\"\">referring partners</strong>.  Your “club” should feel as if they’ve joined a support team that will push the limits of their business beyond the boundaries they set for themselves.You can become a <strong id=\"\">cross referral magnet!  </strong>All you have to do is ASK.</p>",
      "yoast-seo-meta-description": "Want to help someone grow their business? You can become a cross referral magnet!  All you have to do is ASK.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/07/referral-magnet.png",
      "name": "You Can Be a Referral Magnet",
      "wp-excerpt": "Helping someone grow their business while helping you at the same time can be like Christmas in July.  You have a present to give at a time when people are least expecting it.\n\nThe Law of Reciprocity works based on this theory; that what goes around comes around. So how can you put this into action within your business?",
      "yoast-reading-time": "3",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "You Can Be a Referral Magnet",
      "wp-image-alt-text": "referral magnet",
      "slug": "you-can-be-a-referral-magnet",
      "updated-on": "2023-04-01T12:22:30.829Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:30.829Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822065973977990926e97"
    },
    {
      "_archived": false,
      "wp-published-date": "2014-03-03T00:00:00.000Z",
      "_draft": false,
      "wp-excerpt": null,
      "yoast-reading-time": null,
      "wp-yoast-seo-title": null,
      "wp-content": "<p>With close to <a href=\"http://w3techs.com/technologies/details/cm-wordpress/all/all\" target=\"_blank\" id=\"\">three million blog posts</a> published each day, getting content in front of the right reader is a challenge.The key is a juicy, eye-popping <a href=\"https://rebekahradice.com/20-sure-fire-blog-titles-that-get-results/\" target=\"_blank\" id=\"\">blog post title</a> that compels the reader to pay attention and take action.While content and title are equally important, a catchy title is what gets them in the front door.It gives them a sneak peek into what they'll find once inside.Without a compelling title, your content is for naught.Below is my three-step formula to <strong id=\"\">crafting incredibly catchy blog titles</strong> and that perfect headline every time!</p><h1 id=\"\">3-Step Blog Title Formula</h1><h2 id=\"\">  Step 1: Create a Swipe File</h2><p>A swipe file is an easy way to capture ideas, thoughts, and inspiration for future blog posts. It can also provide much-needed motivation on those days when you feel less than creative.As Copyblogger says,</p><blockquote id=\"\">\"Smart copywriters use good tools to make themselves more productive, and one of those “power” tools is the <a href=\"http://www.copyblogger.com/swipe-file-tips/\" target=\"_blank\" id=\"\">swipe file</a>.\"</blockquote><p>Not familiar with a swipe file?  It's simple!As you peruse the web, pay attention to blog post titles that make you take notice. Now add that title to your swipe file.Whether you choose to create this in Word, Google Drive or Evernote, make it simple and easy to access.The key is to<strong id=\"\"> </strong>create a running list of potential blog titles<strong id=\"\"> </strong>that you can use as creative inspiration on those days you suffer from writers block.</p><h5 id=\"\">Swipe File Formula:</h5><ul id=\"\"> \t<li id=\"\">Revisit your swipe file for creative inspiration.</li> \t<li id=\"\">Play around with keywords or phrases and work it into your topic.</li> \t<li id=\"\">Run your blog post title through the \"<a href=\"http://www.aminstitute.com/headline/index.htm\" target=\"_blank\" id=\"\">Advanced Marketing Institute Headline Analyzer</a>\" to grade your title. Not familiar with it? Learn more in \"<a href=\"https://rebekahradice.com/boost-your-latest-blog-post/\" target=\"_blank\" id=\"\">8 Ideas to Boost Your Latest Blog Post</a>.\"</li></ul><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822060da449a524f20ba4_test-blog-post-headline.jpeg\" alt=\"test blog post headline\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h2 id=\"\">  Step 2: Know the Rules</h2><p>There are simple rules I follow when creating blog post titles.</p><ul id=\"\"> \t<li id=\"\">Simple wins! Keep your titles short and to the point.  My goal is seventy characters or less.</li> \t<li id=\"\">Make them clickable! Inject humor, draw on emotion or solve a problem. You want the reader to immediately relate and understand the purpose behind and value in your article.</li> \t<li id=\"\">Include your keyword or phrase in an organic and natural way.</li> \t<li id=\"\">Never ever mislead the reader with a title that has nothing to do with the content.</li> \t<li id=\"\">Communicate a benefit that your reader cannot live without.</li> \t<li id=\"\">Have fun! Add your personality to the title. Just because it needs to be search engine friendly doesn't mean it can't be playful.</li></ul><h5 id=\"\">Let's break down the blog post title below.</h5><ul id=\"\"> \t<li id=\"\">3 (how many tips the reader can expect)</li> \t<li id=\"\">Smart (who doesn't want to be smart?)</li> \t<li id=\"\">Google+ (specific)</li> \t<li id=\"\">Strategies (what the reader will receive) to</li> \t<li id=\"\">Grow Your Online Community (what the reader will learn)</li></ul><h2 id=\"\">  Step 3: Get Writing</h2><p>Now that you've created your swipe file and know the rules behind a blog post title that pops, it's time to get writing.Below are eight blog post title ideas to light your fire and help you craft a perfect headline!</p><h2 id=\"\">1. Make it Personal</h2><p>A blog title that speaks to a personal need or situation can be very effective.For example, \"How You Can Put the Love Back in Your Relationship\" not only solves a problem, but relates to readers on an intimate level.</p><h2 id=\"\">2. Make Life Easier or Better</h2><p>Think about your product or service from the consumer's perspective.What problem does it solve and how can you best get that point across in an easy and efficient manner?</p><h2 id=\"\">3. Encourage Action</h2><p><a href=\"http://blog.hubspot.com/marketing/a-simple-formula-for-writing-kick-ass-titles-ht\" target=\"_blank\" id=\"\">Blog post titles</a> should encourage action and inspire your reader to click-through. Know what triggers that action and how you can best position your content.</p><h2 id=\"\">4. Lose the Jargon</h2><p>Just because you speak in industry jargon, doesn't mean your consumer will understand it.Lose the jargon and focus instead on making your title reader and consumer friendly.</p><h2 id=\"\">5. Be Interesting</h2><p>What makes your blog post intriguing?Being an avid reader myself I can tell you how disappointing it is to read a compelling blog title only to find the content lacking. Keep you title interesting, but true to what they'll find once inside.</p><h2 id=\"\">6. Be Original</h2><p>You put your own unique spin on blog content, so why wouldn't you do the same for your title?<em id=\"\">Remember:</em> there may not be any unique ideas left, but there's always room for your unique perspective.</p><h2 id=\"\">7. Be Honest</h2><p>I mentioned this point above, but it's important enough to repeat. Always make sure your blog post title is in alignment with your content.Misleading blog post titles create distrust and frustration, two lasting feelings that no blogger wants their reader to walk away with.</p><h2 id=\"\">8. Speak Directly to Your Audience</h2><p>Know your audience and do your research.  Ask yourself:</p><ul id=\"\"> \t<li id=\"\">Who am I trying to reach?</li> \t<li id=\"\">What problem does my post solve?</li> \t<li id=\"\">Is this topic valuable?</li> \t<li id=\"\">Would I click-through if I was the consumer?</li></ul><h2 id=\"\">One Last Thought</h2><p>There is a lot of talk about keywords \"being dead\" lately. I totally disagree. While I'm no SEO specialist, I do know enough about keyword research to understand that they're still extremely powerful when used correctly.Insert them into your title when appropriate, but maintain the readability. You're writing for people, and people want a title that makes sense. Not one that looks like a bunch of gobbly gook. And yes, that's the technical term.</p><h4 id=\"\"><em id=\"\">What's your secret to catchy blog titles? I'd love to hear it!</em></h4>",
      "yoast-seo-meta-description": "How to create a juicy, eye-popping blog post title. My 3 step formula to crafting incredibly catchy blog titles every time!",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2014/03/blog-post-titles.jpg|https://rebekahradice.com/wp-content/uploads/2014/03/catchy-blog-titles.jpg|https://rebekahradice.com/wp-content/uploads/2014/03/catchy-blog-post-title-ideas.png",
      "name": "Foolproof Formula to Incredibly Catchy Blog Titles",
      "wp-category": "Social Media",
      "wp-image-alt-text": "blog-post-titles|Foolproof Formula to Incredibly Catchy Blog Titles|catchy-blog-post-title-ideas",
      "slug": "catchy-blog-titles",
      "updated-on": "2023-04-01T12:22:30.810Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:30.810Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822060da44974d3f20ba5"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-06-20T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p>Updating my <a href=\"http://www.linkedin.com/in/rebekahradice\" target=\"_blank\" id=\"\">LinkedIn profile</a> and tweaking it for optimization and SEO purposes seems to be a never ending (albeit fun) battle for me.   I see LinkedIn as a unique resource and one that is an absolute must for anyone needing to give their online presence a professional ‘shot in the arm.’With so many other online resources to choose from, why should you add LinkedIn to your social medial toolbox? In my opinion, one of the best ways Realtors® can use LinkedIn is to promote their business and brand.   With over 100 million active members, LinkedIn is no longer just an online resume.  It’s a community that when used correctly can successfully boost your online visibility and your sales.</p><h1 id=\"\">How to Use LinkedIn to Generate Real Estate Business</h1><h2 id=\"\">You Can’t Argue with the LinkedIn Statistics</h2><p>According to a recent LinkedIn study, people with more than twenty connections are thirty-four times more likely to be approached with a job opportunity than people with less than five.  I don’t know about you, but this is a strong motivating factor to get on LinkedIn and capitalize on this social network.  It’s apparent that if I’m not, my competitors are.So where do you begin?</p><h3 id=\"\">Optimize your profile</h3><ul id=\"\"> \t<li id=\"\">Complete Your Profile</li></ul><p>LinkedIn will show you your progress through a percentage bar so you can see where you’re at in the process.  You want to achieve 100% completion.</p><ul id=\"\"> \t<li id=\"\">Add Keywords to Your Title</li></ul><p>Your title is the first place to start when it comes to optimization.  It’s not just a way to describe what you do, but how and where you do it.</p><ul id=\"\"> \t<li id=\"\">Include Keywords in Your Summary</li></ul><p>Your summary is the first place people will go to learn more about you. It’s your elevator pitch; a short summary of who you are and what your business has to offer.  Keep it clean and professional, but make sure the top keywords you are interested in targeting are interspersed throughout.</p><ul id=\"\"> \t<li id=\"\">Include keywords and phrases in your Bio</li></ul><p>Your keywords would look something like this: “Rebekah Radice Social Media Manager” or “Rebekah Radice Social Media Marketing”</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822062715732010995e39_Optimize-LikndIn-Bio-Profile.png\" alt=\"Optimize LinkedIn Bio Profile\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><ul id=\"\"> \t<li id=\"\">Create a Vanity URL</li></ul><p>By default, LinkedIn assigns a generic URL to your profile.  Make sure you edit this URL and customize it to your brand or name.  You want search engines to identify you with your LinkedIn profile.Example: <a href=\"http://www.linkedin.com/in/rebekahradice\" id=\"\">http://www.linkedin.com/in/rebekahradice</a>Go to profile - public profile – and then edit your profile url, Choose your public url and then click save.  Use this link to direct people to your LinkedIn profile within your marketing, on your website and on your business cards.</p><h3 id=\"\">Make Your Profile Public</h3><p>Make sure everyone can view your profile.  What good is your LinkedIn profile if no one can access it? While you are able to hide certain information, don’t hide content relevant to search engines.Remember:  This isn’t Facebook and you don’t have a crazy aunt who says embarrassing things that you need to hide on LinkedIn. Keep your information open and available to anyone looking for you or your services.</p><h3 id=\"\">Add Your Twitter Feed</h3><p>Tie your Twitter account into LinkedIn and allow your LinkedIn contacts to keep on top of your Twitter content. You are able to control which tweets are posted to LinkedIn and can edit those settings.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822062715736578995e38_Add-Twitter-to-LinkedIn-.png\" alt=\"Add Twitter to LinkedIn\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h3 id=\"\">Get Involved with LinkedIn Answers</h3><p>LinkedIn Answers allows you to build your reputation by answering industry related questions.  By responding to questions, you allow others to see your knowledge, education and willingness to give as a Real Estate professional.Added bonus:  It will also build internal links to your profile which helps with SEO.</p><h3 id=\"\">Join Groups</h3><p>Explore LinkedIn groups and join groups where other industry professionals are hanging out. LinkedIn groups allow you to connect with other like-minded professionals, re-connect with college alumni and even target a specific group of people.While LinkedIn isn’t your final destination in the social media conundrum, I can attest to the multitude of opportunities that have come my way because of being active on LinkedIn.And there it is - your final and most important key to LinkedIn success.  Participation and Interaction.It’s not enough to just sign up for your LinkedIn account and let it idly sit.  As with any community, what you get out of it is based solely on your level of involvement or lack thereof.<a href=\"https://twitter.com/#!/RebekahRadice\" target=\"_blank\" id=\"\">Let’s Connect on LinkedIn</a></p>",
      "yoast-seo-meta-description": "Not sure how to make LinkedIn work for you? Here's how to optimize your profile to drive leads and collect referrals for your real estate business.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/06/LinkedIn-for-Real-Estate-Business.jpg|https://rebekahradice.com/wp-content/uploads/2011/06/Rebekah-Radice-LinkedIn.png|https://rebekahradice.com/wp-content/uploads/2011/06/Add-Twitter-to-LinkedIn-.png|https://rebekahradice.com/wp-content/uploads/2011/06/Optimize-LikndIn-Bio-Profile.png",
      "name": "How to Use LinkedIn to Generate Real Estate Business",
      "wp-excerpt": "With so many other online resources to choose from, why should you add LinkedIn to your social medial toolbox? In my opinion, one of the best ways Realtors® can use LinkedIn is to promote their business and brand.   With over 100 million active members, LinkedIn is no longer just an online resume.  It’s a community that when used correctly can successfully boost your online visibility and your sales.",
      "yoast-reading-time": "4",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "How to Use LinkedIn to Generate Real Estate Business",
      "wp-image-alt-text": "LinkedIn for Real Estate Business|Rebekah Radice LinkedIn|Add Twitter to LinkedIn|Optimize LinkedIn Bio Profile",
      "slug": "how-to-use-linkedin-to-generate-real-estate-business",
      "updated-on": "2023-04-01T12:22:30.364Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:30.364Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "6428220627157320c7995e3a"
    },
    {
      "_archived": false,
      "wp-published-date": "2012-05-14T00:00:00.000Z",
      "_draft": false,
      "wp-excerpt": null,
      "wp-content": "<p>With over 500 million users, <strong id=\"\"><em id=\"\">Facebook is now used by 1 in every 13 people on earth,</em></strong> and of those people, the majority are now spending more time on Facebook than watching TV.With statistics like that, is it any wonder that more than 3 million businesses have moved their marketing dollars to Facebook?If you haven’t created a <strong id=\"\">Facebook Page for your business </strong>yet, chances are your competitors have.  But where do you start, what do you say, and how do you <strong id=\"\">promote your page </strong>and your audience?Here's how to market and grow your business on Facebook, starting today!</p><h1 id=\"\">How to Market and Grow Your Business on Facebook</h1><h3 id=\"\"><strong id=\"\">Things You Need to Know Before Getting Started</strong></h3><ul id=\"\"> \t<li id=\"\">Your <a href=\"http://www.facebook.com/pages/create.php\" id=\"\"><strong id=\"\">Facebook business page</strong></a> will be attached to your personal page.  In other words, you cannot create a page until you have set up a personal Facebook account.  Once you’ve done that, you can create an unlimited number of <strong id=\"\">Facebook pages</strong>.</li> \t<li id=\"\">Your Facebook page is also public, so fans can easily find your business and Google.  Your page and posts are indexed, giving it the beloved “Google Juice” we’re all looking for.</li> \t<li id=\"\">Facebook is designed to get you and your brand in front of as many eyeballs as possible.  The problem with most businesses is that they jump in without a plan.</li> \t<li id=\"\">It may be exciting to hop on the Facebook bandwagon but without clearly defined goals and a system to track your progress; your enthusiasm may quickly fizzle. Your goal should be to create an engaging page that gives your fans a reason to seek you out daily.</li></ul><h2 id=\"\"><strong id=\"\">1. Create a Page</strong></h2><p>Your first step is to generate your new page.  To begin the design of your new <a href=\"http://www.facebook.com/pages/create.php\" id=\"\"><strong id=\"\">Facebook Page</strong></a>, you will need to add a <strong id=\"\">business page</strong> to your current profile.I’m not going to dive into the step-by-step instructions, but you can find them under <a href=\"https://www.facebook.com/pages/learn.php\" target=\"_blank\" id=\"\"><strong id=\"\">Facebook Page guidelines</strong></a>.</p><h2 id=\"\"><strong id=\"\">2. Create a Custom Welcome Page</strong></h2><p>Facebook allows you to create a <strong id=\"\">custom page</strong> or <strong id=\"\">mini website</strong> within your Facebook Page.  You can then direct all new fans to this page where you can promote your business, give away a freebie, host a contest, or request that they sign up for your free newsletter.  This is one area you need to get your creative juices flowing and determine what “item of value” will draw fans in and get them to click the LIKE button.Video is always a BIG draw.  Check out the great job my friends Frank and Brian at <a href=\"https://www.facebook.com/frankandbrian\" target=\"_blank\" id=\"\"><strong id=\"\">Think Big Work Small</strong></a> have done with their <strong id=\"\">Facebook Welcome Tab</strong>.<strong id=\"\"><em id=\"\">Important Side Note</em></strong>:  Since Facebook discontinued its support of fbml (Facebook’s answer to html), building an <strong id=\"\">iframe site</strong> can be a little tricky.  But don’t worry; there are simple ways to get your page up and running in a jiffy.</p><h2 id=\"\"><strong id=\"\">Design a FREE Facebook Landing Page</strong></h2><ul id=\"\"> \t<li id=\"\">If you have admin rights to your Wordpress blog, you can add the <a href=\"http://wordpress.org/extend/plugins/facebook-tab-manager/\" id=\"\"><strong id=\"\">Facebook Tab Manager</strong></a> plugin which allows you to edit and customize your page within your Wordpress blog.</li> \t<li id=\"\"><a href=\"http://www.wix.com/flash_websites/facebook-fan-page-fish2?utm_source=google&utm_medium=cpc&utm_campaign=bi_FPA%5ecustomize&experiment_id=Customize%20%2Bfacebook%20page&gclid=CPKiyOqf0akCFRxrgwodRW_jMA\" id=\"\"><strong id=\"\">Wix Facebook Page</strong></a><strong id=\"\"> </strong></li> \t<li id=\"\"><a href=\"http://new.pagemodo.com/\" id=\"\"><strong id=\"\">Pagemodo</strong></a></li> \t<li id=\"\"><a href=\"http://iframes.wildfireapp.com/\" id=\"\"><strong id=\"\">Wildfire Facebook IFrame App</strong></a></li></ul><h2 id=\"\"><strong id=\"\">3. Add Content <em id=\"\">Before</em> You Promote Your Page</strong></h2><p>This idea is based on the theory that it is better to offer an enormous amount of value and build loyalty within your fans long before you ask for their business.Make sure you have several posts up before making your page public.  Not sure where to find content?  Here are a few ideas to get you started:</p><ul id=\"\"> \t<li id=\"\">Blogs/Articles You Have Written (you probably have hundreds to rotate through)</li> \t<li id=\"\">News Resources (local and national newspapers with tips, tools and how-to’s for buyers and sellers)</li> \t<li id=\"\">Announce a Sales Event or Promotion</li> \t<li id=\"\">Give Away a FREE E-Book or other item of value</li> \t<li id=\"\">Offer how-to advice that save buyers and sellers time and money</li> \t<li id=\"\">Talk about local events</li> \t<li id=\"\">Spotlight a local vendor and offer a coupon that they must opt in for on your website</li> \t<li id=\"\">Create Top 10 Lists and break them out into daily posts</li> \t<li id=\"\">Pick an obvious local location to film a video from and invite fans to find you.  The first person to comment with your correct location wins a prize.</li></ul><h2 id=\"\"><strong id=\"\">4. Add Consistent Content </strong></h2><p>Just like your blog, your Facebook fan page will quickly become obsolete if you’re not constantly offering fresh content.  I suggest posting at least once per day and at the high traffic times when your information is most likely to come up on your fans wall.According to a recent study by <a href=\"http://buddymedia.com/\" id=\"\"><strong id=\"\">Buddy Media</strong></a>, there are not only certain days that are optimal but times of the day as well.  Interestingly enough, their findings concluded that 60% of businesses were posting during normal business hours but those that posted outside of those hours had a <strong id=\"\">20% higher engagement rate</strong>.</p><h2 id=\"\"><strong id=\"\">5. Add the LIKE Button &amp; Box to Your Blog </strong></h2><p>Allow blog followers and website visitors to find your page by adding the Like <a href=\"http://developers.facebook.com/docs/plugins/\" id=\"\"><strong id=\"\">button</strong></a> or <a href=\"http://developers.facebook.com/docs/reference/plugins/like-box/\" id=\"\"><strong id=\"\">box</strong></a><strong id=\"\"> </strong>to your site.Begin by creating your <a href=\"http://developers.facebook.com/docs/reference/plugins/like-box/\" id=\"\"><strong id=\"\">Like Box</strong></a> by adding your Facebook page URL to the plugin.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/6428220562519382e140336c_Facebook-Like-Box-300x238.png\" alt=\"Facebook Like Box\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h2 id=\"\"><strong id=\"\">6. Find Fans</strong></h2><p>A big misconception is that once you’ve set up your <strong id=\"\">Facebook business page</strong> you should immediately start inviting all of your family and friends.  This is a no-no and I’ll tell you why.First, why invite a large group of people with no true interest in your page?  Your page is about generating business, and involving a static group of people brings no intrinsic value.  Secondly, how many invites do you have waiting for you right now that you have yet to read?  We’ve all become accustomed to the invite “noise,” but spamming your friends is intrusive and just poor manners.</p><h4 id=\"\"><strong id=\"\">Here are a few creative ways to find new fans:</strong></h4><ul id=\"\"> \t<li> \tVisit Facebook pages where home buyers hang out. Spend time engaging with that community and bring awareness to your page. \t</li><li id=\"\">Add your Facebook page to all of your direct marketing along with an incentive to LIKE your page.</li><li> \t</li><li id=\"\">Add to your Email Signature</li></ul><ul id=\"\"> \t<li id=\"\">Create Facebook Ads – Ads allow you to go hyper-local giving you the most targeted bang for your marketing buck.  For a very small budget, you can use ads to get your message in front of the exact person you want fanning your page.  Start creating your <a href=\"http://www.facebook.com/advertising/\" id=\"\"><strong id=\"\">Facebook ad</strong></a> and have it up and running in no time.</li> \t<li id=\"\">Host an Event online or offline and drive fans back to your Facebook fan page.  Once you’ve hosted the event, make sure some pictures can be uploaded and tagged.  Encourage your fans to tag themselves in the photos.</li> \t<li id=\"\">Invite fans to join through an <strong id=\"\">SMS Text Message</strong>.  Your fans will simply send a text message to 32665 (FBOOK) with the words “fan yourusername” in the message.  Your page will need a <a href=\"http://www.facebook.com/username/\" id=\"\"><strong id=\"\">unique username</strong></a> before you can use this feature.  You must have 25 fans before you are able to choose a username.</li></ul><h2 id=\"\"><strong id=\"\">7. Send a Thank You Message</strong></h2><p>A \"Thank You\" message might be the most unappreciated but powerful business tool ever created. Just as we send a quick handwritten note to thank someone for their kindness, doing the same on Facebook extends that level of gratitude.Your message is short and sweet with two purposes.  You thank them for <strong id=\"\">becoming fans of your page</strong> and pointing out a specific item of value or important information you want them to be aware of.</p><h4 id=\"\"><strong id=\"\">I’d love to hear your ideas and see what works for you!  Comment below with a link to your Facebook page so we can check it out and “LIKE” your page!</strong></h4>",
      "yoast-seo-meta-description": "Want to get started with Facebook marketing for your business? Build, promote and engage for a successful Facebook Fan Page strategy!",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/06/Build-Promote-Engage-Facebook-Fan-Page.jpg|https://rebekahradice.com/wp-content/uploads/2011/06/Facebook-Like-Box.png|https://rebekahradice.com/wp-content/uploads/2012/05/Facebook-LIKE-Box-Instructions-e1336932540454.jpg",
      "name": "7 Simple Steps to Facebook Fan Page Success",
      "yoast-reading-time": "6",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "7 Simple Steps to Facebook Fan Page Success",
      "wp-image-alt-text": "Build Promote Engage Facebook Fan Page|Facebook Like Box|Facebook LIKE Box Instructions",
      "slug": "7-simple-steps-to-build-and-promote-your-facebook-fan-page",
      "updated-on": "2023-04-01T12:22:29.914Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:29.914Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282205625193df5b40336d"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-06-19T00:00:00.000Z",
      "_draft": false,
      "yoast-reading-time": "2",
      "wp-content": "<figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822050480ca6a3dc3dc2b_Rebekah-Radice-Grandfather.jpeg\" alt=\"Rebekah Radice Grandfather\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">My grandfather was a tall strapping man with eyes of pure blue, a tongue that would whip your head around and a heart that cracked every time he saw my Grandmother, the woman he affectionately called “Tiny.”</p><p id=\"\">I spent two years living in their home at the age of 9 and 10. My family, having lived in Southern California, had uprooted in 1978 to move to Chicago for a brief time. A cold and dismal place for a girl born in the sunshine; Chicago was a location both me and my sister were eager to put behind us.</p><p id=\"\">My father, a radio man by trade had taken an offer of employment in Illinois. &nbsp;When he got there, he found the many upheavals that follow the radio industry crash down on top of him. I can only imagine how difficult it was for my dad to pack his family into the car and head back home and to the home of his parents in Burbank, CA.</p><p id=\"\">Relationships with grandparents can be complicated and strained as children. We feel they’re “out of touch” while they see us as beating to a drum they just don’t understand.</p><p id=\"\">This defined my relationship with my grandfather when I first moved into his home the summer of 1980.</p><p id=\"\">‍<strong id=\"\">The Early Days</strong></p><p id=\"\"><strong id=\"\">‍</strong>I was a brash, stubborn and often a pig-headed young girl who had grown accustomed to living a free and carefree life devoid of much responsibility. My grandfather, an ex-navy man would have none of it.</p><p id=\"\">One day early into our living arrangement, I was told to spend time in the yard cleaning up after my dog. Not one to do anything quickly, I spent the next several hours building forts, climbing trees and hopping in the pool with my sister.</p><p id=\"\">At the end of the day my grandfather asked if I’d done what he’d requested. I stated 'no' and that I would get to it in a bit. It was at this point that he shuffled me outside and told me I would not come back into his home until the chore was accomplished. I huffed and puffed and muttered “you’re not my father” under my breath to which he exclaimed – “and you’re darn lucky I’m not.”</p><p id=\"\">That moment was a paradigm shift in my perception of him. This man, who I’d looked upon as an enigma, wasn’t one after all. He was simply a principled man that asked for a job to be done and expected honest work in return.</p><p id=\"\">‍<strong id=\"\">The Seasons of our Lives</strong></p><p id=\"\"><strong id=\"\">‍</strong>I began to find ways to spend time my grandfather. &nbsp;We would walk to the park or spend a day on the pier in silence, fishing in the beautiful Pacific Ocean.</p><figure id=\"\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"\"><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822050480ca6c98c3dc2a_Rebekah-Radice-Grandparents.jpeg\" alt=\"Rebekah Radice Grandparents\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">My grandmother, whom I loved dearly, died over 12 years ago. My grandfather’s heart shattered that day, but it wasn’t until the summer of 2004 that he unexpectedly went to be with her. &nbsp;</p><p id=\"\">I consider myself twice blessed by his “roaming” soul as he spent much time between all of our families in California and Colorado after her passing. &nbsp;There are so many moments I think of them and know that we&nbsp;created a lifetime of precious memories.</p><p id=\"\">So with that I say, <strong id=\"\">Happy Father’s Day</strong> to all of the men who are committed to creating those moments each and every day.</p>",
      "yoast-seo-meta-description": "Ready for a burst of positivity? No problem. Discover how to cultivate a sunny outlook on life, even during partly cloudy times.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/06/Rebekah-Radice-Grandparents.jpg|https://rebekahradice.com/wp-content/uploads/2011/06/Rebekah-Radice-Grandfather.jpg",
      "name": "Partly Cloudy with a Sudden Chance of Sunshine",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Partly Cloudy with a Sudden Chance of Sunshine",
      "wp-image-alt-text": "Rebekah Radice Grandparents|Rebekah Radice Grandfather",
      "slug": "partly-cloudy-with-a-sudden-chance-of-sunshine",
      "updated-on": "2023-04-07T02:05:32.304Z",
      "updated-by": "Collaborator_63b3f1b4d1ecde1b9823dc80",
      "created-on": "2023-04-01T12:22:29.856Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-07T02:05:32.304Z",
      "published-by": "Collaborator_63b3f1b4d1ecde1b9823dc80",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822050480ca8210c3dc2c"
    },
    {
      "_archived": false,
      "wp-published-date": "2013-01-26T00:00:00.000Z",
      "_draft": false,
      "wp-excerpt": null,
      "yoast-reading-time": null,
      "wp-content": "<p>Looking for the best social media time management tools?As you tweet, post, comment and curate, juggling daily can be tough.Our hyper-connected social media world is demanding.As days seem to accelerate and the to-do's pile up, managing time and focus can leave you feeling riddled with stress and frozen in a spiral of wasted energy.Between email, phone calls, projects and team meetings, it can seem that every time you turn around a new to-do has popped up.  It’s easy to see why the days feel frantic when everything seems to be tugging at us all at once.Below are a few tips to manage your<a href=\"https://rebekahradice.com/daily-social-media-checklist-double-engagment/\" id=\"\"> social media</a> daily activities more effectively.</p><h1 id=\"\">Social Media Time Management Tools to Maximize Time Online</h1><p>I track phone calls, time spent on projects, and even the time I spend responding to friends and fans on Facebook.Stop wondering where the time went and take control with <a href=\"http://www.focusboosterapp.com/\" target=\"_blank\" id=\"\">Focus Booster</a>.I absolutely love this app! Download itto find the focus you need to get done what needs to be done.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/6428220526a4725425a4ee61_focusbooster.jpeg\" alt=\"focusbooster\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p>Another handy tool is <a href=\"http://www.online-stopwatch.com/\" id=\"\">online stopwatch</a>.  With each of these timers, you are less likely to waste time chatting with a friend about your weekend plans when a stopwatch is counting down the minutes in front of you.</p><h1 id=\"\">Be A Password Master</h1><p>Do you find yourself scouring sticky note after sticky note for elusive passwords? If you're anything like me, this simply won't do when you're quickly moving in and out of one social media site to the next.Thank goodness for one of my absolute favorite <a href=\"https://rebekahradice.com/manage-time-on-social-media/\" id=\"\">social media time savers</a>!<a href=\"http://roboform.com/\" id=\"\">Roboform</a> is a password manager and web form filler that will help stop the madness!  Here’s how it works:Visit your favorite website, login and Roboform will securely save your information.  The next time you visit, Roboform will automatically log you in.  Plus, you can access your Roboform logins from any computer with Roboform Everywhere. I could not live without it!</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/6428220526a472385da4ee5e_roboform-socialmedia.jpeg\" alt=\"roboform socialmedia\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p>Want to try Roboform? You can grab a free trial download <a href=\"http://www.roboform.com/download\" id=\"\">right here</a>.</p><h1 id=\"\">Manage Your Time Spent Online</h1><p>Who of us hasn’t found time slipping away as we mindlessly surf the web?  <a href=\"http://www.rescuetime.com/\" id=\"\">RescueTime</a>  is a robust application that helps you identify how and where you are wasting your time online.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/6428220526a47224baa4ee5f_rescuetime.jpeg\" alt=\"rescuetime\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p>Once you set it up, it will run in the background, analyzing the amount of time spent on each website and application.  Beware:  It can be a real eye opener!</p><h1 id=\"\">Shut Your Social Media Down</h1><p>And last but not least, an app that will limit your <a href=\"https://rebekahradice.com/daily-social-media-checklist/\" id=\"\">time spent on social media</a> so you can focus on what really matters most.<a href=\"http://macfreedom.com/\" target=\"_blank\" id=\"\">Freedom Software</a> is an app for Mac or PC users and will shut down your social media so you can leave the day feeling effective and productive!</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/6428220526a472a27fa4ee60_freedomsoftware.jpeg\" alt=\"http://macfreedom.com/\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p>Finally, realize that there are only 24 hours in a day and completely managing your time spent on social media  is not going to happen.All you can do is manage the events, tasks and to-do’s as best as possible to alleviate additional stress.What are your top <a href=\"https://rebekahradice.com/social-media-calendar-strategy-template/\" id=\"\">social media time management tips</a>?</p>",
      "yoast-seo-meta-description": "Struggling to find enough time in your day? Use the right tools! Here's the best social media time management tools to maximize time online.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2013/01/social-media-time-management-tools.jpg|https://rebekahradice.com/wp-content/uploads/2011/06/focus-booster.jpg|https://rebekahradice.com/wp-content/uploads/2011/06/roboforms.jpg|https://rebekahradice.com/wp-content/uploads/2012/10/roboform-socialmedia.jpg|https://rebekahradice.com/wp-content/uploads/2012/10/focusbooster.jpg|https://rebekahradice.com/wp-content/uploads/2012/10/rescuetime.jpg|https://rebekahradice.com/wp-content/uploads/2012/10/freedomsoftware.jpg|https://rebekahradice.com/wp-content/uploads/2013/01/Social-Media-Time-Management-Tools-to-Maximize-Time-Online1.jpg|https://rebekahradice.com/wp-content/uploads/2013/01/Social-Media-Time-Management-Tools-.jpg",
      "name": "Social Media Time Management Tools to Maximize Time Online",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Social Media Time Management Tools to Maximize Time Online",
      "wp-image-alt-text": "social-media-time-management-tools|focus-booster|roboforms|roboform socialmedia|focusbooster|rescuetime|http://macfreedom.com/|social media time management|Social Media Time Management Tools",
      "slug": "social-media-time-management-tools-to-maximize-time-online",
      "updated-on": "2023-04-01T12:22:29.850Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:29.850Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "6428220526a472078fa4ee63"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-06-18T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p id=\"\">In my post <a href=\"http://activerain.com/action/blogsview/2352584/time-management-tips-you-can-t-do-without\" id=\"\"><strong id=\"\">Time Management Tips You Can’t Afford to Do Without</strong></a> we explored a few techniques to <strong id=\"\">manage your day</strong> and minimize any wasted hours.  Now I want to turn my focus towards those nasty <strong id=\"\">to-do lists</strong>.  You know…the lists that just seem to pile up with nothing ever really accomplished?  I have had many of those throughout the years and finally decided to find a simple but effective solution.  I needed the ability to visually “check the box” and know that I had accomplished something.  It’s that feeling of relief that tells me that I’m now free to move on to the next task.</p><h3 id=\"\"><strong id=\"\">What a To-Do List Can Do For You</strong></h3><p>A <strong id=\"\">to-do list </strong>is a must to keep you focused and on top of those <strong id=\"\">important tasks</strong>.  It’s essential that you start your day with a fresh perspective and clean sheet of paper (whether it’s digital or literal).The best part about all of these applications is their ability to improve your productivity by syncing between Outlook, Gmail and your smart phone.</p><ul id=\"\"> \t<li id=\"\"><a href=\"http://teamly.com/\" id=\"\"><strong id=\"\">Teamly</strong></a></li></ul><p>Teamly can assist you or your team stay organized and concentrated on your most important tasks.  Teamly not only allows you to set to-do’s for your appointments, dates and tasks, you can also track the status of each one and monitor your teams progress.</p><ul id=\"\"> \t<li id=\"\"><a href=\"http://tadalist.com/\" id=\"\"><strong id=\"\">TaDa List</strong></a><strong id=\"\"> </strong></li></ul><p>Simple to-do lists. Make lists, add items, check 'em off when they're done. Works wonderfully on the web and your iPhone.</p><ul id=\"\"> \t<li id=\"\"><a href=\"http://www.rememberthemilk.com/\" id=\"\"><strong id=\"\">Remember The Milk</strong></a><strong id=\"\"> </strong></li></ul><p>Never forget the milk or anything else with this simple but powerful app.  Are you a Gmail user?  Now you can manage your Remember The Milk tasks alongside your emails. Available as a <a href=\"http://www.rememberthemilk.com/services/gmail/gadget/\" id=\"\">gadget</a> (with Gmail Labs) or <a href=\"http://www.rememberthemilk.com/services/gmail/addon/\" id=\"\">browser add-on</a> for Mozilla Firefox and Google Chrome (connect your tasks with your mail, contacts, and events in Gmail).</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822056c28f483e0e4084f_remember-the-milk.png\" alt=\"remember the milk\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p><strong id=\"\"> </strong></p><ul id=\"\"> \t<li id=\"\"><a href=\"http://blablalist.com/\" id=\"\"><strong id=\"\">Bla-bla List</strong></a></li></ul><p>Bla-bla List is a completely free, no strings attached to-do list app.  With <strong id=\"\">Bla-bla List, </strong>you can:1. Make a list of things to think about later when you're not so busy2. Share your lists with others even if they don't have an account3. Publish your lists with RSS so that others get instant updates4. Privately share your lists with anyone and work on them together5. Email yourself a copy of your list<strong id=\"\"><em id=\"\">And last but not least comes one of my favorites….</em></strong></p><h3 id=\"\"><strong id=\"\">Now Do This</strong></h3><p>If you can’t keep your <strong id=\"\">to-do list</strong> easy then this app is just what you need! <a href=\"http://nowdothis.com/\" id=\"\"><strong id=\"\">NowDoThis</strong></a> is a super-simple <strong id=\"\">to-do list app </strong>that will keep those all important tasks right in front of you.  Go ahead..give it a try.  It’s quick, fun and free!<em id=\"\">Check out the next installment </em><strong id=\"\">How to Quickly Organize &amp; Simplify Outlook </strong>or hop back to part one in my series <a href=\"http://activerain.com/action/blogsview/2352584/time-management-tips-you-can-t-do-without\" id=\"\"><strong id=\"\">Time Management Tips You Can’t Afford to Do Without</strong></a>.<a href=\"http://rebekahradiceblog.com/post/2355211/create-to-do-lists-like-a-pro\" target=\"_blank\" id=\"\"><em id=\"\">Create To-Do Lists Like a Pro</em> </a>was written by Rebekah Radice.</p>",
      "yoast-seo-meta-description": "Simple to-do lists. Make lists, add items, check 'em off when they're done. Works wonderfully on the web and your iPhone.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/06/create-a-to-do-list.jpg|https://rebekahradice.com/wp-content/uploads/2011/06/remember-the-milk.png",
      "name": "Create To-Do Lists Like a Pro",
      "wp-excerpt": "In my post Time Management Tips You Can’t Afford to Do Without we explored a few techniques to manage your day and minimize any wasted hours.  Now I want to turn my focus towards those nasty to-do lists.  You know…the lists that just seem to pile up with nothing ever really accomplished?  I have had many of those throughout the years and finally decided to find a simple but effective solution.  I needed the ability to visually “check the box” and know that I had accomplished something.  It’s that feeling of relief that tells me that I’m now free to move on to the next task.",
      "yoast-reading-time": "3",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Create To-Do Lists Like a Pro",
      "wp-image-alt-text": "create a to do list|remember the milk",
      "slug": "create-to-do-lists-like-a-pro",
      "updated-on": "2023-04-01T12:22:29.527Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:29.527Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822056c28f454b5e40851"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-06-12T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822046a10ec872b56d91b_why-blog-on-active-rain.png\" alt=\"why blog on active rain\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p>I had the privilege of speaking at a Mortgage Technology Summit in Denver, CO last week about the power of Active Rain.  I spoke from my own experience and discussed the benefits that I feel are often overlooked.One of the biggest bonuses of your Active Rain account is an <a href=\"http://www.rebekahradiceblog.com/\" id=\"\">Outside Blog</a>.  Now I understand that upgrading to a RainMaker account can feel like another way the industry nickel and dimes us to death.  Believe me; I too had the same hesitation in taking on another monthly fee.  However, the explosion I’ve seen within my business in the 6 short months since I’ve upgraded and become an active part of the community has rocked my world.Since February 2011 I’ve been asked to write for <a href=\"http://www.scotsmanguide.com/\" id=\"\">Scotsman Guide</a>, <a href=\"http://thenichereport.com/\" id=\"\">The Niche Report</a>, My FHA Mortgage Blog (now <a href=\"http://mortgagedaily.tv/\" id=\"\">Mortgage Daily</a>) and several other industry blogs.  As you can imagine, being recognized for your work is a huge pat on the back to an aspiring writer!  Beyond that I’ve established new and amazing partner relationships, completed 10 new online loan applications and had my best production month of the year in May 2011.I attribute all of this to my new perspective, new found blogging mojo and the extraordinary Google juice Active Rain blogs bring to your content.If you’ve been reluctant to blog or engage with this community, let me give you my Top 10 Reasons to Blog on Active Rain.  They are of course my personal takeaways from the last several months and were in no way coerced or encouraged by anyone within Active Rain. (Silly but an often required disclaimer)</p><h4 id=\"\">Roll Out Your Active Rain Blog in Minutes</h4><p>Active Rain offers all of the tools you need to quickly and effortlessly get your blog up and running in a matter of minutes.  There is plenty of other customization and optimization you can do but if you want to start blogging asap without the fuss of Wordpress, Blogger or other platforms that require additional work – AR is the place to start!</p><h4 id=\"\">Active Rain is Blog SEO on Crack</h4><p>If you’re still skeptical about the so-called SEO benefits of an Active Rain blog, then you haven’t been paying attention to the community <a href=\"http://activerain.com/action/testimonials\" id=\"\">success stories</a>.Active Rain is like an online shopping mall and your blog is the store.  AR drives the traffic to us and all we need to do is market &amp; promote ourselves to that targeted audience.</p><h4 id=\"\">Build Your Brand &amp; Your Niche</h4><p>Your Active Rain blog and profile allow you the freedom to create and build the brand you want.  Are you still stuck in the “static” website rut?  Fresh and consistent content is key to prospective clients finding you on the web.  Don’t think of blogging as a replacement to your current marketing efforts, but rather an extension of what you’re already doing.  Blogging and social media give you the ability to extend your brand beyond the limits formally placed on business’ through traditional marketing.  Think big and build the brand you’ve dreamed of!</p><h4 id=\"\">Connect with like-minded professionals</h4><p>Active Rain brings together like-minded professionals that freely offer their time, support, wisdom and knowledge on a daily basis.  Becoming active within the community gives you strength to push through the tough days and a cheerleading section when you’re ready to celebrate a win.  The added bonus is the FREE education you receive through the Active Rain team and members.</p><h4 id=\"\">Become the Local Expert</h4><p>Blogging about local community events is a great way to connect with buyers and sellers researching your particular area.  Blogging about frequently asked homebuyer questions or providing solutions to sellers positions you as the local expert within your field.Your Active Rain blog gives you the opportunity to define your niche and spotlight your knowledge.  Blog about what you know and find unique ways to connect both online and offline with potential clients and businesses within your community.I could go on and on about the power of Active Rain and the difference blogging can make in your career, but I won’t.  I’ll just leave you with this.If you’ve been bashful, fearful, self-conscious, shy, timid or just plain scared to blog then my advice is the same as Nike:  Just DO IT.  Put away the excuses and pick up the pen.  Blogging will transform your business and Active Rain will give you the juice to succeed.</p>",
      "yoast-seo-meta-description": "Active Rain offers all of the tools you need to quickly and effortlessly get your blog up and running in a matter of minutes.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/06/why-blog-on-active-rain.png",
      "name": "Top 5 Reasons You Should Blog on Active Rain",
      "wp-excerpt": "Active Rain offers all of the tools you need to quickly and effortlessly get your blog up and running in a matter of minutes.  There is plenty of other customization and optimization you can do but if you want to start blogging asap without the fuss of Wordpress, Blogger or other platforms that require additional work – AR is the place to start!",
      "yoast-reading-time": "4",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Top 5 Reasons You Should Blog on Active Rain",
      "wp-image-alt-text": "why blog on active rain",
      "slug": "top-5-reasons-you-should-blog-on-active-rain",
      "updated-on": "2023-04-01T12:22:28.859Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:28.859Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822046a10ec3f9056d91c"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-06-07T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p>I love social media.  I wake up to see <strong id=\"\">what happened on Facebook</strong> while I was asleep, keep up with my friends on Twitter, check in at the latest restaurant on Foursquare and find my favorite blogs (insert favorite “authors”) in Google Reader.  So when I say <strong id=\"\">I love social media</strong>, I might lead you to believe that it’s all just fun and games.  You would be wrong.But here’s a simple fact - the majority of businesses on Facebook, Twitter and LinkedIn are wasting their time.  Why?  They don’t use social media effectively to <strong id=\"\">leverage their brand</strong>.We all know social media impacts what we read, what we buy, what movies we see and even the way we view Hollywood stars.  #Winning?  I think not.In fact, a recent survey shows that we’ve become such a “<strong id=\"\">social” society</strong> that 30% of men polled and 46% of women would rather go <a href=\"http://psychcentral.com/blog/archives/2008/12/21/not-tonight-dear-im-on-the-internet/\" id=\"\"><strong id=\"\">two weeks without sex than live without the internet</strong></a>.  WOW!  Are you kidding me?  I said I love social media, but I wasn’t going that far!So what exactly should we be doing to increase reader engagement and connect with the very consumers we’re eagerly attempting to attract?  First we must focus on what our “<strong id=\"\">social interaction” </strong>goals are<strong id=\"\">.  Ask yourself:</strong></p><ul id=\"\"> \t<li id=\"\">Who is my customer?</li> \t<li id=\"\">How am I reaching them?</li> \t<li id=\"\">Do they care about my message?</li> \t<li id=\"\">Are they listening?</li></ul><p>If <strong id=\"\">they’re not listening</strong>, what is it that they’re not relating to?  Have you spelled out in clear terms what you have to offer, what they can’t live without and how you can <strong id=\"\">solve the problem</strong> they’re faced with?Social interaction and <strong id=\"\">business marketing </strong>combine two incredible forces.  By going social with your marketing efforts,  you have the opportunity to interact, captivate and call your fans, friends and followers to action.  But this means that as a business owner and entrepreneur you not only need to be <strong id=\"\">listening to your customers</strong>, but you must find a way to get their ear.</p><h3 id=\"\"><strong id=\"\">What's the Point?</strong></h3><ul id=\"\"> \t<li id=\"\">What am I using Social Media for?</li> \t<li id=\"\">Whose attention am I trying to gain?</li> \t<li id=\"\">What is my style or personality and how will that shine through?</li> \t<li id=\"\">Am I staying true to my message?</li></ul><p>Getting your customers and potential clients to <strong id=\"\">actively “listen” to your message </strong>means you must refine your communication. Focus on what your customer wants; ask yourself everyday whether your message is what they’re interested in and stay true to your goals.Your social interaction whether it’s on Facebook, Twitter, Linkedin or Active Rain should be an extension of who you are and a constant reminder to prospects, past clients and referral partners that you’re here to assist when they’re ready to make a move.</p>",
      "yoast-seo-meta-description": "Struggling to combine your Social interaction and business marketing efforts? Here's how you can get clients to listen to what you have to say.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/06/social-media-strategy.png",
      "name": "You're Talking, but Is Anyone Listening?",
      "wp-excerpt": "I love social media.  I wake up to see what happened on Facebook while I was asleep, keep up with my friends on Twitter, check in at the latest restaurant on Foursquare and find my favorite blogs (insert favorite “authors”) in Google Reader.  So when I say I love social media, I might lead you to believe that it’s all just fun and games.  You would be wrong.",
      "yoast-reading-time": "2",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "You're Talking, but Is Anyone Listening?",
      "wp-image-alt-text": "social media strategy",
      "slug": "youre-talking-but-is-anyone-listening",
      "updated-on": "2023-04-01T12:22:28.524Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:28.524Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822048fbcbe2819c05ff7"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-06-04T00:00:00.000Z",
      "_draft": false,
      "wp-image-alt-text": null,
      "wp-content": "<p>If you have been <strong id=\"\">blogging</strong> for some time you undoubtedly have posts that you felt got less than their deserved attention.   While you were busy pouring your opinions, expertise and witty repartee into each article, crickets were heard chirping in the background.  So why not <strong id=\"\">revive </strong>those <strong id=\"\">old blog posts</strong> and bring them back to life?!</p><p id=\"\">The key to this is taking an <strong id=\"\">old post</strong> and putting a new face on it.  <strong id=\"\">Refresh the content</strong> with innovative ideas, your top recommendations or personal stories.  Make it engaging and fun to a whole new audience while increasing your blog loyalty and buzz!</p><h2 id=\"\"><strong id=\"\">How to Refresh Old Blog Posts</strong></h2><h3 id=\"\"><strong id=\"\">Write a Follow-Up</strong></h3><p>Go back through your past blogs and scan for anything that deserves a second look.  Did you write a blog that felt unfinished or possibly warranted a follow up due to changes or updates?  Writing a <strong id=\"\">follow-up post</strong> is a great way to remind your readers about a <strong id=\"\">hot topic</strong> and point them back to the original article via a link.</p><h3 id=\"\"><strong id=\"\">Link Back to an Old Post</strong></h3><p>As you write new posts, keep in mind what articles might be relevant to your topic and link back to those <strong id=\"\">old blog posts.  </strong>I’ve talked about<strong id=\"\"> </strong><a href=\"http://activerain.com/blogsview/2323234/top-4-rules-for-using-video-on-your-website\" id=\"\"><strong id=\"\">bounce rate</strong></a><strong id=\"\"> </strong>in previous blogs.  Linking to other articles on your site is a tactic to help reduce your bounce rate and keep readers on your blog for a longer amount of time.  Plus the SEO benefits assist in page placement with search engines.</p><h3 id=\"\"><strong id=\"\">Go back and Optimize</strong></h3><p>When I first started blogging, SEO wasn’t at the top of my mind.  I didn’t know anything about keyword placement, title tags or <a href=\"http://codex.wordpress.org/Introduction_to_Blogging\" id=\"\">pretty permalinks</a> and why any of those mattered.  The good news is that you can still fix it.Go back through your original posts and bold or underline all of the relevant keywords.  Add links within your site to similar topics and if you have Wordpress, download the important plugin <a href=\"http://wordpress.org/extend/plugins/all-in-one-seo-pack/\" id=\"\"><strong id=\"\">All-in-one SEO Pack</strong></a> to do a lot of the heavy SEO lifting for you.Also make sure you’ve optimized your images with an image title and alt text that sufficiently describes the image and content of your article.<strong id=\"\"><em id=\"\">Warning:</em></strong> Don’t change the permalink if you want to maintain your page rank!  i.e. the url to your post</p><h3 id=\"\"><strong id=\"\">Spotlight Your Past Blogs </strong></h3><p>Put together a post that highlights previous articles that readers might have missed. Link to a select group of your top posts and watch them take on a whole new life!</p><h3 id=\"\"><strong id=\"\">Update Social Media</strong></h3><p>Social Media platforms such as <strong id=\"\">Facebook, Twitter </strong>and<strong id=\"\"> LinkedIn</strong> are great tools to Tweet out or re-post old blogs.   Just because the blog is old to you doesn’t mean readers won’t find it interesting.  Social media allows a blog to go viral so why stop at the first Tweet?  Get the word out and rotate through your old blogs for increased traffic to your site.How are you reviving old blog posts?  There are many fun ways to keep that blog in front of you readers – I’d love to hear yours!</p>",
      "yoast-seo-meta-description": "Are your old blog posts losing steam? Here's how to revive them and refresh the content, bringing them back to like.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/06/revive-blog-posts.png",
      "name": "How to Revive Old Blog Posts and Increase Reader Buzz",
      "wp-excerpt": "If you have been blogging for some time you undoubtedly have posts that you felt got less than their deserved attention.   While you were busy pouring your opinions, expertise and witty repartee into each article, crickets were heard chirping in the background.  So why not revive those old blog posts and bring them back to life?!",
      "yoast-reading-time": "3",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "How to Revive Old Blog Posts and Increase Reader Buzz",
      "slug": "how-to-revive-old-blog-posts-and-increase-reader-buzz",
      "updated-on": "2023-04-01T12:22:28.322Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:28.322Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822046c28f457c8e40837"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-05-27T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/64282204f540666b065d651b_Lessons-Learned-from-my-Girlfriends.jpeg\" alt=\"Lessons Learned from my Girlfriends\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p>I had the incredible fortune to spend two days in Chicago with an amazing group of women.  These women were led by a fearless leader, a gal whose \"can do \"spirit is infectious.  Karen Deis, the founder of <a href=\"http://mortgagegirlfriends.com/\" target=\"_blank\" id=\"\"><strong id=\"\">Mortgage Girlfriends</strong></a> is a pioneer in the world of <a href=\"http://en.wikipedia.org/wiki/New_media\" target=\"_blank\" id=\"\"><strong id=\"\">new media</strong></a> or <strong id=\"\">social marketing</strong>.After sifting through my piles of notes, I was left with a few key takeaways.  While none of them are earth shattering, they all bear repeating.</p><ol id=\"\"> \t<li id=\"\"><strong id=\"\">It's all About Them</strong> - Well, duhhhh!  We've always known that <em id=\"\">what the client wants, the client gets</em>.  However, with the dawn of <strong id=\"\">social media</strong> and the move away from <strong id=\"\">traditional media</strong>, we saw a shift from company centric (i.e. who <em id=\"\">we</em> are, what <em id=\"\">we</em> offer) to client focused (who <em id=\"\">they</em> are, what <em id=\"\">they </em>want. Now more than ever before, you must go the extra mile to get to know who your client is and what their specific needs are.  Without it - they're moving on to the next guy that will.</li> \t<li id=\"\"><strong id=\"\">Less is Not the New \"More\"</strong> - Understand that the mentality \"less is more\" does not apply in our industry.  Less is, well...just less.  Now more than ever your clients need to hear from you.  They need your expert opinion, your guidance and your consideration.  It's not good enough to take a back seat and watch the transaction go by.  Get involved and possibly gain a client for life and then some.</li> \t<li id=\"\"><strong id=\"\">Be the Local Expert</strong> - You have a tremendous opportunity to brand yourself through blogging, Facebook, Twitter and every other social media outlet as the <strong id=\"\">local real estate </strong>or<strong id=\"\"> mortgage expert</strong>.  Enough said.</li> \t<li id=\"\"><strong id=\"\">No Communication = No Business</strong> - Have you communicated with your client since their closing?  Do you have a database, a drip campaign or at least a reminder to make a follow up phone call?  And how about those leads?  Have you touched base with them via phone or email recently?  If you don't communicate, they don't remember you.  If they don't' remember you, you pass the business off to your competitor.</li></ol><p>Whatever you want to call it - <strong id=\"\">social marketing, social media</strong> or <strong id=\"\">new media</strong> it's really no different than the old days.  Figure out how to best communicate, retain and find clients and YOUR business wins!</p>",
      "yoast-seo-meta-description": "Lessons about business, life and your career. Figure out how to best communicate, retain and find clients and YOUR business wins!",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/05/Lessons-Learned-from-my-Girlfriends.jpg",
      "name": "Lessons Learned from my Girlfriends",
      "wp-excerpt": "I had the incredible fortune to spend two days in Chicago with an amazing group of women.  These women were led by a fearless leader, a gal whose \"can do \"spirit is infectious.  Karen Deis, the founder of Mortgage Girlfriends is a pioneer in the world of new media or social marketing.  After sifting through my piles of notes, I was left with a few key takeaways.  While none of them are earth shattering, they all bear repeating.",
      "yoast-reading-time": "2",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Lessons Learned from my Girlfriends",
      "wp-image-alt-text": "Lessons Learned from my Girlfriends",
      "slug": "lessons-learned-from-my-girlfriends",
      "updated-on": "2023-04-01T12:22:28.203Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:28.203Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282204f540663b8e5d651c"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-06-02T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p>There are a ton of free blog tools that can help with everything from keyword research to creating beautiful graphics for your blog.But how do you know which ones are best?The 10 free tools below are valuable to you as an online marketer, blogger or digital strategist. They'll make blogging easier and faster!</p><h1 id=\"\">10 FREE Tools to Make Blogging Easier</h1><h2 id=\"\">1.  <a href=\"http://evernote.com/\" target=\"_blank\" id=\"\">Evernote</a></h2><p>Have you ever found yourself surfing the web researching your next blog topic, only to find you needed a quick and easy way to capture that information?Evernote not only allows you to capture that info on your PC or Mac, but also sync it to your other devices, making the information accessible from wherever you are.I’ve used Evernote for years to organize and house anything from research material to a grocery list.There are a million ways to use it, and the more I play around with it, the more reasons I love this tool.</p><h2 id=\"\">2.  <a href=\"http://scribefire.com/\" target=\"_blank\" id=\"\">Scribefire</a></h2><p>Scribefire is a Firefox, Chrome, Opera &amp; Safari add-on (sorry IE users) that makes posting a breeze.You can access Scribefire directly from your browser and throw together a quick blog that you can easily post to your site.If you’re a serious blogger, this is a tool to check out!Side note: If you’re on a Mac, another option is <a href=\"http://www.hogbaysoftware.com/products/writeroom\" id=\"\">Writeroom</a>.</p><h2 id=\"\">3. Post Planner</h2><p>Oh how I love Post Planner!  Similar to Hootsuite, Post Planner allows you to find, plan, and post all content to Facebook and Twitter.With Post Planner, you can search Popular folders to find top performing content across the web.No more searching for that perfect post or tweet. Simply scroll through, check the star ratings for virality, and schedule the content.You can also search through the huge database of Status Ideas to help with your blog content promotion.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822030cb3c83b93828950_facebook-marketing-tips-increase-engagement-1100x823.png\" alt=\"top-blogging-tools-for-marketers\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h2 id=\"\">4.  <a href=\"http://www.flickr.com/creativecommons/\" target=\"_blank\" id=\"\">Flickr Images </a></h2><p>Flick Creative Commons is a way for bloggers to keep their backsides out of a sling.With creative commons, you can choose from different licensing options, rather than simply “borrowing” an online image.No one wants to find themselves on the wrong end of a copyright lawsuit!</p><h2 id=\"\">5. <a href=\"https://chrome.google.com/webstore/detail/feedly/hipbfijinpcgfogaopmgehiegacbhmob?hl=en\" target=\"_blank\" id=\"\">Feedly</a></h2><p>My husband asks how I keep up with as many blogs as I do, and all in less than 30 minutes per day.I tell him it’s simple – you just need a way to manage or aggregate all that information.I subscribe to over 200 blogs, and all show up in one place – Feedly!It takes the stress of tracking down blog ideas and keeping up with guideline changes completely off my shoulders!</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822030cb3c86c2382894e_best-blogging-tools.jpeg\" alt=\"best-blogging-tools\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h2 id=\"\">6.  <a href=\"http://www.google.com/alerts\" target=\"_blank\" id=\"\">Google Alerts</a></h2><p>Google Alerts are an easy way to monitor specific topics with a click of a button.I enter the topic I’m interested in, and Google scans the web for relevant information.Once I’ve created my search within this “set it and forget it” system, Google will send emails throughout the day with related content.I use this to monitor social media updates, industry events and local happenings.An added bonus: Monitor your brand on the web by adding your name to your Google Alerts.</p><h2 id=\"\">7.  <a href=\"http://www.linkwithin.com/learn\" id=\"\">LinkWithin</a></h2><p>This Wordpress plugin automatically displays links and thumbnail images to related posts within your blog.You can choose to show the links on your home page or single blog pages only.Don’t let dust collect on those past posts – link within your site!</p><h2 id=\"\">8. <a href=\"http://www.buzzsumo.com\" target=\"_blank\" id=\"\">BuzzSumo</a></h2><p>Not only can you research top performing content based on social shares, but with BuzzSumo, you can easily see what your competition is blogging aboutThis is a terrific research tool, and one I can't live without.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/642822030cb3c8991882894f_how-to-use-buzzsumo.png\" alt=\"how to use buzzsumo\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h2 id=\"\">9.  <a href=\"http://www.networkedblogs.com/\" target=\"_blank\" id=\"\">NetworkedBlogs</a></h2><p>If you have a blog and a Facebook account, than you need Networked Blogs.Promote your blog automatically by syndicating your feed to your page as soon as you post it.Networked Blogs make advertising your blog painless and trouble free.</p><h2 id=\"\">10.  <a href=\"http://animoto.com/\" target=\"_blank\" id=\"\">Animoto</a></h2><p>A super flexible online video editor that allows you to mix videos, images, music, text and effects to create standard or high-definition online videos.Check out a few of their <a href=\"http://animoto.com/sample-videos\" id=\"\">sample videos</a> to get a feel for what Animoto can do for you.Another option is <a href=\"http://www.stupeflix.com/\" target=\"_blank\" id=\"\">Stupeflix</a>Your first video is free. After that, their standard pricing model is designed for high-volume production, but plans are also available for less frequent use.</p><h3 id=\"\">Final Thoughts</h3><p>The bottom line:If you create content that captures the attention of your readers and motivates them to take action, blogging will become fun and rewarding.Hit the publish button, promote your blogs, and watch your words take flight.</p>",
      "yoast-seo-meta-description": "What's the best free blog tools to help you grow your blog? Here's the top 10 free blog tools so you can write better & rank higher on Google.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/06/free-tools-to-make-blogging-easier.jpg|https://rebekahradice.com/wp-content/uploads/2011/06/best-blogging-tools.jpg|https://rebekahradice.com/wp-content/uploads/2011/06/free-blog-tools-keyword-surfer.png",
      "name": "10 Free Tools to Make Blogging Easier",
      "wp-excerpt": "If you’re like me, there’s never enough time in a day.  We’re juggling everything from real estate to blogging to social media to database management.  Simply put, we wear a lot of hats. So any tool that can shave a few seconds off my to-do list is well worth looking into!\n\nI’ve put together a list of some of my favorite blogging tools that should make collecting information, syndicating your content and writing your blogs a whole lot easier!",
      "yoast-reading-time": "4",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "10 Free Blog Tools Every Blogger Needs to Use",
      "wp-image-alt-text": "free-tools-to-make-blogging-easier|best-blogging-tools|free-blog-tools-keyword-surfer",
      "slug": "10-free-tools-to-make-blogging-easier",
      "updated-on": "2023-04-01T12:22:28.157Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:28.157Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822040cb3c8211d828951"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-05-29T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p>If you’ve been hesitant to start <strong id=\"\">using video on your website or blog,  </strong>just check out <strong id=\"\">YouTube’s statistics</strong>:</p><ul id=\"\"> \t<li id=\"\">Over 2 billion videos are viewed every day</li> \t<li id=\"\">In 2010, there were over 700 billion video playbacks</li> \t<li id=\"\">100 million people watch video from their phone each day</li> \t<li id=\"\">4 million people shared a video with another social network last year</li></ul><p>As the second largest search engine, YouTube™ has found one effective way to drive traffic to their site: <strong id=\"\">video</strong>.Based on those numbers, it’s obvious that using video on your website can be extremely profitable.  When it’s used correctly, video can reduce your <a href=\"http://en.wikipedia.org/wiki/Bounce_rate\" id=\"\"><strong id=\"\">bounce rate</strong></a><strong id=\"\"> </strong>meaning people not only stick around longer but they view additional pages.  Used incorrectly, your video could chase your visitors away and keep them from coming back.By following these Top 4 Rules, implementing this new marketing strategy and <strong id=\"\">utilizing video effectively</strong> on your website should be a breeze!</p><h3 id=\"\"><strong id=\"\">Rule #1 -</strong> <strong id=\"\">Make it Look Professional</strong></h3><p>Have you ever watched a video that looked and sounded awful?  The camera was shaky, the sound was muffled and the color was off?  I know I have and rest assured that I wasn’t coming back to watch more!  The good news is for about $100 you can purchase a <strong id=\"\">high quality camera</strong> that will make you look and sound like a pro.There are also multiple <strong id=\"\">video editing software</strong> programs that have all the bells and whistles the pros use.  My personal favorite is <a href=\"http://www.techsmith.com/camtasia/?gclid=CK7R15GJjqkCFWUbQgodYxW3pA\" id=\"\"><strong id=\"\">Camtasia</strong></a> by Techsmith.  There is a learning curve though so be prepared to put some time in figuring out the system.Another great alternative is the creative suite of <a href=\"http://www.sonycreativesoftware.com/vegassoftware\" id=\"\"><strong id=\"\">Vegas products from Sony</strong></a>.  Vegas Movie Studio not only offers a powerful video editor but you can also select from hundreds of professional 2D and 3D video effects, titles, and filters to enhance your video. Plus you can upload directly to YouTube™.</p><h3 id=\"\"><strong id=\"\">Rule #2 – Don’t Autostart Your Video</strong></h3><p>Nothing is more irritating than visiting a website with a video on auto play.  Consider the fact that your visitors may be checking out your site from the office and don’t want everyone to hear what they’re viewing.  Give your visitors the choice to turn down their speakers and view it at their leisure rather than chasing them away.  It’s often easier to click out of a site than fumble for the speaker volume.</p><h3 id=\"\"><strong id=\"\">Rule #3 – Be Prepared</strong></h3><p>Once you’ve written your script, practice out loud.  I like to stand in front of a mirror or talk it out to my husband to get comfortable rather than just reading it word for word.  If you’re practicing in front of someone, make sure they can offer constructive feedback.  You also need to make sure that you are speaking to your audience and not over their head.  For example:  If I’m talking about why pre-approval is so important, I always ask whoever I’m practicing in front of – “if you were a first time homebuyer, would this make sense to you?”  You will quickly turn off your audience if they can’t understand your industry lingo.If you do need to read the script, then use a free tool like this online <a href=\"http://www.cueprompter.com/\" id=\"\"><strong id=\"\">teleprompter</strong></a>.</p><h3 id=\"\"><strong id=\"\">Rule #4 - Test, Track &amp; Analyze Your Results</strong></h3><p>Don’t just throw a video on your website without a way to analyze its performance.  Simply adding video to your website isn’t going to bring traffic in droves.  First you need to test it out.  Ask your visitors, friends, and family to give you their opinions and then do split testing<strong id=\"\">.</strong>With <strong id=\"\">split testing or A/B testing</strong>, you determine traffic differences between two or more web pages and gauge which has the best conversion rate.  Once you’ve added your video to a page, you need to figure out if there is an <strong id=\"\">increase in conversions</strong>. There’s no way to know if your video message is helping or hurting your website without a way to measure your results both before and after you’ve added it.After all – it’s not just a website we want, it’s a website that actually converts visitors into clients!</p>",
      "yoast-seo-meta-description": "Hesitant to start using video on your website or blog? Here are 4 rules to help you navigate and overcome your concerns.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/05/video-on-website.png",
      "name": "Top 4 Rules for Using Video on Your Website",
      "wp-excerpt": "It’s obvious that using video on your website can be extremely profitable.  When it’s used correctly, video can reduce your bounce rate meaning people not only stick around longer but they view additional pages.  Used incorrectly, your video could chase your visitors away and keep them from coming back.",
      "yoast-reading-time": "3",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Top 4 Rules for Using Video on Your Website",
      "wp-image-alt-text": "video on website",
      "slug": "top-4-rules-for-using-video-on-your-website",
      "updated-on": "2023-04-01T12:22:27.744Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:27.744Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "6428220307c9bb4f6f96cf5c"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-05-26T00:00:00.000Z",
      "_draft": false,
      "wp-image-url": null,
      "wp-image-alt-text": null,
      "wp-content": "<p>In my first article, <a href=\"https://rebekahradice.com/6-ways-to-drive-traffic-to-your-website-or-blog/\" target=\"_blank\" id=\"\"><strong id=\"\">6 Ways to Drive Traffic to Your Website or Blog</strong></a>, we explored unique ways to find new subscribers and ultimately, new buyers and sellers.The idea behind each of these is to engage your audience, brand your blog and boost your sales.  So choose one or try them all.  I guarantee that if you work your blog, it will bring you the results you're looking for!</p><h3 id=\"\"><strong id=\"\">Write articles for other blogs and services </strong></h3><p>I currently write for 4 different blogs; all of them offering untapped potential.  I now have the opportunity to reach a broader audience and also link back to my site with their permission.  By linking related posts, you have the chance to increase site traffic through a whole new audience.</p><h3 id=\"\"><strong id=\"\">Issue a Press Release</strong></h3><p>Promote your website or blog by issuing a press release including who you are, what you offer and why readers should flock to your site for up to the minute information.  A press release can improve visibility, increase SEO and ultimately drive more business to you!A couple of options for <strong id=\"\">automating your press release distribution</strong>:</p><ul id=\"\"> \t<li id=\"\"><a href=\"http://www.businesswire.com/portal/site/home/my-business-wire/\" id=\"\">BusinessWire</a></li> \t<li id=\"\"><a href=\"http://www.prweb.com/\" id=\"\">PRWeb</a></li></ul><h3 id=\"\"><strong id=\"\">Answer Questions </strong></h3><p>When you answer questions within the blogosphere, you’re establishing yourself as the expert within your field.  The more you answer, the more recognizable you become.  In any forum or on any blog, you will have the option to add your own website so that when your answer is viewed the reader is able to locate you on the web.   <strong id=\"\"> </strong><em id=\"\">Important Note:</em>  DON’T confuse answering questions or commenting with spam.  No one likes a spammer and in fact, spamming has the exact opposite effect as you’re trying to gain.  Make sure your answers are concise and beneficial to the reader.</p><ul id=\"\"> \t<li id=\"\"><a href=\"https://www.facebook.com/questions/\" id=\"\">Facebook Questions</a></li> \t<li id=\"\"><a href=\"http://answers.yahoo.com/dir/index;_ylt=AsabCvN1jDbXica5LEvUTkTj1KIX;_ylv=3?link=open\" id=\"\">Yahoo Answers</a></li> \t<li id=\"\"><a href=\"http://www.allexperts.com/\" id=\"\">AllExperts</a></li></ul><h3 id=\"\"><strong id=\"\">Get Found with Technorati </strong></h3><p>I briefly talked about <a href=\"http://technorati.com/\" id=\"\">Technorati</a> in my last article, but wanted to expand on how to get the most out of this site.  For starters, think of Technorati as a giant yellow pages for blogs.  It’s a <strong id=\"\">blog search engine, </strong>but also an <strong id=\"\">authority builder</strong>.  It will measure your websites authority or ranking amongst other blogs.  So how can you best use Technorati?</p><ul id=\"\"> \t<li id=\"\">Claim Your Blog –</li></ul><ol id=\"\"> \t<li id=\"\">Sign up for a free <a href=\"http://technorati.com/account/signup/\" id=\"\">Technorati</a> account</li> \t<li id=\"\">Fully complete your profile – this is always an important step for any website or social media account</li> \t<li id=\"\">Claim your blog by adding the url and confirming that you own that site</li></ol><ul id=\"\"> \t<li id=\"\">Tag It! – <strong id=\"\">Technorati tags</strong> allow you to tag each key word in your post. The more you tag, the better your chances are to get found.</li></ul><p>Side note:  If you’re using <em id=\"\">Wordpress</em>, there is a plugin that will make your life infinitely easier.  It’s called <a href=\"http://wordpress.org/extend/plugins/simple-tags/\" id=\"\"><strong id=\"\">SimpleTags</strong></a> and assists in creating custom tags for each post.</p><ul id=\"\"> \t<li id=\"\">Pint It – My favorite tool to notify multiple sites at once is <a href=\"http://pingomatic.com/\" id=\"\"><strong id=\"\">Ping-o-matic</strong></a></li><li> \tCreate a sense of reciprocity amongst your peers \t</li><li id=\"\">Build loyalty amongst your readers</li><li> \t</li><li id=\"\">Fire up the phones with new leads</li></ul><h3 id=\"\"><strong id=\"\">Share an insider secret</strong></h3><p>Think about the amount of information you’ve gathered about the real estate or mortgage industry over the years.  What one how-to, what not to-do or success secret could you giveaway that would:</p><ul id=\"\"> \t<li id=\"\">Create a sense of reciprocity amongst your peers</li> \t<li id=\"\">Build loyalty amongst your readers</li> \t<li id=\"\">Fire up the phones with new leads</li></ul><p><strong id=\"\">Remember: </strong>Content marketing and search engine optimization work hand-in-hand with each other and both take time.  Work on them simultaneously and give yourself a timeline and measurable goals.  Without those it's easy to get derailed and lose site of why you started blogging in the first place.</p>",
      "yoast-seo-meta-description": "Want to improve and increase website and blog traffic? Take a look at these simple tactics to get going fast!",
      "name": "Simple Steps to Get Your Website Found NOW!",
      "wp-excerpt": "In my first article, 6 Ways to Drive Traffic to Your Website or Blog, we explored unique ways to find new subscribers and ultimately, new buyers and sellers.  The idea behind each of these is to engage your audience, brand your blog and boost your sales.  So choose one or try them all.  I guarantee that if you work your blog, it will bring you the results you're looking for!",
      "yoast-reading-time": "3",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Simple Steps to Get Your Website Found NOW!",
      "slug": "simple-steps-to-get-your-website-found-now",
      "updated-on": "2023-04-01T12:22:27.667Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:27.667Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282203bb87cb194624ae04"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-06-03T00:00:00.000Z",
      "_draft": false,
      "wp-image-alt-text": null,
      "wp-content": "<p>I recently spent time with a small group of amazing women.  We had come together for a <strong id=\"\">mortgage industry mastermind</strong> to discuss best practices, marketing strategies and everything social media.During our time together we chatted about our personal business and the day-to-day <strong id=\"\">struggles</strong> we were all facing.  What I heard were echoes of the stories being told every day within our business and the questions we’ve been faced with as the <strong id=\"\">challenges</strong> just seem to pile up.The stories were gut wrenching and the overall fear was that their business would never be the same.They posed questions like:</p><ul id=\"\"> \t<li id=\"\">How do you get out of bed every morning when you hate what your job has become?</li> \t<li id=\"\">How do you walk into the office with a smile on your face when your whole world is crumbling?</li> \t<li id=\"\">How can you see a light at the end of the tunnel when the darkness consumes you?</li> \t<li id=\"\">How do you find hope when the day to day battles leave you exhausted?</li> \t<li id=\"\">How do you face tomorrow when the pain of yesterday has left you battered and bleeding?</li></ul><p>Every one of those questions tears at my heart because of the raw emotion behind them.  I have been there within the last couple of years and can honestly say I’m blessed to be on the other side.  Having seen the effects of those questions makes me want to reach out and offer all the support and encouragement I can.So how can we help our fellow sufferers pull through an otherwise devastating time within <strong id=\"\">the real estate and mortgage industry</strong>?<strong id=\"\">Actively Listen</strong> – If they’re talking, you need to stop what you’re doing and listen.  They might be the most private person you know, so for them to talk means they’ve chosen you as a confidant.<strong id=\"\">Look for the signs</strong> – Has your friend changed their daily routine?  Have patterns in their life changed and new, less attractive ones emerged?  Are they moody, irritable and downright unpleasant to be around?  Don’t make the mistake of shrugging that off as “Mary is just having a bad day.”<strong id=\"\">Be a barometer of truth</strong> – When we’re deeply enmeshed in our struggles, finding the “truth” between what we <em id=\"\">feel </em>and what the reality is can be next to impossible.  Be the friend that not only offers support but a mirror of truth.  Just listening isn’t always enough.  There might be a moment where offering feedback and a different perspective can open up new possibilities.And finally, while we’re all acutely aware that life within our industry will never be the same, I pose this question to you:Does it really matter?  As the saying goes, can’t we choose to make lemonade with the lemons we’ve been handed?If it’s true that we have the ability to change our lives by simply changing our minds then isn’t it about time we got started?<strong id=\"\"><em id=\"\">Will you get started today?</em></strong></p>",
      "yoast-seo-meta-description": "Struggling to make sense of the property market? Learn the Mortgage industry's best practices, marketing strategies and everything social media.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/06/frying-pan.png",
      "name": "Out of the Frying Pan and Into the Fire",
      "wp-excerpt": "During our time together we chatted about our personal business and the day-to-day struggles we were all facing.  What I heard were echoes of the stories being told every day within our business and the questions we’ve been faced with as the challenges just seem to pile up.",
      "yoast-reading-time": "3",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Out of the Frying Pan and Into the Fire",
      "slug": "out-of-the-frying-pan-and-into-the-fire",
      "updated-on": "2023-04-01T12:22:27.641Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:27.641Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282203597397dbb8926e8c"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-05-18T00:00:00.000Z",
      "_draft": false,
      "wp-image-alt-text": null,
      "wp-content": "<figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/64282202bde7a7f73083ca90_ar130343362338729.jpeg\" alt=\"Success in Business\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p><strong id=\"\"><em id=\"\">There is only one thing that makes a dream impossible to achieve: the fear of failure...</em></strong>I was overwhelmed by this quote today.  We see failure all around us - friends walking away from their business, people working 2, 3 even 4 jobs, neighbors filing bankruptcy, peers going into foreclosure, the list goes on.  All the while, the media pumps out dire real estate news, causing panic in anyone who has ever thought of purchasing a home.  Is there any wonder why we're frozen by fear and are so afraid we're going to fail?<strong id=\"\"><em id=\"\">What You Focus on Expands</em></strong>Would you prefer to never try and live a safe, comfortable...albeit fearful life or would you rather spread your wings, face your fear and soar your business to heights you never thought possible?  Seems like an easy answer but complacency is simpler to accept than you think.<strong id=\"\">My <em id=\"\">MUST DO IT NOW</em> List  </strong></p><ul id=\"\"> \t<li id=\"\">Stop trying to compare yourself to your competition.  You are YOU, not your competition. Do what <strong id=\"\">YOU</strong> do best.  Find your focus, find your niche, and get a grip on what makes <strong id=\"\">YOU </strong>special.</li> \t<li id=\"\">Stop dwelling on the past.  Who cares that you made $300k in 2005?  You'd love to be making a third of that now.  Life isn't about what was, it's about what can be.  Focus on that.</li> \t<li id=\"\">Stop complaining.  Life is hard, suck it up.  Get out of your house and get out of your own way.  Once you change your mindset and determine that you can succeed, imagine the possibilities!</li> \t<li id=\"\">Give up on the thought that YOU CAN'T.  YES you can!  Be the best in your City, your State, your neighborhood, your niche, your community.  You can be the best version of <strong id=\"\">YOU</strong> that you determine to be.  <strong id=\"\">IT REALLY IS THAT SIMPLE.</strong></li> \t<li id=\"\">Figure it out.  What's holding you back from getting from where you are to where you want to be?  Have you considered the consequences?  What are you missing out on by not taking that leap of faith?</li></ul><p><strong id=\"\">The bottom line:</strong>  No matter what shape, form or smell your Fear comes in, it's all the same:  <strong id=\"\">Debilitating</strong>.I challenge you (and me) to start fresh tomorrow.<strong id=\"\">Smell the Fear.  Overcome the Failure. </strong><a href=\"http://rebekahradiceblog.com/post/2258327/conquering-the-big-f-\" target=\"_blank\" id=\"\"><em id=\"\">Conquering the BIG \"F\"</em></a> was written by Rebekah Radice.</p>",
      "yoast-seo-meta-description": "Would you prefer to never try and live a safe, comfortable...albeit fearful life or would you rather spread your wings, face your fear and soar your business to heights you never thought possible?",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/05/conquering-big-f.png",
      "name": "Conquering the BIG \"F\"",
      "wp-excerpt": "Would you prefer to never try and live a safe, comfortable...albeit fearful life or would you rather spread your wings, face your fear and soar your business to heights you never thought possible?",
      "yoast-reading-time": "2",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Conquering the BIG \"F\"",
      "slug": "conquering-the-big-f",
      "updated-on": "2023-04-01T12:22:27.031Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:27.031Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282203bde7a7860783ca91"
    },
    {
      "_archived": false,
      "wp-published-date": "2012-09-27T00:00:00.000Z",
      "_draft": false,
      "wp-excerpt": null,
      "wp-content": "<p>Writing great blog content on a consistent basis can feel like an arduous task.Whether you are fighting writers block or simply eager to improve your content; writing a blog post brimming with creativity does not always come easy.<a href=\"https://rebekahradice.com/4-tips-to-increase-your-blog-subscribers/\" target=\"_blank\" id=\"\">Writing a great post</a> that drives traffic to your blog and encourages shares takes determination and skill.It also requires a fearless approach when putting both your message and your passion into words that resonate.The unfortunate truth with many blogs is that no matter how brilliant, witty, and valuable the content is, it misses the mark when offering the readers what they truly want.The good news is this: writing high quality content that keeps your readers engaged and hungry for more is a skill any blogger can master.The key is to find your rhythm, tone and voice.</p><h1 id=\"\">7 Tips to Great Blog Content</h1><h2 id=\"\">1. Do Your Homework</h2><p>Logic says don't start hiking a 14,000 foot mountain without a little preparation. Likewise, writing a blog post without investigating your topic is a recipe for disaster.</p><ul id=\"\"> \t<li id=\"\">Google It! – Google has loads of tools for bloggers from your basic <a href=\"http://google.com/\" target=\"_blank\" id=\"\">Google search</a> to the <a href=\"http://www.googlekeywordtool.com/\" target=\"_blank\" id=\"\">Google Keyword Toolbox</a> – a treasure trove of gadgets that will speak to your blogger soul!</li> \t<li id=\"\">Research keywords – Keyword research is incredibly important to the search engine optimization of your site. With keyword research you determine what your clients are searching for and what terms will receive the most Google juice. There are many options for keyword research, the most popular being <a href=\"https://adwords.google.com/o/Targeting/Explorer?__u=1000000000&__c=1000000000&ideaRequestType=KEYWORD_IDEAS#search.none\" target=\"_blank\" id=\"\">Google’s Keyword Tool</a>.</li> \t<li id=\"\">Link It - Substantiate your findings with links to credible articles.</li></ul><h2 id=\"\">2. Know Your Niche</h2><p>Provide well thought out, fact supported tips and advice for your readers. Before you begin to craft content for your blog, it is best to:</p><ul id=\"\"> \t<li id=\"\">Determine the \"WHY\" behind your blog</li> \t<li id=\"\">Understand the needs of your target audience are and how you will provide a benefit or solution</li> \t<li id=\"\">Identify their motivation and what persuades them to take action</li></ul><p>Your next step is to ask yourself:</p><ul id=\"\"> \t<li id=\"\">Have I figured out what my niche is and whether there’s a market for it?</li> \t<li id=\"\">Can I make money with this niche?</li> \t<li id=\"\">Can I provide quality content on a continual basis?</li> \t<li id=\"\">Have I researched my competition? What are they doing well and what can I do better?</li></ul><h2 id=\"\">3. Compel and Connect</h2><p>A great blog post excites the audience, arouses curiosity and creates a compelling reason to come back for more.Connect with your community by drawing them into the conversation.Encourage readers to contribute and allow them to connect with you across multiple social channels.Make it easy for readers to get involved, be heard and share their knowledge with other blog readers.</p><h2 id=\"\">4. Update Your Blog</h2><p>Writing a great blog post includes tuning up your blog. Make it a part of your routine to regularly check for updates to your blog platform. Neglecting this simple step could slow down your blog or worse, leave you vulnerable to security issues.Also make sure that your plugins are updated and that your categories are customized and easy for your readers to navigate.</p><h2 id=\"\">5. Take a Stand</h2><p>There’s nothing worse than reading a blog with a “middle of the road” stance. Get passionate about your topic and be willing to take the opposing side.Are you writing about a hot topic but fear you’ll be crucified due to your position? Well get over it!Readers gravitate towards blogs that have a voice and a tone. How can your blog have either one if you never spell out who you are and what you believe in?</p><h2 id=\"\">6. Be Authentic</h2><p>If you are open and honest with your readers, it is very easy to take a stand about what you believe.Authenticity goes a long way to building loyalty.If your readers do not feel a connection to you, then quite simply, they are not going to buy what you are selling. Be bold, be brave, be YOU!</p><h2 id=\"\">7. Have Fun</h2><p>There is no use blogging if you are not enjoying it.Get passionate about your craft and let your readers feel it.Engagement and feedback will add fuel to your creative fire and keep you focused and excited about your blog!</p>",
      "yoast-seo-meta-description": "Writing a blog post that drives traffic and shares requires compelling content. Keep your readers engaged and hungry for more by mastering these seven skills!",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2012/09/How-to-Write-Blog-Content-that-Drives-Traffic-and-Shares.jpg|https://rebekahradice.com/wp-content/uploads/2012/04/7-Tips-to-Writing-a-Great-Blog-Post.jpg",
      "name": "How to Write Blog Content that Drives Traffic and Shares",
      "yoast-reading-time": "4",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "How to Write Blog Content that Drives Traffic and Shares",
      "wp-image-alt-text": "How to Write Blog Content that Drives Traffic and Shares|7 Tips to Writing a Great Blog Post",
      "slug": "how-to-write-blog-content-that-drives-traffic-and-shares",
      "updated-on": "2023-04-01T12:22:27.030Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:27.030Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822035c4c4c613f40fbe9"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-05-23T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p>While I’ve done quite a bit of research on this subject, I by no means consider myself an expert.  I am simply a blogger with a BIG appetite for anything <strong id=\"\">SEO </strong>and<strong id=\"\"> Google Page Rank</strong> definitely falls in line with all of my <strong id=\"\">SEO efforts</strong>.   So I set out to understand what the term means and how it impacts the “<strong id=\"\">search ability</strong>” of my website.</p><h3 id=\"\"><strong id=\"\">What is Page Rank?</strong></h3><p>With Page Rank your website or web page is given a score from 1 to 10 with 10 being the best.  Those numbers are basically a way for Search Engines to identify the most relevant content based on your search.</p><h3 id=\"\"><strong id=\"\">Who Cares About Page Rank?</strong></h3><p>Here’s what I’ve found:  In the <a href=\"http://en.wikipedia.org/wiki/Search_engine_optimization\" id=\"\"><strong id=\"\">Search Engine Optimization</strong></a> (SEO) community, there are two teams with completely opposed views.  The first team is firm believers in PageRank and actively works to add links back to their website and pages.  They spend quite a bit of time laboring to <strong id=\"\">link back to their website</strong> from authority sites or ones with rather high <strong id=\"\">PageRank</strong>. The opposing side does not agree with this method.  They instead encourage bloggers to ignore PageRank completely and instead focus on building a solid &amp; fully <a href=\"http://en.wikipedia.org/wiki/Search_engine_optimization_methods\" id=\"\"><strong id=\"\">optimized website</strong></a> with great content.So here’s my take.  While it’s never a bad idea to stay on top of your <strong id=\"\">Google PageRank</strong>, the unsurpassed superstar of SEO &amp; Page Rank is still content.  Readers continue to flock to a well-designed, eye pleasing and excellently written website and blog.</p><h3 id=\"\"><strong id=\"\">Want to Check Your Website Page Rank?</strong></h3><p>Here are two options that I found work well:<a href=\"http://www.prchecker.info/\" id=\"\">PrChecker</a><a href=\"http://www.googlerankings.com/prindex.php\" id=\"\">Google Rankings</a>Both are free and are as simple as adding your website url and pressing submit!</p>",
      "yoast-seo-meta-description": "With Page Rank your website or web page is given a score from 1 to 10 with 10 being the best. What can I do to get Page Rank?",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/05/google-page-rank.png",
      "name": "What Does My Google Page Rank Mean?",
      "wp-excerpt": "With Page Rank your website or web page is given a score from 1 to 10 with 10 being the best.  Those numbers are basically a way for Search Engines to identify the most relevant content based on your search.  So why should I care and what dp I dp tp get it?",
      "yoast-reading-time": "2",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "What Does My Google Page Rank Mean?",
      "wp-image-alt-text": "google page rank",
      "slug": "what-does-my-google-page-rank-mean",
      "updated-on": "2023-04-01T12:22:27.013Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:27.013Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822032b8b8c9964474091"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-05-20T00:00:00.000Z",
      "_draft": false,
      "wp-image-url": null,
      "wp-image-alt-text": null,
      "wp-content": "<p>I have a confession to make.  Want to hear it?It’s a little shameful that I could get so caught up in this addiction, but it seems to have overtaken my senses.I find that I wake up in the morning craving it.  I can’t get going without it and won’t let a day go by deprived of it. What’s my BIG secret?I’m <strong id=\"\">addicted to coffee</strong>.  And not just any run-of-the-mill coffee.  The good stuff.  The kind of coffee that makes you run, not walk to the nearest <strong id=\"\">coffee shop</strong>.The problem I’ve had is finding the perfect combination:  a great <strong id=\"\">cup of coffee </strong>with a peaceful and enjoyable atmosphere where I can sit and sip.That's where La Colombe in Los Angeles comes in! I think it's the best Los Angeles coffee shop in a sea of choices.</p><h2 id=\"\">The Best Los Angeles Coffee Shop</h2><p>That perfect cup of coffee includes the perfect coffee space.I love to plop myself down in a comfy chair and drink my Americano in a space that will allow me to focus on getting some work done.Unfortunately, I have found that most coffee shops are more conducive to the “get in and get out” type of traffic and can be a challenge for someone needing a quiet, more intimate workspace.Lucky me to have finally found just the location! So, if you find yourself in Los Angeles and you're:</p><ol id=\"\"> \t<li id=\"\">Addicted to a <strong id=\"\">great cup of coffee</strong> and</li> \t<li id=\"\">In need of an occasional change of scenery</li> \t<li id=\"\">Work remotely and need a spot with stable WiFi</li></ol><p>La Colombe can meet your needs whether you want to chat with a friend or hop on your laptop.</p><h2 id=\"\">Grab a Perfect Cup of Coffee</h2><p>Enjoy the warmth of any of their locations, sit down with your laptop, and get some work done while enjoying a hot or iced coffee.Whatever your reason, be it<strong id=\"\"> coffee </strong>or conversation – this will quickly become your new local coffee house favorite!</p>",
      "yoast-seo-meta-description": "Looking for a perfect cup of coffee to work remotely or from home? This is it! La Colombe is the best Los Angeles coffee shop you can't miss!",
      "name": "My Caffeine Confession",
      "wp-excerpt": "I have a confession to make.  Want to hear it?  It’s a little shameful that I could get so caught up in this addiction but it seems to have overtaken my senses.  I find that I wake up in the morning craving it.",
      "yoast-reading-time": "2",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "My Caffeine Confession",
      "slug": "my-caffeine-confession",
      "updated-on": "2023-04-01T12:22:26.728Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:26.728Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822022a7f28dc5c50cb77"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-05-21T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p><strong id=\"\">Working Harder Doesn’t Make You Smarter</strong>I see it every day.  Friends and co-workers running from one appointment to the next, trying to cram as much as they possibly can into their day:Meet a buyer, pick up a sign, make 10 prospect calls before noon, create a new marketing campaign, post to Facebook fan page and the list goes on and on.  But are we really getting ahead or just <strong id=\"\">working harder</strong>?I used to believe that I could <strong id=\"\">multi task </strong>myself through the day.  I was able to juggle multiple things at once, seamlessly moving from a client call to strategizing with employees on our next event.  But times have changed.  With the birth of social media, the barrage of email hitting our inbox and the increased needs of our clients, are we able to continue at this rapid pace?I don’t think so.  I think those of us driving our lives at such a reckless speed (and believe me – I am the WORST offender) are all on the verge of massive burnout.We read books on <strong id=\"\">working smarter, not harder</strong> and how to <strong id=\"\">maximize our work week</strong>, making the most out of every moment.  The problem with the “being everything to everyone” theory is threefold.</p><ol id=\"\"> \t<li id=\"\">We neglect us</li> \t<li id=\"\">We neglect our family</li> \t<li id=\"\">We wind up feeling worthless and frustrated because we’re not doing any one thing well</li></ol><p><strong id=\"\">How do find balance in your work and personal life?Step away from the computer</strong> – We are so tied to our computers these days; I often wonder what we did without them.  Oh wait, I do remember.  We used to sit in the backyard, barbecuing with friends and enjoying the moment.  We didn’t worry about checking our smart phones every 5 minutes just in case we were needed to avert a crisis.Unplug from technology and re-engage with life.  I promise you – it will still be there when you get back.<strong id=\"\">Listen to your body</strong> - I spent time at my massage therapist this week (something I hadn’t done in months) because of ongoing pain in my neck and back. In fact, it had become so pronounced that I found myself frequently massaging my own shoulder.  It was when I saw this picture from a speaking event in Chicago last week that I realized I had a big problem.It was no surprise when my masseuse said to me – “the stress you’re putting on yourself is doing major damage to your body.  You are holding in the stress and when you do that, your body has to find a way to deal with it.” So what was mine doing?  Creating knots in my muscles that even an NFL linebacker with the strength of two 800 pound gorillas couldn’t work out.<strong id=\"\">Working Harder Doesn’t Make You Smarter – </strong>Working long hours doesn’t equal greater productivity.  Working long hours just means you tried to force too many things into one day.  It can also mean you’re not focusing on any one task and completing it.  That results in frustration spawned by a feeling of incompleteness.<strong id=\"\">My Challenge to You</strong>Try focusing on one task and complete it before you move on to the next.  When you start to multi task, force yourself to stop.  Take the challenge and stick with it for one week and I guarantee you will find that those feelings of working harder, not smarter begin to slip away.You’ll feel refreshed, engaged and productive!</p>",
      "yoast-seo-meta-description": "How do find balance in your work and personal life? Here's how you can work smart, feel refreshed, engaged and productive.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/05/work-smart.png",
      "name": "Working Harder Doesn’t Make You Smarter",
      "wp-excerpt": "I used to believe that I could multi task myself through the day.  I was able to juggle multiple things at once, seamlessly moving from a client call to strategizing with employees on our next event.  But times have changed.  With the birth of social media, the barrage of email hitting our inbox and the increased needs of our clients, are we able to continue at this rapid pace?",
      "yoast-reading-time": "3",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Working Harder Doesn’t Make You Smarter",
      "wp-image-alt-text": "work smart",
      "slug": "working-harder-doesn-e2-80-99t-make-you-smarter",
      "updated-on": "2023-04-01T12:22:26.659Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:26.659Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282202a53a599583b36870"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-05-19T00:00:00.000Z",
      "_draft": false,
      "wp-image-url": null,
      "wp-image-alt-text": null,
      "wp-content": "<p>A Quick Response code, or QR code for short, has the ability to create outstanding results within your real estate marketing.This little piece of digital code can easily be scanned and read with the camera on your smartphone.With QR codes, you can embed anything from a signature to a website, a promotion, or even a video.So, how do you get started? Here's 5 creative ways to use QR codes in your real estate marketing!</p><h1 id=\"\">5 Creative Ways to Use QR Codes in Real Estate Marketing</h1><h2 id=\"\">1. Offer Exclusive Content</h2><p>Think about all of the articles you've written over the years and the fact that your content is much-needed information for buyers and sellers.  So why not take your blogs and turn them into free e-books?Use this information to increase Facebook Likes on your Fan page, offer it as an email opt-in on your website, and tweet about it daily to get your information viral!</p><h2 id=\"\">2. Promote Facebook or Twitter</h2><p>Create a link to a mobile-friendly <a href=\"http://blog.hubspot.com/blog/tabid/6307/bid/7177/What-Is-a-Landing-Page-and-Why-Should-You-Care.aspx\" id=\"\">landing page</a> with a Facebook-like button or send them to your Twitter page for more information.</p><h2 id=\"\">3. Promote Your Listings</h2><p>Instantly connect prospects to information about your listings without typing the long URL or texting. Prospects can simply snap a picture of the property QR code with their mobile phone and instantly download or access the online property information.</p><h2 id=\"\">4. Share Longer-Form Content Easily</h2><p>Have you ever had a lot to say but didn’t know where to put it?  Now you do!  Each QR code or image can encode up to 7,000 alphanumeric characters.  That’s a lot of words all in one small location!Add contact information to your Website, Facebook, Twitter, Linkedin, and other Social Media Sites</p><h2 id=\"\">5. Promotional Items &amp; Business Card</h2><p>Put your QR code on every piece of marketing material you create.  This means flyers, single property website stickers, giveaways such as mugs or t-shirts, and your business cards.</p><h3 id=\"\">Over to you...</h3><p>One thing is certain - the sky is the limit when you think of the creative ways you can use QR codes as a content marketing tool.How will you get started today by using them in a fun and unique way to advertise your business?</p><h3 id=\"\">List of great FREE QR Code resources:</h3><ul id=\"\"> \t<li id=\"\"><a href=\"http://qrcode.kaywa.com/\" id=\"\">Kaywa QR-Code Generator</a></li> \t<li id=\"\"><a href=\"http://reader.kaywa.com/\" id=\"\">Kaywa Code Reader</a></li> \t<li id=\"\"><a href=\"http://www.beqrious.com/generator\" id=\"\">BeQRious Code Generator</a></li> \t<li id=\"\"><a href=\"http://www.androidzoom.com/android_applications/shopping/barcode-scanner_clh.html\" id=\"\">Barcode Scanner – Android Phone QR Code Reader</a></li> \t<li id=\"\"><a href=\"http://socialwayne.com/2010/08/30/code-reader-iphone-apps/\" id=\"\">Top 10 iPhone QR Code Readers</a></li></ul>",
      "yoast-seo-meta-description": "What's a QR code and how do you get started? Here's 5 creative ways to use QR codes in real estate marketing!",
      "name": "5 Creative Ways to Use QR Codes in Real Estate Marketing",
      "wp-excerpt": "This little piece of digital code can easily be scanned and read with the camera on your smart phone.  With QR codes you can embed anything from a signature to a website, a promotion or even a video.",
      "yoast-reading-time": "2",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "5 Creative Ways to Use QR Codes in Real Estate Marketing",
      "slug": "5-creative-ways-to-use-qr-codes-in-real-estate-marketing",
      "updated-on": "2023-04-01T12:22:26.361Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:26.361Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282202f9d51a7914811c83"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-05-18T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p id=\"\"><strong id=\"\">The Naked Truth | Facing Your Blogging Fears</strong></p><p>I relate the <strong id=\"\">fear of blogging</strong> to a crazy dream I have every now and then.  In it I find myself standing naked in front of an audience.  How I came to speak in front of a large audience without knowing I had forgotten to get dressed is neither here nor there.  The point is that for me, the fear of blogging and the thought of the nightmare of standing naked before a crowd leaves me feeling exposed and vulnerable.  It can, obviously, be a complete show stopper.Finding the freedom within ourselves to write “authentically” is not something that comes naturally to all bloggers.  Whether it’s the fear of rejection or the fear of creating a “situation” (as my mother used to call it) can be debilitating.  But I believe that social media and blogging is all about being true to who you are, and the only way to convey that is through <strong id=\"\">authentic writing</strong>.<strong id=\"\">Blogging authentically</strong> is about knowing who you are as a writer.  How do you feel about a certain subject?  Would you take a stand one way or the other, and if so, are you willing to write about how you truly feel?  For many, being a bit controversial or putting our neck on the line for something we firmly believe in can be intimidating. What if no one agrees and hates my blog?  Or worse yet, what if no one cares or even comments?   Do you really care?  Your opinion is exactly that – your opinion.  OWN IT.  People will relate to you being true to yourself and those that don’t – they have to be true to themselves.  It probably means that they weren’t your target audience anyway.So how do you overcome your irrational <strong id=\"\">fear of blogging</strong>?  Just like anything else, you need to understand it.  Give yourself some time to really analyze what it is you’re afraid of.Face those fears by putting pen to paper.  Start with a simple blog about who you are, what you do for a living, where you live and why you’re blogging.  Is it for fun, for business or a little bit of both?  In this article I encourage you to have some fun.  If you’re funny, then show some humor.  If you’re serious about life, then convey that through your writing.  Whether it’s through a silly anecdote or a relatable true story, it’s that side of you that will engage your audience.The most important part is that you dive in and get started.  So pick a topic, grab and pen and get into the conversation!</p>",
      "yoast-seo-meta-description": "Finding the freedom within ourselves to write is not something that comes naturally to all bloggers. Here's how to overcome the fear of blogging and how to write authentically.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/05/blogging-fear.png",
      "name": "The Naked Truth | Facing Your Blogging Fears",
      "wp-excerpt": "Finding the freedom within ourselves to write “authentically” is not something that comes naturally to all bloggers.  Whether it’s the fear of rejection or the fear of creating a “situation” (as my mother used to call it) can be debilitating.  But I believe that social media and blogging is all about being true to who you are, and the only way to convey that is through authentic writing.",
      "yoast-reading-time": "2",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "The Naked Truth | Facing Your Blogging Fears",
      "wp-image-alt-text": "overcome fear of blogging",
      "slug": "the-naked-truth-facing-your-blogging-fears",
      "updated-on": "2023-04-01T12:22:26.165Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:26.165Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282202a53a59771eb3686e"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-05-14T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p><strong id=\"\">Reinventing the Heel | How 22 Women Found their Groove</strong>A few years ago I had the incredible honor to find myself featured within <strong id=\"\">Karen Deis’</strong> stellar book “<a href=\"http://test.www.loanofficertraining.com/products-page/featured/stilettos-in-a-loafer-world-mortgage-women-who-walk-their-talk/\" id=\"\"><strong id=\"\">Stilletos in a Loafer World</strong></a>.”  Karen had spent months interviewing top <strong id=\"\">mortgage women</strong> across the country who graciously shared their secrets to success, marketing tactics and the inspirational story that was the foundation of their career.What we didn’t see coming was the implosion of the<strong id=\"\"> mortgage market</strong> and the impact it would have on each of our lives.  This single event would leave an indelible mark on the lives of those ladies, including me.Some would walk away disenchanted, fearing an industry that had brought them the best and brightest days of their lives would never recover.  Others would hang on until it was too late and succumb to financial ruin.  For the few that remained, there were dark days ahead.  Still, each one clung to the promise that putting one foot in front of the other would bring them out of the fire and into the light.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/64282201e23a16efcb3c758a_Reinventing-The-Heel_Cover.jpeg\" alt=\"Reinventing the Heel | How 22 Women Found their Groove\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p>In her newly released follow up “<a href=\"http://www.loanofficertraining.com/products-page/books/reinventing-the-heel-the-guide-to-mortgage-marketing/\" id=\"\"><strong id=\"\">Reinventing the Heel</strong></a>,” Karen visits once again with the 22 survivors.  She discusses their battles, beliefs and daily victories.  You’ll enjoy each chapter as these women share their tremendous stories with Karen; a woman who has dedicated her entire career to the success of <strong id=\"\">mortgage women</strong> across the country.One lady, who I’m fortunate enough to call friend, shares her captivating story. <a href=\"http://www.loanofficerseminars.com/trainer-info.php?speaker_id=74\" id=\"\"><strong id=\"\"><em id=\"\">Louise Thaxton</em></strong></a><strong id=\"\"><em id=\"\">’s </em></strong>life was turned upside down when Hurricane Rita hit the Gulf of Mexico.  Dubbed one of the most intense Category 5 storms ever recorded, Louise’s family business was destroyed when Rita rolled through her small town.  Struggling to survive, Louise was faced with a decision.  Go BIG, or go home.  Not one to shrink from a challenge, Louise decided that going Big was the only way to live.  Her inspiring story is accentuated by the fact that not only did she succeed, but now finds herself firmly planted within the ranks of the “<a href=\"http://www.scotsmanguide.com/TO/overall_volume.asp?Page=2\" id=\"\"><strong id=\"\">Top 200 Mortgage Professionals</strong></a>” in the country.Louise is only one section in a book where every page tells the story of courage and compassion.  Sorrow and survival.  Dedication and determination.I highly suggest you pick up <a href=\"http://www.loanofficertraining.com/products-page/books/reinventing-the-heel-the-guide-to-mortgage-marketing/\" id=\"\"><strong id=\"\">Reinventing the Heel</strong></a> and share in the success of these incredible women.  I guarantee you will walk away feeling inspired to break through whatever barriers you’re facing in your career and empowered to take back our battered and bruised industry.</p>",
      "yoast-seo-meta-description": "Want to hear the secrets of top mortgage women across the country? Take a look at insights from the mortgage industry and their marketing strategies.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/05/reinventing-the-heel.png|https://rebekahradice.com/wp-content/uploads/2011/05/Reinventing-The-Heel_Cover.jpg",
      "name": "Reinventing the Heel | How 22 Women Found their Groove",
      "wp-excerpt": "A few years ago I had the incredible honor to find myself featured within Karen Deis’ stellar book “Stilletos in a Loafer World.”  Karen had spent months interviewing top mortgage women across the country who graciously shared their secrets to success, marketing tactics and the inspirational story that was the foundation of their career.",
      "yoast-reading-time": "3",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Reinventing the Heel | How 22 Women Found their Groove",
      "wp-image-alt-text": "|Reinventing the Heel | How 22 Women Found their Groove",
      "slug": "reinventing-the-heel-how-22-women-found-their-groove",
      "updated-on": "2023-04-01T12:22:25.845Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:25.845Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282201e23a1615d53c7592"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-05-08T00:00:00.000Z",
      "_draft": false,
      "wp-image-alt-text": null,
      "wp-content": "<p><strong id=\"\">Business is tough, so is life – get over it. </strong>– This lesson has come in many shapes and forms over the years, but the end result is always the same:  We all face challenges, some larger than others.  The fun in life comes when we take that adversity and turn it into a positive rather than settling for the large snowball life just threw at us.<strong id=\"\">Be the CEO of Your Life</strong> – What if you started running your life as if it were a company?  After all, if our own life isn’t functioning properly, how can we expect anything else around us to run smoothly?  Ask yourself these questions:</p><ol id=\"\"> \t<li id=\"\">As the CEO of your company, how are you performing?</li> \t<li id=\"\">How healthy is your company?</li> \t<li id=\"\">What are your companies’ long term goals and are there steps in place to achieve them?</li> \t<li id=\"\">How would you rate the success of your company?</li></ol><p>Whenever the satisfaction of achieving what you want to accomplish permeates your life, you will feel an extra bounce in your step along with a keener power of observation and an overall  deeper understanding of what makes you tick.  So get digging and find the answers to becoming the CEO of your own life!<strong id=\"\">Don’t Sit on the Sidelines – </strong>Face your fear of rejection and overcome your insecurities. No one else is responsible for you and how you feel about you but YOU. Either choose to get in the game or sit on the sidelines. But make no mistake–sitting on the sidelines is your choice.In my opinion, life is much too short to spend it as a bystander.  Get up, get going and get in the game!<strong id=\"\">Dare to Fail – </strong>There are NO guarantees in business, only chances we choose to take.  In order to succeed, are you willing to take a risk? Are you willing to say what you mean, do what you say, speak up for what you want, dive in, take a chance and live your life to its fullest?  If not, the consequences are no one else’s fault but your own.<strong id=\"\">Listen to your gut</strong> – Whether its gut instinct or that little voice in the back of your head, they’re both more than likely trying to get your attention.  Over the years, I’ve come to realize that the feeling in my gut isn’t simply indigestion.  It’s a wakeup call to pay attention to what’s going on around me.   It’s the moments I decide “nahhh…I know what I’m doing.  I don’t need to listen to my intuition” that my little house of cards begins to fall.Finally and most importantly –<strong id=\"\">Enjoy your moments - </strong>With our fast paced lives, finding time to slow down and enjoy the moment we’re in can be very difficult. But it’s in those moments that memories are made.  If we don’t slow down and fully engage, no matter how mundane it might feel – we’ll suddenly find that life has passed us by and Poof! – the moment we so wanted to create, has slipped through our fingers.Take time today to engage with those most precious to you and say thank you to a Mother that offered support, encouragement and unyielding love no matter what phase of our lives we’ve been in.I love you Mom!</p>",
      "yoast-seo-meta-description": "What if you started running your life as if it were a company? Learn to slow down and fully engage before you find that life has passed you by.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/05/business-life-lessons.png",
      "name": "Business & Life Lessons I Learned from My Mom",
      "wp-excerpt": "Business is tough, so is life – get over it. – This lesson has come in many shapes and forms over the years, but the end result is always the same:  We all face challenges, some larger than others.  The fun in life comes when we take that adversity and turn it into a positive rather than settling for the large snowball life just threw at us.",
      "yoast-reading-time": "3",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Business & Life Lessons I Learned from My Mom",
      "slug": "business-life-lessons-i-learned-from-my-mom",
      "updated-on": "2023-04-01T12:22:25.561Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:25.561Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822010da4496858f20b9d"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-05-04T00:00:00.000Z",
      "_draft": false,
      "wp-image-alt-text": null,
      "wp-content": "<p><strong id=\"\">Mothers Day Brunch Aboard the Royal Gorge Train</strong>It's almost Mothers Day.  A day to celebrate a woman that has had the strongest and most profound influence on our lives.  As I researched unique and fun ways to spend Sunday in Colorado, I came across this idea.</p><h3 id=\"\"><strong id=\"\">What is the Royal Gorge </strong>-</h3><p>The <strong id=\"\">Royal Gorge</strong>, also known as the Grand Canyon of the Arkansas is a canyon on the Arkansas River near <strong id=\"\">Canon City City Colorado</strong>. It's best known for the worlds highest suspension bridge and some amazing white water rafting.The <strong id=\"\">suspension bridge</strong> which spans the Arkansas River at a height of 1053 feet will literally take your breath away for two reasons. The beauty of the surrounding area and the weightless feeling associated with standing a mere quarter of a mile above ground.</p><h3 id=\"\"><strong id=\"\">The Royal Gorge Train</strong> -</h3><p>If you've never dined aboard a train, then you're in for a real treat this Mother's Day! Hop on board the <strong id=\"\">Royal Gorge Route Railroad’s annual Mother’s Day Brunch </strong>excursion on Sunday, May 8<sup id=\"\">th</sup>.Begin with a glass of champagne, followed by a variety of chef prepared entrees, and finish it off with a dessert that would make your mother proud.Take a look at the <strong id=\"\">Mother's Day Menu</strong> – YUM!•Baby green salad served with candied pecans, blue cheese crumbles, sun dried cranberries, and raspberry vinaigrette.•Steak Oscar (Beef tenderloin topped with lobster asparagus and Béarnaise sauce).•Quiche made with roasted pepper mushrooms, Prosciutto ham, Parmesan potato croquette, and sautéed vegetables.•Dessert: Seasonal - Chef's ChoiceAll Moms will also receive a red rose and glass of champagne. To book your Mothers Day Brunch, visit the <a href=\"https://www.royalgorgeroute.com/content/classesofservice/mothersday.aspx\" id=\"\">Royal Gorge Route Website</a>.<strong id=\"\">If you've never been to the Royal Gorge, here are a few fun facts:</strong></p><ul id=\"\"> \t<li id=\"\">The Mothers Day Tour is based on the railroad route bringing the ore out of Cripple Creek and Victor down to Florence to be processed and shipped out.</li> \t<li id=\"\">Cañon City was the birthplace of the Colorado Film Commission, the first Film Commission in the world.</li> \t<li id=\"\">Cañon City has an average of 325 days of sunshine every year, more than Palm Springs, CA and Miami, FL.</li> \t<li id=\"\">Up until 1990, you could make a phone call in Cañon City by dialing the last five numbers.</li></ul><p>However you choose to celebrate your Mother's Day, I hope it's with the people most important to you!</p>",
      "yoast-seo-meta-description": "Running out of ideas for Mother's Day? Hop on board the Royal Gorge Route Railroad’s annual Mother’s Day Brunch excursion on Sunday, May 8th.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/05/mothers-day.png",
      "name": "Mothers Day Brunch Aboard the Royal Gorge Train",
      "wp-excerpt": "It's almost Mothers Day.  A day to celebrate a woman that has had the strongest and most profound influence on our lives.  As I researched unique and fun ways to spend Sunday in Colorado, I came across this idea.",
      "yoast-reading-time": "2",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Mothers Day Brunch Aboard the Royal Gorge Train",
      "slug": "mothers-day-brunch-aboard-the-royal-gorge-train",
      "updated-on": "2023-04-01T12:22:25.478Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:25.478Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282201aa34620ce7525874"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-05-09T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p>In the book “<strong id=\"\">Riches in Niches: How to Make it Big in a Small Market</strong>” Susan Friedmann explains why <strong id=\"\">defining your niche</strong> rather than being <em id=\"\">everything to everybody</em> sets you apart as the go to professional within your field.For years we’ve been taught to soak in all of the information we can so that when it comes time to spit it out, we’re prepared.  My question as I read this book was this:  Are we really serving a higher purpose in knowing a little bit of everything or are we doing a disservice to ourselves and our clients by falling short of being an expert in our given <strong id=\"\">field </strong>or<strong id=\"\"> niche</strong>?With an industry as diverse as <strong id=\"\">Real Estate</strong>, defining your niche can be as simple as determining where your interests reside.</p><ul id=\"\"> \t<li id=\"\">Working with investors</li> \t<li id=\"\">Targeting a specific neighborhood</li> \t<li id=\"\">Working with Seniors</li> \t<li id=\"\">Resort or Vacation Homes</li> \t<li id=\"\">First Time Homebuyers</li> \t<li id=\"\">Single Moms</li> \t<li id=\"\">Online Marketing</li> \t<li id=\"\">Relocation</li></ul><p>In my previous career (or former life as I refer to it) I worked in radio as a morning co-host.  One of the most important factors in creating our daily content was understanding and identifying our target demographic.  In plain English – who was our listener and what did they want to hear?  It’s the same in Real Estate.  Once you’ve <strong id=\"\">identified a niche</strong>, you now need to <strong id=\"\">define who your target client is</strong>:</p><ul id=\"\"> \t<li id=\"\">Are they male or female?</li> \t<li id=\"\">What is their age?</li> \t<li id=\"\">What is their marital status?</li> \t<li id=\"\">Do they have kids and if so, how many?</li> \t<li id=\"\">Are they entrepreneurs?</li> \t<li id=\"\">Do they own a home currently?</li></ul><p>Now that you’ve determined who your target <strong id=\"\">real estateprospect</strong> is, you need to find them.  Where would this person spend time?  Listening to the radio, reading the newspaper, reading trade magazines, watching TV, interacting on Facebook, Twitter, Google, or maybe Linkedin?Narrowing in on your niche market allows you to get more bang for your marketing dollars.  Whatever you determine your niche to be, don’t delay in starting your new <strong id=\"\">marketing campaign</strong>.Learn how to <strong id=\"\">tap into your niche</strong> and you achieve unlimited possibilities.  Not only will you speak directly to your core audience, but you’ll to speak to your soul.Enjoying what you do and who you’re working with is a gift we should all give to ourselves sooner than later.</p>",
      "yoast-seo-meta-description": "Learn how to define your real estate marketing niche and tap into the riches in your niches and achieve unlimited possibilities.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/05/rich-niche.png",
      "name": "The Riches in Your Niches |How to Define & Conquer Your Niche",
      "wp-excerpt": "For years we’ve been taught to soak in all of the information we can so that when it comes time to spit it out, we’re prepared.  My question as I read this book was this:  Are we really serving a higher purpose in knowing a little bit of everything or are we doing a disservice to ourselves and our clients by falling short of being an expert in our given field or niche?",
      "yoast-reading-time": "2",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "The Riches in Your Niches |How to Define & Conquer Your Niche",
      "wp-image-alt-text": "rich niche",
      "slug": "the-riches-in-your-niches-how-to-define-conquer-your-niche",
      "updated-on": "2023-04-01T12:22:25.457Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:25.457Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282201a53a591e8bb3686c"
    },
    {
      "_archived": false,
      "wp-published-date": "2010-01-06T00:00:00.000Z",
      "_draft": false,
      "wp-excerpt": null,
      "wp-yoast-seo-title": null,
      "wp-content": "<figure class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div><img src=\"https://uploads-ssl.webflow.com/639f259a8defc0979cded246/64282201f47c9594943e026b_resolutions_291_20080229-1429271.jpeg\" alt=\"\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\"\">We spent the evening with a few good friends last night reflecting on 2009 and all that we looked forward to in 2010.  A thought provoking question was asked that made me wonder what your answer would be.</p><p id=\"\"><strong id=\"\"><em id=\"\">As you enter 2010, what would you absolutely NOT resolve to change in your life?</em></strong></p><p>We hear so much about what we will change in the New Year:  This will be the year I stop smoking, lose weight or get to the gym more often.  All of these are the typical \"I could do it any time of the year\" resolutions, yet somehow we find it easier to commit during this particular time than any other.  Let’s face it though, most of us make New Years resolutions we rarely keep because they’re stressful, produce an overwhelming amount of guilt when we don’t follow through and eventually lead to disappointment.Why then should we start our New Year reflecting on what we dislike within in our lives?  Why not instead reflect on the things that we loved about last year?  Those special people, memories and experiences that we want more of in our lives and simply will not part with in 2010.Granted, my big exclamation last night that \"I will NOT give up my evening bowl of popcorn\" may not be the most profound statement ever, but it is a resolution I plan on keeping!  Whether it’s silly or serious; drawing into your life those things that make you happy will create resolutions you can keep year after year.So what is it for you?  What will you commit to keeping, getting or having more of in your life???</p>",
      "yoast-seo-meta-description": "As you enter the new year, what will you commit to keeping, getting or having more of in your life?",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2010/01/new-year-resolution.png",
      "name": "The New Years Resolution You Won't Make",
      "yoast-reading-time": "2",
      "wp-category": "Social Media",
      "wp-image-alt-text": "new year resolution",
      "slug": "the-new-years-resolution-you-wont-make",
      "updated-on": "2023-04-01T12:22:25.333Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:25.333Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "64282201f47c9588133e026c"
    },
    {
      "_archived": false,
      "wp-published-date": "2011-04-28T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p>Utilizing <strong id=\"\">storytelling within your business</strong> can be a powerful way to connect with your clients.Through the magic of a past experience you’re able to craft unique stories that provide your client with a new perspective on their current situation.Whether it’s a story about what to expect throughout the process of working with you as a business coach or an analogy related to the search for their dream house, storytelling is a wonderful way to impart that message.And it can be used in a multitude of ways.It can make a difficult conversation comfortable for your clients.  It can also be used to spell out who you are, what your <strong id=\"\">core values</strong> are or how your business works.It sets the tone for your relationship and can turn a warm lead into a <strong id=\"\">client for life</strong>.Think about it.We all grew up listening to stories told by older generations around us.  It was through these stories that we formed opinions and gained an understanding of the world as it is and as it was.Stories can be so powerful that they have the ability to transform us to another place and time.  They give us the capacity to immediately “feel the moment” and connect in a way that would otherwise be difficult to describe.<strong id=\"\">Building relationships</strong> with prospective clients is our goal, but can be difficult if you can’t find common ground.Sharing an experience is important, but crafting it and having a purpose is even more important.   Focus on the “telling” of the story.The goal is to help your clients relate – whether it’s to you and your business or to a past client about a cautionary tale of what not to do when selling their home.Start creating your own stories and watch how people react.  You’ll be surprised at how easy it is to draw in a client when you allow them to understand who you are and connect with you on a much deeper level.What we do should be entirely about <strong id=\"\">building and maintaining relationships</strong>.  People want to know YOU and what makes you tick.  LET them.</p>",
      "yoast-seo-meta-description": "Utilizing storytelling within your business can be a powerful way to connect with your clients. Here's how to build better relationships with clients.",
      "wp-image-url": "https://rebekahradice.com/wp-content/uploads/2011/04/marketing-by-storytelling.jpg",
      "name": "Marketing By Storytelling – How to Build Better Client Relationships!",
      "wp-excerpt": "Utilizing storytelling within your business can be a powerful way to connect with your clients.  Through the magic of a past experience you’re able to craft unique stories that provide your client with a new perspective on their current situation.",
      "yoast-reading-time": "2",
      "wp-category": "Social Media",
      "wp-yoast-seo-title": "Marketing By Storytelling – How to Build Better Client Relationships!",
      "wp-image-alt-text": "marketing-by-storytelling",
      "slug": "marketing-by-storytelling-e2-80-93-how-to-build-better-client-relationships",
      "updated-on": "2023-04-01T12:22:24.995Z",
      "updated-by": "Person_5ea8597b86e1f710757e11ff",
      "created-on": "2023-04-01T12:22:24.995Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-01T12:29:39.577Z",
      "published-by": "Person_5ea8597b86e1f710757e11ff",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822005c4c4ca4d240fbe6"
    },
    {
      "_archived": false,
      "wp-published-date": "2009-10-03T00:00:00.000Z",
      "_draft": false,
      "yoast-seo-meta-description": "Aspiring to be a great leader? No problem! Uncover the art of delegation and learn how mastering this skill can propel you toward effective leadership success.",
      "yoast-reading-time": "6",
      "wp-yoast-seo-title": "To Be a Great Leader, You Have to Learn How to Delegate",
      "wp-content": "<p id=\"\"><br></p><p id=\"\">Does your day leave you feeling as if you're pulling your hair out due to an overwhelming amount of tasks?<br><br>While effective delegation can be difficult to implement, it plays an essential role in a leader's overall success.</p><p id=\"\">General George S. Patton, who led World War II campaigns in Africa, Sicily, and Europe, said this regarding the concept of delegation, </p><blockquote id=\"\">\"Never tell people how to do things. Tell them WHAT to do and they will surprise you with their ingenuity.\"</blockquote><p id=\"\">Delegation is the most powerful tool that business leaders have, and its implementation is critical to a leader's success. </p><p id=\"\">If a leader does not learn the \"art\" of delegation, even though he (or she) may possess many other leadership traits, he will never find himself coaching that \"Dream Team\" of employees, nor will he ever develop a Legacy-stage business.</p><p id=\"\">It's not easy to let someone else take the lead through delegation. It requires openness and an ability to recognize what is best for the organization. Supervisors must be willing to permit others to share in and take ownership of the problems that arise. </p><p id=\"\">It takes a great deal of trust and confidence in our ability as leaders to be \"interdependent\" with our employees.</p><p id=\"\">The benefits of delegation are two-fold: </p><p id=\"\">1. It increases a leader's individual productivity as well as the productivity of the organization</p><p id=\"\">2. It increases the initiative of employees by giving them an opportunity to grow and to accustom themselves to succeeding </p><p id=\"\">Leaders who fail to delegate create a barrier to effectiveness, productivity, and profits.</p><p id=\"\">So where to begin? </p><p id=\"\">Delegation is a process, so start slow. </p><p id=\"\">As managers, we have a tendency to \"dump\" projects on our employees without direction when we first begin delegating.</p><p id=\"\">That's only setting them up for failure. Create your plan, understand what you're giving away, then delegate with detailed instruction.</p>",
      "name": "To Be a Great Leader, You Have to Learn How to Delegate",
      "wp-category": "Social Media",
      "slug": "to-be-a-great-leader-you-have-to-learn-how-to-delegate",
      "updated-on": "2023-04-07T23:12:29.863Z",
      "updated-by": "Collaborator_63b3f1b4d1ecde1b9823dc80",
      "created-on": "2023-04-01T12:22:24.752Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-07T23:12:29.863Z",
      "published-by": "Collaborator_63b3f1b4d1ecde1b9823dc80",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "6428220013003e436ec9d5c7"
    },
    {
      "_archived": true,
      "wp-published-date": "1970-01-01T00:00:00.000Z",
      "_draft": false,
      "wp-content": "<p>It's easy to forget as I was so gently reminded this week that it is only our job as managers to manage our employees \" up or out.\" Plain and simple.</p>",
      "name": "Leaders - Are You Managing Up or Out?",
      "wp-category": "Social Media",
      "slug": "p-51",
      "updated-on": "2023-04-07T23:14:22.880Z",
      "updated-by": "Collaborator_63b3f1b4d1ecde1b9823dc80",
      "created-on": "2023-04-01T12:22:24.525Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": null,
      "published-by": null,
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822002b8b8c780247406c"
    },
    {
      "_archived": false,
      "wp-published-date": "2013-06-01T00:00:00.000Z",
      "_draft": false,
      "yoast-seo-meta-description": "Ready to cultivate an attitude of gratitude? You can. Make a resolution to embrace the power of gratitude to transform your life and business.",
      "yoast-reading-time": "3",
      "wp-yoast-seo-title": "My Resolution",
      "wp-content": "<p id=\"\">January 1st marks the day we all make our annual resolutions. </p><p id=\"\">Whether it's to get in shape, spend more time with loved ones or to just get organized, we expertly craft these New Years resolutions with an immense amount of hope and anticipation of the changes to come. </p><p id=\"\">And every year, the majority of us will somehow fail to follow through with the very resolutions that excited and inspired us only a few short months earlier. </p><p id=\"\">So this year, I'm resolving to do something a little different, a little outside the box...something completely absent of self. I'm resolving to spend the year in gratitude.</p><h3>An Attitude of Gratitude</h3><p id=\"\">As we endured a tremendously challenging year in the industry, it struck me that only the few that remain when all of the dust settles will really understand what true perseverance is all about. </p><p id=\"\">It isn't about \"sucking it up\" or \" dealing with the hand you've been dealt,\" but rather about finding yourself through tumultuous times and resolving to finally do a few things differently when given the opportunity.</p><p id=\"\">So what better opportunity than the New Year to make a resolution to say \"thank you\", \"I'm grateful for you\" or \"You have inspired me\"...just a little bit more to those around you?</p><p id=\"\">It was Albert Schweitzer, the Nobel Peace Prize recipient that said, “At times our own light goes out and is rekindled by a spark from another person. Each of us has cause to think with deep gratitude of those who have lighted the flame within us.”</p><p id=\"\">Each of us has someone or something that has lit the way even when the road feels darkest. It's within those dark moments that we become the person we've always hoped to be....and truly always were, we just hadn't allowed our own light to shine.</p><h4 id=\"\"><strong id=\"\"><em id=\"\">Who are the people in your life that need your gratitude today? </em></strong></h4><p id=\"\">By maintaining an attitude of gratitude with each new day this year, I hope to develop the habit of appreciating what I have instead of dwelling on what I don’t have. I look forward to the peace and joy that comes with knowing I've started my day on a positive note and maintained an outlook of gratitude towards the abundance that surrounds me. </p><p id=\"\">I look forward to not only the wins this coming year, but the challenges as well since I appreciate the lessons that come from those difficult moments we all must face.</p><p id=\"\">Whatever your resolutions this year, I hope you'll join with me in thanking those that have made your previous years a little bit more enjoyable and far more bearable on those days when life seemed bleakest. It's their susnshine that allows us to persevere!</p><p id=\"\">I wish for you a New Year full of love from family &amp; friends, good health so that you may enjoy each day to the fullest and joy so that you may feel fulfilled in each and every moment that you're given!</p>",
      "name": "My Resolution: Attitude of Gratitude",
      "wp-category": "Social Media",
      "slug": "my-resolution-attitude-of-gratitude",
      "updated-on": "2023-04-06T22:55:35.968Z",
      "updated-by": "Collaborator_63b3f1b4d1ecde1b9823dc80",
      "created-on": "2023-04-01T12:22:24.359Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-06T22:55:35.968Z",
      "published-by": "Collaborator_63b3f1b4d1ecde1b9823dc80",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822002a7f2861a150cb57"
    },
    {
      "_archived": false,
      "wp-published-date": "2010-02-03T00:00:00.000Z",
      "_draft": false,
      "yoast-seo-meta-description": "Curious about what makes you unique? No problem! Discover the power of embracing your passions and learn how they contribute to your personal growth and identity.",
      "yoast-reading-time": "3",
      "wp-yoast-seo-title": "What Makes You Unique",
      "wp-content": "<p id=\"\">Are you a new business owner or entrepreneur wondering what place social media has in your business?</p><p id=\"\">First and foremost, congratulations on making the leap. Owning a business of your own is a scary proposition, but one well worth the heartache, sleepless nights, and overwhelm that come with the territory.</p><p id=\"\">If you're a local business owner that's been working to establish a marketing presence in the offline world, transitioning that to viable online currency is an opportunity to expand beyond your current community.</p><p id=\"\">But where do you begin?</p><h3 id=\"\">1. Build Your Network</h3><p id=\"\">Social networking has revolutionized the way we establish relationships. With traditional networking, it was necessary to dress up, go to the office, and meet with customers to get face to face.</p><p id=\"\">Today, that necessity has faded away. </p><p id=\"\">Building relationships is now as simple as logging into your favorite social network. Yet, many business owners still struggle to communicate online.</p><p id=\"\">If you find yourself wondering how to connect, engage, and create more meaningful social media conversations, this 3-step plan will get you networking like a pro.</p><h3 id=\"\">2. Identify Your Competitive Advantage</h3><p id=\"\">Identify what makes you unique and sets you apart from your competition. What is it about you that have drawn people to you in the past?</p><p id=\"\">Answer these questions:</p><p id=\"\">- What unique skills or expertise do you possess that sets you apart from other professionals in your field?</p><p id=\"\">- What is your approach to delivering exceptional quality work and client satisfaction, and how does this differ from other professionals?</p><p id=\"\">- How do you stay up-to-date with the latest industry trends and technology, and how does this give you an edge over other professionals?</p><p id=\"\">You figure that out and you determine how to attract and build trust between you and those clients you serve.</p><h3>Become a Voracious Reader</h3><p id=\"\">Are you a voracious reader who can't get enough of books? Embrace your uniqueness! </p><p id=\"\">Being an insatiable book lover not only sets you apart from others, but it also offers numerous benefits for your personal growth. </p><p id=\"\">Dive into articles, books, ebooks and more to continuously improve your knowledge and skills.</p>",
      "name": "What Makes You Unique?",
      "wp-category": "Social Media",
      "slug": "what-makes-you-unique",
      "updated-on": "2023-04-07T22:42:16.634Z",
      "updated-by": "Collaborator_63b3f1b4d1ecde1b9823dc80",
      "created-on": "2023-04-01T12:22:24.341Z",
      "created-by": "Person_5ea8597b86e1f710757e11ff",
      "published-on": "2023-04-07T22:42:16.634Z",
      "published-by": "Collaborator_63b3f1b4d1ecde1b9823dc80",
      "_cid": "64282160bde7a70a6783bc04",
      "_id": "642822006a10ecbc4256d8e8"
    }
  ],
  "count": 44,
  "limit": 100,
  "offset": 400,
  "total": 444
}
